&НаКлиенте
Перем Кэш;

&НаКлиенте
Процедура Показать(ПараметрыСообщения) Экспорт
	// Функция открывает окно сопоставления документов и заполняет все реквизиты на форме	
//	Если ЛокальныйКэш.ТихийРежим Тогда
//		Возврат;
//	КонецЕсли;
	
	ПредупреждениеАдресСсылка	= ПараметрыСообщения.АдресСсылка;
	ПредупреждениеСсылка		= ПараметрыСообщения.ТекстСсылка;
	ПредупреждениеТекст			= ПараметрыСообщения.Текст;
	Попытка
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ОткрытьМодально();
		#Иначе
			Открыть();
		#КонецЕсли
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПредупреждениеСсылкаНажатие(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	НачатьЗапускПриложения(Новый ОписаниеОповещения("ПослеЗапуска",ЭтаФорма),ПредупреждениеАдресСсылка);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗапуска(РР,ДД) Экспорт
КонецПроцедуры
