
	Процедура ПриКопировании(ОбъектКопирования)  Экспорт //++ МВ:Овчинников 11.06.2021  •0
		ЭтотОБъект._Order_ID="";
		ЭтоТОбъект.Статус="";
		ЭтотОбъект.ОшибкаОтправки="";
		Для Каждого Стр Из Товары Цикл
			Стр.Статус="";
			Стр.order_ID="";
			Стр.ОшибкаОтправки="";
			Если Не ЗначениеЗаполнено(Стр.КодТНВЭД) тогда
				Стр.КодТНВЭД=Стр.GTIN.КодТНВЭД;
			Конецесли;
			Если ЗначениеЗаполнено(Стр.ДатаПроизводства) тогда
				датаПроизводства=Стр.ДатаПроизводства;
			Конецесли;	
		КонецЦикла;
		

		Если ОбъектКопирования.ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ОтчетОбИспользовании Тогда
			ЭтотОбъект.ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВводВОборот;
			Для Каждого Стр_1 Из СерийныеНомера Цикл
				cis=Стр_1.cis;
				Если Найти(Стр_1.cis,"%1D")>0 
					//ИЛИ ТекущийПользователь.СайтыВходаВСистему.Наименование="Молоко" Тогда
					Тогда
					
					cis=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПолучитьКороткийНомерКМ_Сайт(Стр_1.cis,
					ТекущийПользователь.СайтыВходаВСистему.Наименование);
					
					
				ИначеЕсли ТекущийПользователь.СайтыВходаВСистему.Наименование="Фото" Тогда
						cis=Сред(cis,1,38);
				ИначеЕсли ТекущийПользователь.СайтыВходаВСистему.Наименование="Молоко" Тогда
					Если Сред(cis,32,4)="7003" Тогда	
						 	cis=Сред(cis,1,45);
						ИначеЕсли Сред(cis,32,2)="17" Тогда
						 	cis=Сред(cis,1,39);
							
						ИначеЕсли СтрДлина(cis)<=30 Тогда
							cis=Сред(cis,1,24);
							
						Иначе
							cis=Сред(cis,1,31);
							
						КонецЕсли;
													
													
				Иначе
							cis=Сред(cis,1,31);
						
													
				КонецЕсли;
				Стр_1.cis=cis;
			Конеццикла;
			
		КонецЕсли;
		
	КонецПроцедуры

	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		// Вставить содержимое обработчика.
		ДатаПроизводства=ТекущаяДата();
		ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
		Если ДанныеЗаполнения <> Неопределено Тогда
			
			Если ТипДанныхЗаполнения <> Тип("Структура")
				И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
				ДокументОснование = ДанныеЗаполнения;
			ИначеЕсли ТипДанныхЗаполнения = Тип("Структура")
				И ДанныеЗаполнения.Свойство("Основание")
				И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Основание.Метаданные()) Тогда
				ДокументОснование = ДанныеЗаполнения.Основание;
			КонецЕсли;

			
			
			
			Если ДокументОснование <> Неопределено Тогда
				
			 	Если ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.Отгрузка_ХамелеонЦРПТ") Тогда
					
					
				ДокОснование=Документоснование;
				ЗаполнитьЗначенияСвойств(ЭтотОБъект,ДокОснование,,"Номер,Дата,_Order_ID,Статус");
				
					ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВыводИзОборота;
				
								
					Для Каждого Стр_1 Из Документоснование.СерийныеНомера    Цикл
						
						Добав=СерийныеНомера.Добавить();
						ЗаполнитьЗначенияСвойств(Добав,Стр_1);
						
						КонецЦикла;;
						
						Для Каждого Стр_1 Из Документоснование.Товары    Цикл
						
						Добав=Товары.Добавить();
						ЗаполнитьЗначенияСвойств(Добав,Стр_1);
						
						Если Стр_1.КоличествоКМ<>0 Тогда
							Добав.СуммаНДС=Стр_1.НДС/Стр_1.КоличествоКМ;
						КонецЕсли;
						КонецЦикла;;

					
				ИначеЕсли ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ЗаказМарок_ХамелеонЦРПТ") Тогда
						ДДДД=Документы.СозданиеНовогоШкНаКороба_ХамелеонЦРПТ.НайтиПоРеквизиту("ЗаказДляФормированияНомераКОроба",ДокументОснование);
								
						
							//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
						// Данный фрагмент построен конструктором.
						// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
						
						
				//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
			 			
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТОстатки.СерийныйНомер КАК СерийныйНомер,
							|	ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТОстатки.КоличествоОстаток КАК КоличествоОстаток,
							|	ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТОстатки.Продукция КАК Продукция
							|ИЗ
							|	РегистрНакопления.ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ.Остатки(
							|			,
							|			Организация = &Организация
							|				И СерийныйНомер В
							|					(ВЫБРАТЬ
							|						ОстаткиКМЭмитированые_ХамелеонЦРПТ.СерийныйНомер
							|					ИЗ
							|						РегистрНакопления.ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ КАК ОстаткиКМЭмитированые_ХамелеонЦРПТ
							|					ГДЕ
							|						ОстаткиКМЭмитированые_ХамелеонЦРПТ.Регистратор = &Регистратор)) КАК ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТОстатки
							|ГДЕ
							|	ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТОстатки.КоличествоОстаток > 0";
						
						Запрос.УстановитьПараметр("Организация", ДокументОснование.Организация);
						Если ЗначениеЗаполнено(ДДДД)  ТОгда
							Запрос.УстановитьПараметр("Регистратор", ДДДД);
						Иначе
							Запрос.УстановитьПараметр("Регистратор", ДокументОснование.Ссылка);
						КонецЕсли;
						
						РезультатЗапроса_Д = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
						
						Для Каждого стр Из РезультатЗапроса_Д цикл
							Стр.СерийныйНомер=Врег(Стр.СерийныйНомер);
						Конеццикла;
						
						РезультатЗапроса_Д.Индексы.Добавить("СерийныйНомер");
						Если РезультатЗапроса_Д .Количество()>0 Тогда
							
										
						
								//Если Документоснование.Статус<>Перечисления.СтатусыДокументов_ХамелеонЦРПТ.КМЭмитирован Тогда
								//	Сообщить("Документ заказа по маркам доолжен быть в статусе КМ эмитированы");
								//	Возврат;
								//КонецЕсли;
								ДокОснование=Документоснование;
								ЗаполнитьЗначенияСвойств(ЭтотОБъект,ДокОснование,,"Номер,Дата,_Order_ID,Статус");
								
								ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ОтчетОбИспользовании;
								
								Запрос = Новый Запрос;
								Запрос.Текст = 
									"ВЫБРАТЬ
									|	НомераКМ_ХамелеонЦРПТ.НомерКМ,
									|	НомераКМ_ХамелеонЦРПТ.НомерКМ_Короткий
									|ИЗ
									|	РегистрСведений.НомераКМ_ХамелеонЦРПТ КАК НомераКМ_ХамелеонЦРПТ
									|ГДЕ
									|	НомераКМ_ХамелеонЦРПТ.ДокументЗаказа = &ДокументЗаказа";
								
								Запрос.УстановитьПараметр("ДокументЗаказа", ДокОснование);
								
								РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗАпроса.Прямой);
								
								
								Товары_1=ДокОснование.Товары.Выгрузить();
								
												 Годендо=Неопределено;
															 ЧасыДо=Неопределено;
															 ДатаПроизводства=Неопределено;
											               НомерВСД=Неопределено;
								
								Если РезультатЗапроса.Количество()>0 Тогда 
									КоличествоНеобходмо=РезультатЗапроса.Количество();
									Смещение=0;
									Пока КоличествоНеобходмо>0 Цикл
										Если КоличествоНеобходмо<=99999 Тогда
											Для Сч=Смещение По  Смещение+КоличествоНеобходмо-1 Цикл
												
												cis_=РезультатЗапроса[Сч].НомерКМ;
												               НомерКМ_Короткий=РезультатЗапроса[Сч].НомерКМ_Короткий;
											cis=НомерКМ_Короткий;
											Стр_1П=РезультатЗапроса_Д.Найти(Врег(cis),"СерийныйНомер");//НайтиСтроки(Новый Структура("СерийныйНомер",cis));
											Если  Стр_1П=Неопределено тогда
												Продолжить;
											Конецесли;
											//	Если ППП.Количество()=0 
													//И ППП.КоличествоОстаток<=0 
											//		Тогда
													//Продолжить;
											//	КонецЕсли;
												Продукция=Неопределено;
												//Для Каждого Стр_1П Из ППП Цикл
													Если ЗначениеЗаполнено(Стр_1П.Продукция) Тогда
														Продукция=Стр_1П.Продукция
													КонецЕсли;
													
													
													
												//Конеццикла;
												
												
												ДД=ЭтотОБъект.СерийныеНомера.Добавить();
												Если ЗначениеЗаполнено(Продукция) Тогда
													ДД.НаименованиеТовара=Продукция
												Иначе
													Если Сред(cis,1,2)="01" тогда
													
														ДД.GTIN=Сред(cis,3,14);
													Иначе
														ДД.GTIN=Сред(cis,1,14);
														
													КонецЕсли;
													ДД.НаименованиеТовара=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",число(ДД.GTIN));;
												КонецЕсли;
												ДД.cis=cis_;
												
												Для Каждого СТР_1 Из Товары_1 Цикл
													
													Если Стр_1.КоличествоКМ>0 Тогда
														Если Стр_1.GTIN.GTIN=ДД.НаименованиеТовара.GTIN Тогда
															 Годендо=Стр_1.ГоденДо;
															 ЧасыДо=Стр_1.Дочаса;
															 ДатаПроизводства=Стр_1.ДатаПроизводства;
															 НомерВСД=Стр_1.НомерВСД;
															 Стр_1.КоличествоКМ=Стр_1.КоличествоКМ-1;
															 Прервать;
														Конецесли;
														
													Конецесли;
													
												Конеццикла;
												
												
												
											//	часыДо=Ложь;
												//Если ТекущийПользователь.СайтыВходаВСистему.Наименование="Молоко" Тогда
												//	Попытка
												//		Если Сред(cis,32,4)="7003" Тогда	
												//		 	ШтрихКод=Сред(cis,1,45);
												//			ДатаГоденДо=дата("20"+Сред(cis,36,2),Сред(cis,38,2),Сред(cis,40,2),Сред(cis,42,2),Сред(cis,44,2),0);
												//			часыДо=Истина;
												//		ИначеЕсли Сред(cis,32,2)="17" Тогда
												//		 	ШтрихКод=Сред(cis,1,39);
												//			ДатаГоденДо=дата("20"+Сред(cis,34,2),Сред(cis,36,2),Сред(cis,38,2));
												//			
												//		Иначе
												//			ШтрихКод=Сред(cis,1,31);
												//			ДатаГоденДо=Дата(1,1,1);
												//			
												//		КонецЕсли;
												//	Исключение
												//		ДатаГоденДо=Дата(1,1,1);
												//		
												//	КонецПопытки;
												//	
												//	
												//Иначе
												//	ДатаГоденДо=Дата(1,1,1);
												//	
												//КонецЕсли;
												
												
																				//ДатаГоденДо=дата("20"+Сред(cis,34,2),Сред(cis,36,2),Сред(cis,38,2));
												
												
												Добав=Товары.НайтиСтроки(Новый Структура("GTIN,Годендо,ЧасыДо,ДатаПроизводства,НомерВСД",
												ДД.НаименованиеТовара,Годендо,ЧасыДо,ДатаПроизводства,НомерВСД));
												Если Добав.Количество()=0 Тогда
													Добав=Товары.Добавить();
													Добав.GTIN=ДД.НаименованиеТовара;
													Добав.ЧасыДо=ЧасыДо;
													Добав.Годендо=ГоденДо;
													Добав.ДатаПроизводства=ДатаПроизводства;
													Добав.ДекларацияИлиСертификатСоответствия=РЕгистрыСведений.ПодтверждающиеДокументы_ХамелеонЦРПТ.ПолучитьПоследнее(
															ТекущаяДата(),Новый Структура("Продукция",Добав.GTIN)).Документ;
													Добав.НомерСтрокиСвязи=Добав.НомерСтроки;
													Добав.КодТНВЭД=Добав.GTIN.КодТНВЭД;
													
													Добав.НомерВСД=НомерВСД;
													//СтрокиДляДатаПроизводстваИНомераВСД=ДокументОснование.Товары.НайтиСтроки(Новый Структура("GTIN,ГоденДо,ДоЧаса",
													//Добав.GTIN,Добав.Годендо,Добав.ЧасыДо));
													//Если СтрокиДляДатаПроизводстваИНомераВСД.Количество()>0  Тогда
													//	Добав.НомерВСД=СтрокиДляДатаПроизводстваИНомераВСД[0].НомерВСД;
													//	Добав.ДатаПроизводства=СтрокиДляДатаПроизводстваИНомераВСД[0].ДатаПроизводства;
													//КонецЕсли;
													
													
													//Добав.НомерВСД=
												Иначе
													Добав=Добав[0];
												КонецЕсли;
												ДД.НомерСтрокиСвязи=Добав.НомерСтрокиСвязи;
												Добав.КоличествоКМ=Добав.КоличествоКМ+1;
												Добав.СпособВыпускаТоваров="";
												
											КонецЦикла;;
											
											КоличествоНеобходмо=0;               
										Иначе
											НадоСпсать=Мин(КоличествоНеобходмо,99999);
											ДокумС=Документы.ВводВОборот_ХамелеонЦРПТ.СоздатьДокумент();
											ЗаполнитьЗначенияСвойств(ДокумС,ЭтотОбъект,,"Номер,Дата,_Order_ID,Статус");
											ДокумС.Дата=ТекущаяДата();
											Для Сч=Смещение По Смещение+НадоСпсать-1 Цикл
												cis_=РезультатЗапроса[Сч].НомерКМ;
												 НомерКМ_Короткий=РезультатЗапроса[Сч].НомерКМ_Короткий;
												cis=НомерКМ_Короткий;
											
												ППП=РезультатЗапроса_Д.НайтиСтроки(Новый Структура("СерийныйНомер",cis));
												Если ППП.Количество()=0 
													//И ППП.КоличествоОстаток<=0 
													Тогда
													Продолжить;
												КонецЕсли;
												Продукция=Неопределено;
												Для Каждого Стр_1П Из ППП Цикл
													Если ЗначениеЗаполнено(Стр_1П.Продукция) Тогда
														Продукция=Стр_1П.Продукция
													КонецЕсли;
													
													
												Конеццикла;
												
												
												ДД=ДокумС.СерийныеНомера.Добавить();
												Если ЗначениеЗаполнено(Продукция) Тогда
													ДД.НаименованиеТовара=Продукция
												Иначе
													Если Сред(cis,1,2)="01" тогда
													
														ДД.GTIN=Сред(cis,3,14);
													Иначе
														ДД.GTIN=Сред(cis,1,14);
														
													КонецЕсли;
													ДД.НаименованиеТовара=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",число(ДД.GTIN));;
												КонецЕсли;
												ДД.cis=cis_;
												
		
												Для Каждого СТР_1 Из Товары_1 Цикл
													
													Если Стр_1.КоличествоКМ>0 Тогда
														Если Стр_1.GTIN.GTIN=ДД.НаименованиеТовара.GTIN Тогда
															 Годендо=Стр_1.ГоденДо;
															 ЧасыДо=Стр_1.Дочаса;
															 ДатаПроизводства=Стр_1.ДатаПроизводства;
															 НомерВСД=Стр_1.НомерВСД;
															 Стр_1.КоличествоКМ=Стр_1.КоличествоКМ-1;
															 Прервать;
														Конецесли;
														
													Конецесли;
													
												Конеццикла;
												
												
												
											//	часыДо=Ложь;
												//Если ТекущийПользователь.СайтыВходаВСистему.Наименование="Молоко" Тогда
												//	Попытка
												//		Если Сред(cis,32,4)="7003" Тогда	
												//		 	ШтрихКод=Сред(cis,1,45);
												//			ДатаГоденДо=дата("20"+Сред(cis,36,2),Сред(cis,38,2),Сред(cis,40,2),Сред(cis,42,2),Сред(cis,44,2),0);
												//			часыДо=Истина;
												//		ИначеЕсли Сред(cis,32,2)="17" Тогда
												//		 	ШтрихКод=Сред(cis,1,39);
												//			ДатаГоденДо=дата("20"+Сред(cis,34,2),Сред(cis,36,2),Сред(cis,38,2));
												//			
												//		Иначе
												//			ШтрихКод=Сред(cis,1,31);
												//			ДатаГоденДо=Дата(1,1,1);
												//			
												//		КонецЕсли;
												//	Исключение
												//		ДатаГоденДо=Дата(1,1,1);
												//		
												//	КонецПопытки;
												//	
												//	
												//Иначе
												//	ДатаГоденДо=Дата(1,1,1);
												//	
												//КонецЕсли;
												
												
																				//ДатаГоденДо=дата("20"+Сред(cis,34,2),Сред(cis,36,2),Сред(cis,38,2));
												
												
												Добав=Товары.НайтиСтроки(Новый Структура("GTIN,Годендо,ЧасыДо,ДатаПроизводства,НомерВСД",
												ДД.НаименованиеТовара,Годендо,ЧасыДо,ДатаПроизводства,НомерВСД));
												Если Добав.Количество()=0 Тогда
													Добав=Товары.Добавить();
													Добав.GTIN=ДД.НаименованиеТовара;
													Добав.ЧасыДо=ЧасыДо;
													Добав.Годендо=ГоденДо;
													Добав.ДатаПроизводства=ДатаПроизводства;
													Добав.ДекларацияИлиСертификатСоответствия=РЕгистрыСведений.ПодтверждающиеДокументы_ХамелеонЦРПТ.ПолучитьПоследнее(
															ТекущаяДата(),Новый Структура("Продукция",Добав.GTIN)).Документ;
													Добав.НомерСтрокиСвязи=Добав.НомерСтроки;
													Добав.КодТНВЭД=Добав.GTIN.КодТНВЭД;
													
													Добав.НомерВСД=НомерВСД;
													//СтрокиДляДатаПроизводстваИНомераВСД=ДокументОснование.Товары.НайтиСтроки(Новый Структура("GTIN,ГоденДо,ДоЧаса",
													//Добав.GTIN,Добав.Годендо,Добав.ЧасыДо));
													//Если СтрокиДляДатаПроизводстваИНомераВСД.Количество()>0  Тогда
													//	Добав.НомерВСД=СтрокиДляДатаПроизводстваИНомераВСД[0].НомерВСД;
													//	Добав.ДатаПроизводства=СтрокиДляДатаПроизводстваИНомераВСД[0].ДатаПроизводства;
													//КонецЕсли;
													
													
													//Добав.НомерВСД=
												Иначе
													Добав=Добав[0];
												КонецЕсли;
																						ДД.НомерСтрокиСвязи=Добав.НомерСтрокиСвязи;
												Добав.КоличествоКМ=Добав.КоличествоКМ+1;
												Добав.СпособВыпускаТоваров="";

											КонецЦикла;
											Смещение=Смещение+НадоСпсать;
											КоличествоНеобходмо=КоличествоНеобходмо-НадоСпсать;
											ДокумС.Записать();
											Сообщить("Создан документ "+Строка(ДокумС.Ссылка));
										КонецЕсли;
										
									КонецЦикла;
								Иначе
									
									Для Каждого Стр_1 Из Документоснование.КМИзAPI    Цикл
											cis=Стр_1.НомерКМ_Короткий;
											cis_=Стр_1.НомерКМ;
											
											ППП=РезультатЗапроса_Д.НайтиСтроки(Новый Структура("СерийныйНомер",cis));
															Если ППП=Неопределено ИЛИ (ППП.Количество()=0 
													//И ППП.КоличествоОстаток<=0
													) 
													Тогда
													Продолжить;
												КонецЕсли;
												Продукция=Неопределено;
												Для Каждого Стр_1П Из ППП Цикл
													Если ЗначениеЗаполнено(Стр_1П.Продукция) Тогда
														Продукция=Стр_1П.Продукция;
														Прервать;
													КонецЕсли;
													
													
												Конеццикла;
												
												
												ДД=ЭтотОБъект.СерийныеНомера.Добавить();
												Если ЗначениеЗаполнено(Продукция) Тогда
													ДД.НаименованиеТовара=Продукция
												Иначе
													Если Сред(cis,1,2)="01" тогда
													
														ДД.GTIN=Сред(cis,3,14);
													Иначе
														ДД.GTIN=Сред(cis,1,14);
														
													КонецЕсли;
													ДД.НаименованиеТовара=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",число(ДД.GTIN));;
												КонецЕсли;
												ДД.cis=cis_;
												
												Для Каждого СТР_1 Из Товары_1 Цикл
													
													Если Стр_1.КоличествоКМ>0 Тогда
														Если Стр_1.GTIN.GTIN=ДД.НаименованиеТовара.GTIN Тогда
															 Годендо=Стр_1.ГоденДо;
															 ЧасыДо=Стр_1.Дочаса;
															 ДатаПроизводства=Стр_1.ДатаПроизводства;
															 НомерВСД=Стр_1.НомерВСД;
															 Стр_1.КоличествоКМ=Стр_1.КоличествоКМ-1;
															 Прервать;
														Конецесли;
														
													Конецесли;
													
												Конеццикла;
												
												
												
											//	часыДо=Ложь;
												//Если ТекущийПользователь.СайтыВходаВСистему.Наименование="Молоко" Тогда
												//	Попытка
												//		Если Сред(cis,32,4)="7003" Тогда	
												//		 	ШтрихКод=Сред(cis,1,45);
												//			ДатаГоденДо=дата("20"+Сред(cis,36,2),Сред(cis,38,2),Сред(cis,40,2),Сред(cis,42,2),Сред(cis,44,2),0);
												//			часыДо=Истина;
												//		ИначеЕсли Сред(cis,32,2)="17" Тогда
												//		 	ШтрихКод=Сред(cis,1,39);
												//			ДатаГоденДо=дата("20"+Сред(cis,34,2),Сред(cis,36,2),Сред(cis,38,2));
												//			
												//		Иначе
												//			ШтрихКод=Сред(cis,1,31);
												//			ДатаГоденДо=Дата(1,1,1);
												//			
												//		КонецЕсли;
												//	Исключение
												//		ДатаГоденДо=Дата(1,1,1);
												//		
												//	КонецПопытки;
												//	
												//	
												//Иначе
												//	ДатаГоденДо=Дата(1,1,1);
												//	
												//КонецЕсли;
												
												
																				//ДатаГоденДо=дата("20"+Сред(cis,34,2),Сред(cis,36,2),Сред(cis,38,2));
												
												
												Добав=Товары.НайтиСтроки(Новый Структура("GTIN,Годендо,ЧасыДо,ДатаПроизводства,НомерВСД",
												ДД.НаименованиеТовара,Годендо,ЧасыДо,ДатаПроизводства,НомерВСД));
												Если Добав.Количество()=0 Тогда
													Добав=Товары.Добавить();
													Добав.GTIN=ДД.НаименованиеТовара;
													Добав.ЧасыДо=ЧасыДо;
													Добав.Годендо=ГоденДо;
													Добав.ДатаПроизводства=ДатаПроизводства;
													Добав.ДекларацияИлиСертификатСоответствия=РЕгистрыСведений.ПодтверждающиеДокументы_ХамелеонЦРПТ.ПолучитьПоследнее(
															ТекущаяДата(),Новый Структура("Продукция",Добав.GTIN)).Документ;
													Добав.НомерСтрокиСвязи=Добав.НомерСтроки;
													Добав.КодТНВЭД=Добав.GTIN.КодТНВЭД;
													
													Добав.НомерВСД=НомерВСД;
													//СтрокиДляДатаПроизводстваИНомераВСД=ДокументОснование.Товары.НайтиСтроки(Новый Структура("GTIN,ГоденДо,ДоЧаса",
													//Добав.GTIN,Добав.Годендо,Добав.ЧасыДо));
													//Если СтрокиДляДатаПроизводстваИНомераВСД.Количество()>0  Тогда
													//	Добав.НомерВСД=СтрокиДляДатаПроизводстваИНомераВСД[0].НомерВСД;
													//	Добав.ДатаПроизводства=СтрокиДляДатаПроизводстваИНомераВСД[0].ДатаПроизводства;
													//КонецЕсли;
													
													
													//Добав.НомерВСД=
												Иначе
													Добав=Добав[0];
												КонецЕсли;

												ДД.НомерСтрокиСвязи=Добав.НомерСтрокиСвязи;
												Добав.КоличествоКМ=Добав.КоличествоКМ+1;
												Добав.СпособВыпускаТоваров="";
												
											КонецЦикла;;
									   КонецЕсли;

							
							
							Возврат;
						КонецЕсли;
						
						//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
						
						
						
						
						
						
						
						
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	ОстаткиКМЭмитированые_ХамелеонЦРПТОстатки.СерийныйНомер КАК СерийныйНомер,
							|	СУММА(ОстаткиКМЭмитированые_ХамелеонЦРПТОстатки.КоличествоОстаток) КАК КоличествоОстаток,
							|	ОстаткиКМЭмитированые_ХамелеонЦРПТОстатки.Продукция КАК Продукция
							|ИЗ
							|	РегистрНакопления.ОстаткиКМЭмитированые_ХамелеонЦРПТ.Остатки(
							|			,
							|			Организация = &Организация
							|				И СерийныйНомер В
							|					(ВЫБРАТЬ
							|						ОстаткиКМЭмитированые_ХамелеонЦРПТ.СерийныйНомер
							|					ИЗ
							|						РегистрНакопления.ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ КАК ОстаткиКМЭмитированые_ХамелеонЦРПТ
							|					ГДЕ
							|						ОстаткиКМЭмитированые_ХамелеонЦРПТ.Регистратор = &Регистратор
							|			
							|					ОБЪЕДИНИТЬ
							|			
							|					ВЫБРАТЬ
							|						ОстаткиКМЭмитированые_ХамелеонЦРПТ.СерийныйНомер
							|					ИЗ
							|						РегистрНакопления.ОстаткиКМЭмитированые_ХамелеонЦРПТ КАК ОстаткиКМЭмитированые_ХамелеонЦРПТ
							|					ГДЕ
							|						ОстаткиКМЭмитированые_ХамелеонЦРПТ.Регистратор = &Регистратор)) КАК ОстаткиКМЭмитированые_ХамелеонЦРПТОстатки
							|
							|СГРУППИРОВАТЬ ПО
							|	ОстаткиКМЭмитированые_ХамелеонЦРПТОстатки.СерийныйНомер,
							|	ОстаткиКМЭмитированые_ХамелеонЦРПТОстатки.Продукция
							|ИТОГИ
							|	СУММА(КоличествоОстаток)
							|ПО
							|	СерийныйНомер,
							|	Продукция";
						
						Запрос.УстановитьПараметр("Организация", ДокументОснование.Организация);
						Если ЗначениеЗаполнено(ДДДД)  ТОгда
							Запрос.УстановитьПараметр("Регистратор", ДДДД);
						Иначе
							Запрос.УстановитьПараметр("Регистратор", ДокументОснование.Ссылка);
						КонецЕсли;
						
						РезультатЗапроса_М = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
						
						РезультатЗапроса_М.Индексы.Добавить("СерийныйНомер");
					

						
						
						//Если Документоснование.Статус<>Перечисления.СтатусыДокументов_ХамелеонЦРПТ.КМЭмитирован Тогда
						//	Сообщить("Документ заказа по маркам доолжен быть в статусе КМ эмитированы");
						//	Возврат;
						//КонецЕсли;
						ДокОснование=Документоснование;
						ЗаполнитьЗначенияСвойств(ЭтотОБъект,ДокОснование,,"Номер,Дата,_Order_ID,Статус");
						
						Если ДокОснование.СпособВыпускаТоваров=Перечисления.СпособВыпускаТоваров_ХамелеонЦРПТ.ВвезенВРФ Тогда
							ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ИмпортСФТС;
						ИначеЕсли ДокОснование.СпособВыпускаТоваров=Перечисления.СпособВыпускаТоваров_ХамелеонЦРПТ.МаркировкаОстатков Тогда
							ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.МаркировкаОстатков;
						ИначеЕсли ДокОснование.СпособВыпускаТоваров=Перечисления.СпособВыпускаТоваров_ХамелеонЦРПТ.ПроизведенВРФ Тогда
							ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВводВОборот;
						
							
						КонецЕсли;
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	НомераКМ_ХамелеонЦРПТ.НомерКМ,
							|	НомераКМ_ХамелеонЦРПТ.НомерКМ_Короткий
							|ИЗ
							|	РегистрСведений.НомераКМ_ХамелеонЦРПТ КАК НомераКМ_ХамелеонЦРПТ
							|ГДЕ
							|	НомераКМ_ХамелеонЦРПТ.ДокументЗаказа = &ДокументЗаказа";
						
						Запрос.УстановитьПараметр("ДокументЗаказа", ДокОснование);
						
						РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗАпроса.Прямой);
						
						Если РезультатЗапроса.Количество()>0 Тогда 
							КоличествоНеобходмо=РезультатЗапроса.Количество();
							Смещение=0;
							Пока КоличествоНеобходмо>0 Цикл
								Если КоличествоНеобходмо<=99999 Тогда
									Для Сч=Смещение По  Смещение+КоличествоНеобходмо-1 Цикл
										               НомерКМ_Короткий=РезультатЗапроса[Сч].НомерКМ_Короткий;
								Если ЗначениеЗаполнено(НомерКМ_Короткий) тогда
									cis=НомерКМ_Короткий;
								Иначе
										GGG=РезультатЗапроса[Сч].НомерКМ;
										cis=Сред(СтрЗаменить(GGG,"%1D",""),1,38);
										
										Если Сред(cis,32,3)<>"240" Тогда
											//cis=Сред(cis,1,31);
											
											cis=Сред(GGG,1,Найти(GGG,"%1D")-1);
											cis=РаскодироватьСтроку(cis,СпособКодированияСтроки.КодировкаURL);
										КонецЕсли;
									КонецЕсли;
										ППП=РезультатЗапроса_М.НайтиСтроки(Новый Структура("СерийныйНомер",cis));
										Если ППП.Количество()=0 
											//И ППП.КоличествоОстаток<=0 
											Тогда
											Продолжить;
										КонецЕсли;
										Продукция=Неопределено;
										Для Каждого Стр_1П Из ППП Цикл
											Если ЗначениеЗаполнено(Стр_1П.Продукция) Тогда
												Продукция=Стр_1П.Продукция
											КонецЕсли;
											
											
										Конеццикла;
										
										
										ДД=ЭтотОБъект.СерийныеНомера.Добавить();
										Если ЗначениеЗаполнено(Продукция) Тогда
											ДД.НаименованиеТовара=Продукция
										Иначе
											Если Сред(cis,1,2)="01" тогда
											
												ДД.GTIN=Сред(cis,3,14);
											Иначе
												ДД.GTIN=Сред(cis,1,14);
												
											КонецЕсли;
											ДД.НаименованиеТовара=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",число(ДД.GTIN));;
										КонецЕсли;
										ДД.cis=cis;
										
										Добав=Товары.Найти(ДД.НаименованиеТовара,"GTIN");
										Если Добав=Неопределено Тогда
											Добав=Товары.Добавить();
											Добав.GTIN=ДД.НаименованиеТовара;
											Добав.ДекларацияИлиСертификатСоответствия=РЕгистрыСведений.ПодтверждающиеДокументы_ХамелеонЦРПТ.ПолучитьПоследнее(
													ТекущаяДата(),Новый Структура("Продукция",Добав.GTIN)).Документ;
											Добав.НомерСтрокиСвязи=Добав.НомерСтроки;
											Добав.КодТНВЭД=Добав.GTIN.КодТНВЭД;
										КонецЕсли;
										ДД.НомерСтрокиСвязи=Добав.НомерСтрокиСвязи;
										Добав.КоличествоКМ=Добав.КоличествоКМ+1;
										Добав.СпособВыпускаТоваров="";
										
									КонецЦикла;;
									
									КоличествоНеобходмо=0;               
								Иначе
									НадоСпсать=Мин(КоличествоНеобходмо,99999);
									ДокумС=Документы.ВводВОборот_ХамелеонЦРПТ.СоздатьДокумент();
									ЗаполнитьЗначенияСвойств(ДокумС,ЭтотОбъект,,"Номер,Дата,_Order_ID,Статус");
									ДокумС.Дата=ТекущаяДата();
									Для Сч=Смещение По Смещение+НадоСпсать-1 Цикл
										GGG=РезультатЗапроса[Сч].НомерКМ;
										cis=Сред(СтрЗаменить(GGG,"%1D",""),1,38);
										Если Сред(cis,32,3)<>"240" Тогда
											//cis=Сред(cis,1,31);
											cis=Сред(GGG,1,Найти(GGG,"%1D")-1);
											cis=РаскодироватьСтроку(cis,СпособКодированияСтроки.КодировкаURL);
										КонецЕсли;

										ППП=РезультатЗапроса_М.НайтиСтроки(Новый Структура("СерийныйНомер",cis));
										Если ППП.Количество()=0 
											//И ППП.КоличествоОстаток<=0 
											Тогда
											Продолжить;
										КонецЕсли;
										Продукция=Неопределено;
										Для Каждого Стр_1П Из ППП Цикл
											Если ЗначениеЗаполнено(Стр_1П.Продукция) Тогда
												Продукция=Стр_1П.Продукция
											КонецЕсли;
											
											
										Конеццикла;
										
										
										ДД=ДокумС.СерийныеНомера.Добавить();
										Если ЗначениеЗаполнено(Продукция) Тогда
											ДД.НаименованиеТовара=Продукция
										Иначе
											Если Сред(cis,1,2)="01" тогда
											
												ДД.GTIN=Сред(cis,3,14);
											Иначе
												ДД.GTIN=Сред(cis,1,14);
												
											КонецЕсли;
											ДД.НаименованиеТовара=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",число(ДД.GTIN));;
										КонецЕсли;
										ДД.cis=cis;
										
										Добав=ДокумС.Товары.Найти(ДД.НаименованиеТовара,"GTIN");
										Если Добав=Неопределено Тогда
											Добав=ДокумС.Товары.Добавить();
											Добав.GTIN=ДД.НаименованиеТовара;
											Добав.ДекларацияИлиСертификатСоответствия=РЕгистрыСведений.ПодтверждающиеДокументы_ХамелеонЦРПТ.ПолучитьПоследнее(
													ТекущаяДата(),Новый Структура("Продукция",Добав.GTIN)).Документ;
											Добав.НомерСтрокиСвязи=Добав.НомерСтроки;
											Добав.КодТНВЭД=Добав.GTIN.КодТНВЭД;
										КонецЕсли;
										ДД.НомерСтрокиСвязи=Добав.НомерСтрокиСвязи;
										Добав.КоличествоКМ=Добав.КоличествоКМ+1;
										Добав.СпособВыпускаТоваров="";

									КонецЦикла;
									Смещение=Смещение+НадоСпсать;
									КоличествоНеобходмо=КоличествоНеобходмо-НадоСпсать;
									ДокумС.Записать();
									Сообщить("Создан документ "+Строка(ДокумС.Ссылка));
								КонецЕсли;
								
							КонецЦикла;
						Иначе
							
							Для Каждого Стр_1 Из Документоснование.КМИзAPI    Цикл
								Если ЗначениеЗаполнено(Стр_1.НомерКМ_Короткий) тогда
									cis=Стр_1.НомерКМ_Короткий
								Иначе
											GGG=Стр_1.НомерКМ;							
										cis=Сред(СтрЗаменить(GGG,"%1D",""),1,38);
										Если Сред(cis,32,3)<>"240" Тогда
											cis=Сред(GGG,1,Найти(GGG,"%1D")-1);
											cis=РаскодироватьСтроку(cis,СпособКодированияСтроки.КодировкаURL);
											
			//								cis=Сред(cis,1,31);
										КонецЕсли;
									КонецЕсли;
										ППП=РезультатЗапроса_М.НайтиСтроки(Новый Структура("СерийныйНомер",cis));
										Если (Документоснование.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Табак
											  ИЛИ Документоснование.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.АльтернативныйТабак)
					И Документоснование.ШаблонКМ_Табак=Перечисления.Шаблоны_подписи_кодов_КМ_Табак_ХамелеонЦРПТ.Блок Тогда
					                   //Документоснование.Товары[0].GTIN;
									   Для Каждого Стр_22 Из Документоснование.Товары Цикл
										   Если ЗначениеЗаполнено(Стр_22.GTIN) Тогда
										   	Продукция=Стр_22.GTIN;
										КонецЕсли;
										   
										Конеццикла;
									   
									   
									Иначе
										Если ППП=Неопределено ИЛИ (ППП.Количество()=0 
											//И ППП.КоличествоОстаток<=0
											) 
											Тогда
											Продолжить;
										КонецЕсли;
										Продукция=Неопределено;
										Для Каждого Стр_1П Из ППП Цикл
											Если ЗначениеЗаполнено(Стр_1П.Продукция) Тогда
												Продукция=Стр_1П.Продукция;
												Прервать;
											КонецЕсли;
											
											
										Конеццикла;
									КонецЕсли;
										
										
										ДД=ЭтотОБъект.СерийныеНомера.Добавить();
										Если ЗначениеЗаполнено(Продукция) Тогда
											ДД.НаименованиеТовара=Продукция
										Иначе
											Если Сред(cis,1,2)="01" тогда
											
												ДД.GTIN=Сред(cis,3,14);
											Иначе
												ДД.GTIN=Сред(cis,1,14);
												
											КонецЕсли;
											ДД.НаименованиеТовара=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",число(ДД.GTIN));;
										КонецЕсли;
										ДД.cis=cis;
									
										Добав=Товары.Найти(ДД.НаименованиеТовара,"GTIN");
										Если Добав=Неопределено Тогда
											Добав=Товары.Добавить();
											Добав.GTIN=ДД.НаименованиеТовара;
											Добав.ДекларацияИлиСертификатСоответствия=РЕгистрыСведений.ПодтверждающиеДокументы_ХамелеонЦРПТ.ПолучитьПоследнее(
													ТекущаяДата(),Новый Структура("Продукция",Добав.GTIN)).Документ;
											Добав.НомерСтрокиСвязи=Добав.НомерСтроки;
											Добав.КодТНВЭД=Добав.GTIN.КодТНВЭД;
										КонецЕсли;
										ДД.НомерСтрокиСвязи=Добав.НомерСтрокиСвязи;
										Добав.КоличествоКМ=Добав.КоличествоКМ+1;
										Добав.СпособВыпускаТоваров="";
										
									КонецЦикла;;
							   КонецЕсли;
									
					
					ИначеЕсли ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ВводВОборот_ХамелеонЦРПТ") Тогда
											
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	ОстаткиКМЭмитированые_ХамелеонЦРПТОстатки.СерийныйНомер КАК СерийныйНомер,
							|	СУММА(ОстаткиКМЭмитированые_ХамелеонЦРПТОстатки.КоличествоОстаток) КАК КоличествоОстаток,
							|	ОстаткиКМЭмитированые_ХамелеонЦРПТОстатки.Продукция КАК Продукция
							|ИЗ
							|	РегистрНакопления.ОстаткиКМЭмитированые_ХамелеонЦРПТ.Остатки(
							|			,
							|			Организация = &Организация
							|				И СерийныйНомер В
							|					(ВЫБРАТЬ
							|						ОстаткиКМЭмитированые_ХамелеонЦРПТ.СерийныйНомер
							|					ИЗ
							|						РегистрНакопления.ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ КАК ОстаткиКМЭмитированые_ХамелеонЦРПТ
							|					ГДЕ
							|						ОстаткиКМЭмитированые_ХамелеонЦРПТ.Регистратор = &Регистратор)) КАК ОстаткиКМЭмитированые_ХамелеонЦРПТОстатки
							|
							|СГРУППИРОВАТЬ ПО
							|	ОстаткиКМЭмитированые_ХамелеонЦРПТОстатки.СерийныйНомер,
							|	ОстаткиКМЭмитированые_ХамелеонЦРПТОстатки.Продукция
							|
							|ИТОГИ
							|	СУММА(КоличествоОстаток)
							|ПО
							|	СерийныйНомер,
							|	Продукция";
						
						Запрос.УстановитьПараметр("Организация", ДокументОснование.Организация);
						Если ЗначениеЗаполнено(ДДДД)  ТОгда
							Запрос.УстановитьПараметр("Регистратор", ДДДД);
						Иначе
							Запрос.УстановитьПараметр("Регистратор", ДокументОснование.Ссылка);
						КонецЕсли;
						
						РезультатЗапроса_М = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
						РезультатЗапроса_М.Индексы.Добавить("СерийныйНомер");
						
						
						
						
						//Если Документоснование.Статус<>Перечисления.СтатусыДокументов_ХамелеонЦРПТ.КМЭмитирован Тогда
						//	Сообщить("Документ заказа по маркам доолжен быть в статусе КМ эмитированы");
						//	Возврат;
						//КонецЕсли;
						ДокОснование=Документоснование;
						ЗаполнитьЗначенияСвойств(ЭтотОБъект,ДокОснование,,"Номер,Дата,_Order_ID,Статус");
						//++ МВ:Овчинников 11.06.2021  •0
						ЭтотОБъект.ДокОснование  = Документоснование;
						//-- МВ:Овчинников 11.06.2021
						//Если ДокОснование.СпособВыпускаТоваров=Перечисления.СпособВыпускаТоваров_ХамелеонЦРПТ.ВвезенВРФ Тогда
						//	ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВводВОборотИмпорт;
						//ИначеЕсли ДокОснование.СпособВыпускаТоваров=Перечисления.СпособВыпускаТоваров_ХамелеонЦРПТ.МаркировкаОстатков Тогда
						//	ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.МаркировкаОстатков;
						//ИначеЕсли ДокОснование.СпособВыпускаТоваров=Перечисления.СпособВыпускаТоваров_ХамелеонЦРПТ.ПроизведенВРФ Тогда
						ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВводВОборот;
						
						Для Каждого Стр_1_Д Из Документоснование.Товары Цикл
							Стр_1=Товары.Добавить();
							ЗаполнитьЗначенияСвойств(Стр_1,Стр_1_Д,,"order_ID,Статус,ОшибкаОтправки,СтатусСтроки");
							
							Если Не ЗначениеЗАполнено(стр_1.ДекларацияИлиСертификатСоответствия) тогда
								стр_1.ДекларацияИлиСертификатСоответствия=РЕгистрыСведений.ПодтверждающиеДокументы_ХамелеонЦРПТ.ПолучитьПоследнее(
								ТекущаяДата(),Новый Структура("Продукция",Стр_1.GTIN)).Документ;
							Конецесли;
							Если Не ЗначениеЗАполнено(стр_1.GTIN.КодТНВЭД) Тогда
								Стр_1.КодТНВЭД=стр_1.GTIN.КодТНВЭД;
							Конецесли;
							
							Если ЗначениеЗаполнено(Стр_1.ДатаПроизводства) тогда
								ДатаПроизводства=Стр_1.ДатаПроизводства
							Конецесли;
							
						Конеццикла;
						
						
						
						
						//КонецЕсли;
						Для Каждого Стр_1 Из Документоснование.СерийныеНомера    Цикл
							cis=Стр_1.cis;
							
							
							Если Найти(cis,"%1D")>0 Тогда 
								cis=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПолучитьКороткийНомерКМ_Сайт(cis,ТекущийПользователь.СайтыВходаВСистему.Наименование);
								
							Иначе
								//cis=РаскодироватьСтроку(cis,СпособКодированияСтроки.КодировкаURL);
								cis=СтрЗаменить(cis,Символ(29),"");
								
								
								
								Если ТекущийПользователь.СайтыВходаВСистему.Наименование="Молоко" Тогда
									
									Если Сред(cis,32,4)="7003" Тогда	
										cis=Сред(cis,1,45);
									ИначеЕсли Сред(cis,32,2)="17" Тогда	
										cis=Сред(cis,1,39);
									ИначеЕсли СтрДлина(cis)<=30 Тогда
										cis=Сред(cis,1,24);
									Иначе
										cis=Сред(cis,1,31);
									КонецЕсли;
									
									
								ИначеЕсли ТекущийПользователь.СайтыВходаВСистему.Наименование="Альтернативный табак"
									ИЛИ ТекущийПользователь.СайтыВходаВСистему.Наименование="Табак"
									Тогда
									Если Сред(cis,1,2)="01" Тогда
										Добав.СерийныйНомер=Сред(cis,1,25);
									Иначе
										Добав.СерийныйНомер=Сред(cis,1,21);
										
									КонецЕсли;
								ИначеЕсли ТекущийПользователь.СайтыВходаВСистему.Наименование="Фото" Тогда
									cis=Сред(cis,1,38);
								Иначе
									cis=Сред(cis,1,31);
								КонецЕсли;
								
							Конецесли;
							ППП=РезультатЗапроса_М.НайтиСтроки(Новый Структура("СерийныйНомер",cis));
							Если ППП=Неопределено ИЛИ (ППП.Количество()=0 
								//И ППП.КоличествоОстаток<=0
								) 
								Тогда
								Продолжить;
							КонецЕсли;
							Продукция=Неопределено;
							Для Каждого Стр_1П Из ППП Цикл
								Если ЗначениеЗаполнено(Стр_1П.Продукция) Тогда
									Продукция=Стр_1П.Продукция;
									Прервать;
								КонецЕсли;
								
								
							Конеццикла;
							//КонецЕсли;
							
							
							ДД=ЭтотОБъект.СерийныеНомера.Добавить();
							Если ЗначениеЗаполнено(Продукция) Тогда
								ДД.НаименованиеТовара=Продукция
							Иначе
								Если Сред(cis,1,2)="01" тогда
									
									ДД.GTIN=Сред(cis,3,14);
								Иначе
									ДД.GTIN=Сред(cis,1,14);
									
								КонецЕсли;
								ДД.НаименованиеТовара=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",число(ДД.GTIN));;
							КонецЕсли;
							ДД.cis=cis;
							
							//Добав=Товары.Найти(ДД.НаименованиеТовара,"GTIN");
							//Если Добав=Неопределено Тогда
							//	Добав=Товары.Добавить();
							//	
							//	Добав.GTIN=ДД.НаименованиеТовара;
							//	Добав.ДекларацияИлиСертификатСоответствия=РЕгистрыСведений.ПодтверждающиеДокументы_ХамелеонЦРПТ.ПолучитьПоследнее(
							//			ТекущаяДата(),Новый Структура("Продукция",Добав.GTIN)).Документ;
							//	Добав.НомерСтрокиСвязи=Добав.НомерСтроки;
							//	Добав.КодТНВЭД=Добав.GTIN.КодТНВЭД;
							//КонецЕсли;
							ДД.НомерСтрокиСвязи=Стр_1.НомерСтрокиСвязи;
							//Добав.КоличествоКМ=Добав.КоличествоКМ+1;
							//Добав.СпособВыпускаТоваров="";
							
							//		СтрокиДляДатаПроизводстваИНомераВСД=ДокументОснование.Товары.НайтиСтроки(Новый Структура("НомерСтрокиСвязи",
							//				Стр_1.НомерСтрокиСвязи));
							//				Если СтрокиДляДатаПроизводстваИНомераВСД.Количество()>0  Тогда
							//					Если ЗначениеЗаполнено(СтрокиДляДатаПроизводстваИНомераВСД[0].ДатаПроизводства) Тогда
							//						Добав.ДатаПроизводства=СтрокиДляДатаПроизводстваИНомераВСД[0].ДатаПроизводства;
							//					КонецЕсли;
							//	Добав.НомерВСД=СтрокиДляДатаПроизводстваИНомераВСД[0].НомерВСД;
							//				КонецЕсли;
							//
							
							
						КонецЦикла;;
						
						
						
					КонецЕсли;      
					
					
				КонецЕсли;
			КонецЕсли;
			
			
		
	 КонецПроцедуры

	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		// Вставить содержимое обработчика.
		Движения.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Записывать=Истина;
		Движения.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Очистить();
		
		Движения.ОстаткиКМЭмитированые_ХамелеонЦРПТ.Записывать=Истина;
		Движения.ОстаткиКМЭмитированые_ХамелеонЦРПТ.Очистить();
		
		Движения.ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ.Записывать=Истина;
		Движения.ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ.Очистить();
		
		Движения.ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ.Очистить();
		Если ЭтоТОбъект.Статус=перечисления.СтатусыДокументов_ХамелеонЦРПТ.Обработан Тогда
			
		//	Марки=СерийныеНомера.ВыгрузитьКолонку("cis");
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
			// Данный фрагмент построен конструктором.
			// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
			
			//Запрос = Новый Запрос;
			//Запрос.Текст = 
			//	"ВЫБРАТЬ
			//	|	УникальныеУпаковки_ХамелеонЦРПТ.УИТ,
			//	|	УникальныеУпаковки_ХамелеонЦРПТ.Ссылканаобъект
			//	|ИЗ
			//	|	РегистрСведений.УникальныеУпаковки_ХамелеонЦРПТ КАК УникальныеУпаковки_ХамелеонЦРПТ
			//	|ГДЕ
			//	|	УникальныеУпаковки_ХамелеонЦРПТ.УИТ В(&УИТ)
			//	|	И УникальныеУпаковки_ХамелеонЦРПТ.Ссылканаобъект <> &Ссылканаобъект";
			//
			//Запрос.УстановитьПараметр("Ссылканаобъект", ЭтотОБъект.Ссылка);
			//Запрос.УстановитьПараметр("УИТ", Марки);
			//
			//РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
			//РезультатЗапроса.Индексы.Добавить("УИТ");
			
			//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

		
			
			Для Каждого Стр Из ЭтотОбъект.СерийныеНомера Цикл
				
				Если ЭтотОбъект.ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВыводИзОборота
				//	ИЛИ ЭтотОбъект.ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВыводИзОБоротаДляСобственныхНужд
				//	ИЛИ ЭтотОбъект.ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВыводИзОБоротаДляСобственныхНуждПокупателем
					Тогда
				
						Добав=Движения.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Добавить();
				//Добав.ID_Строки=Стр.ID_строки_партии;
				Добав.ВидДвижения=ВидДвиженияНакопления.Расход;
				Добав.Количество=1;
				Добав.Организация=ЭтотОбъект.Организация;
				Добав.Период=Дата;
				Добав.Продукция=Стр.НаименованиеТовара;
				Если СтрДлина(Стр.cis)=29 Тогда
					Добав.СерийныйНомер=Сред(Стр.cis,1,21);
				Иначе
					Добав.СерийныйНомер=Стр.cis;
				КонецЕсли;
				
					
			ИначеЕсли Этотобъект.ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВводВОборотВозвратВРозницу 
				ИЛИ 
				Этотобъект.ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВыводИзОБоротаДляСобственныхНужд
				Тогда
				
						Добав=Движения.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Добавить();
				//Добав.ID_Строки=Стр.ID_строки_партии;
				Добав.ВидДвижения=ВидДвиженияНакопления.Приход;
				Добав.Количество=1;
				Добав.Организация=ЭтотОбъект.Организация;
				Добав.Период=Дата;
				Добав.Продукция=Стр.НаименованиеТовара;
				Если СтрДлина(Стр.cis)=29 Тогда
					Добав.СерийныйНомер=Сред(Стр.cis,1,21);
				Иначе
					Добав.СерийныйНомер=Стр.cis;
				КонецЕсли;
				
				
			Иначе
				Если ЭтотОбъект.ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ОтчетОбИспользовании 
					Тогда
						Добав=Движения.ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ.Добавить();
				Если            Найти(Стр.cis,"%1D")>0 Тогда
							cis=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПолучитьКороткийНомерКМ_Сайт(
							Стр.cis,ЭтотОбъект.ТекущийПользователь.СайтыВходаВСистему.Наименование);
					Иначе
						cis=Стр.cis;
					
						Если ЭтотОбъект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Молоко" Тогда
							//Добав.СерийныйНомер=Сред(cis,1,39);
								Если Сред(cis,32,4)="7003" Тогда	
								 	cis=Сред(cis,1,45);
								ИначеЕсли Сред(cis,32,2)="17" Тогда
								 	cis=Сред(cis,1,39);
								ИначеЕсли СтрДлина(cis)<=30 Тогда
									cis=Сред(cis,1,24);
								Иначе
								 	cis=Сред(cis,1,31);
									
									
								КонецЕсли;
							ИначеЕсли ЭтотОбъект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Альтернативный табак"
								ИЛИ ЭтотОбъект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Табак"
								Тогда
								Если Сред(cis,1,2)="01" Тогда
											cis=Сред(cis,1,25);
										Иначе
											cis=Сред(cis,1,21);
											
										КонецЕсли;
								ИначеЕсли ТекущийПользователь.СайтыВходаВСистему.Наименование="Фото" Тогда
										cis=Сред(cis,1,38);
						Иначе
							cis=Сред(cis,1,31);
							
						КонецЕсли;
					Конецесли;
					
											 	Добав.СерийныйНомер=Сред(cis,1,45);

				Иначе
					Добав=Движения.ОстаткиКМЭмитированые_ХамелеонЦРПТ.Добавить();
						
					Если СтрДлина(Стр.cis)=29 Тогда
						Добав.СерийныйНомер=Сред(Стр.cis,1,21);
					Иначе
						Добав.СерийныйНомер=Стр.cis;
					КонецЕсли;
							
				КонецЕсли;
					//Добав.ID_Строки=Стр.ID_строки_партии;
				
				
				Добав.ВидДвижения=ВидДвиженияНакопления.Расход;
				Добав.Количество=1;
				Добав.Организация=ЭтотОбъект.Организация;
				Добав.Период=Дата;
				Добав.Продукция=Стр.НаименованиеТовара;
				//Добав.СерийныйНомер=Стр.cis;
				
				
				
				Если ЭтотОбъект.ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ОтчетОбИспользовании Тогда
					
					Если ТекущийПользователь.СайтыВходаВСистему.Наименование="Табак" 
						ИЛИ ТекущийПользователь.СайтыВходаВСистему.Наименование="Альтернативный табак" ТОгда
						Добав=Движения.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Добавить();
					ИначеЕсли ТекущийПользователь.СайтыВходаВСистему.Наименование="Фармацевтика"  И ФармацевтикаПровестиКакВводВборот=Истина 
						Тогда
						Добав=Движения.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Добавить();
					Иначе
						
						Добав=Движения.ОстаткиКМЭмитированые_ХамелеонЦРПТ.Добавить();
					КонецЕсли;
					
					
					cis=Стр.cis;
					Добав.СерийныйНомер=cis; 
					Если Найти(cis,"%1D")>0 Тогда
						Добав.СерийныйНомер=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПолучитьКороткийНомерКМ_Сайт(cis,ЭтотОбъект.ТекущийПользователь.СайтыВходаВСистему.Наименование);
						
					Иначе
					
						//cis=РаскодироватьСтроку(cis,СпособКодированияСтроки.КодировкаURL);
						Если ЭтотОбъект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Молоко" Тогда
								Если Сред(cis,32,4)="7003" Тогда	
								 	Добав.СерийныйНомер=Сред(cis,1,45);
								ИначеЕсли Сред(cis,32,2)="17" Тогда
								 	Добав.СерийныйНомер=Сред(cis,1,39);
								ИначеЕсли СтрДлина(cis)<=30 Тогда
								 	Добав.СерийныйНомер=Сред(cis,1,24);
								Иначе
								 	Добав.СерийныйНомер=Сред(cis,1,31);
									
								КонецЕсли;
							ИначеЕсли ЭтотОбъект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Альтернативный табак" 
								ИЛИ ЭтотОбъект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Табак" 
								Тогда
								
								
								Если Сред(cis,1,2)="01" Тогда
											Добав.СерийныйНомер=Сред(cis,1,25);
										Иначе
											Добав.СерийныйНомер=Сред(cis,1,21);
											
										КонецЕсли;

											//Добав.СерийныйНомер=Сред(cis,1,25);
								ИначеЕсли ТекущийПользователь.СайтыВходаВСистему.Наименование="Фото" Тогда
										//cis=Сред(cis,1,38);
										Добав.СерийныйНомер=Сред(cis,1,38);
						 Иначе
							Добав.СерийныйНомер=Сред(cis,1,31);
						КонецЕслИ;
						
					Конецесли;
					Если ТекущийПользователь.СайтыВходаВСистему.Наименование="Фармацевтика"  И ФармацевтикаПровестиКакВводВборот=Истина 
							Тогда
						
							Если Сред(Добав.СерийныйНомер,1,2)="01" Тогда
								//Добав.СерийныйНомер=Стр.cis;
							Добав.СерийныйНомер=Сред(Добав.СерийныйНомер,3,14)+Сред(Добав.СерийныйНомер,19);

							
							КонецЕсли;
						КонецЕсли;
				 Иначе
					 
					Добав=Движения.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Добавить();
					Если СтрДлина(Стр.cis)=29 Тогда
						Добав.СерийныйНомер=Сред(Стр.cis,1,21);
					Иначе
						Добав.СерийныйНомер=Стр.cis;
					КонецЕсли;
					Если ТекущийПользователь.СайтыВходаВСистему.Наименование="Фармацевтика" Тогда
						Если Сред(Стр.cis,1,2)="01" Тогда
							//Добав.СерийныйНомер=Стр.cis;
						Добав.СерийныйНомер=Сред(Стр.cis,3,14)+Сред(Стр.cis,19);

						
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				//Добав.ID_Строки=Стр.ID_строки_партии;
				Добав.ВидДвижения=ВидДвиженияНакопления.Приход;
				Добав.Количество=1;
				Добав.Организация=ЭтотОбъект.Организация;
				Добав.Период=Дата;
				Добав.Продукция=Стр.НаименованиеТовара;
				
			КонецЕсли;
				//Если ЗначениеЗАполнено(Стр.НомерКороба)  Тогда
				//	НМарк=РезультатЗапроса.НайтиСтроки(
				//	Новый Структура("УИТ",Стр.cis));
				//	ПрерватьДанные=Ложь;
				//	Для Каждого Стр_Р Из НМарк Цикл
				//		Если ЗначениеЗаполнено(Стр_р.Ссылканаобъект) И Стр_р.Ссылканаобъект.дата>Ссылка.Дата 
				//			ИЛИ Стр_р.Ссылканаобъект=Ссылка
				//			Тогда
				//			ПрерватьДанные=Истина;
				//			Прервать;
				//		Иначе
				//			РегДв=РегистрыСведений.УникальныеУпаковки_ХамелеонЦРПТ.СоздатьНаборЗаписей();
				//			РегДв.Отбор.Марка.Установить(Стр.Марка);
				//			РегДв.Отбор.СправкаАБ.Установить(Стр.СправкаАБ.Ссылка);
				//		 	//РегДв.Удалить(Стр_Р);
				//			РегДв.Записать(Истина);
				//		КонецЕсли;
				//		Прервать;
				//		
				//	Конеццикла;
				//	
				//	
				//	
				//	
				//	РегДв=РегистрыСведений.УникальныеУпаковки_ХамелеонЦРПТ.СоздатьНаборЗаписей();
				//	
				//КонецЕсли;
				
			КонецЦикла;
		ИначеЕсли Статус=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.ФайлОбработанЧастично Тогда
			
			
			
			Для Каждого Стр Из ЭтотОбъект.СерийныеНомера Цикл
				
				Если Стр.Отправлена=ложь Тогда
					ПродолжитЬ;
				КонецЕсли;
				Если ЭтотОбъект.ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВыводИзОборота
				//	ИЛИ ЭтотОбъект.ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВыводИзОБоротаДляСобственныхНужд
				//	ИЛИ ЭтотОбъект.ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВыводИзОБоротаДляСобственныхНуждПокупателем
					Тогда
				      
						Добав=Движения.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Добавить();
				//Добав.ID_Строки=Стр.ID_строки_партии;
				Добав.ВидДвижения=ВидДвиженияНакопления.Расход;
				Добав.Количество=1;
				Добав.Организация=ЭтотОбъект.Организация;
				Добав.Период=Дата;
				Добав.Продукция=Стр.НаименованиеТовара;
				Если СтрДлина(Стр.cis)=29 Тогда
					Добав.СерийныйНомер=Сред(Стр.cis,1,21);
				Иначе
					Добав.СерийныйНомер=Стр.cis;
				КонецЕсли;
				
					
			ИначеЕсли Этотобъект.ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВводВОборотВозвратВРозницу 
				ИЛИ 
				Этотобъект.ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВыводИзОБоротаДляСобственныхНужд
				Тогда
				
						Добав=Движения.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Добавить();
				//Добав.ID_Строки=Стр.ID_строки_партии;
				Добав.ВидДвижения=ВидДвиженияНакопления.Приход;
				Добав.Количество=1;
				Добав.Организация=ЭтотОбъект.Организация;
				Добав.Период=Дата;
				Добав.Продукция=Стр.НаименованиеТовара;
				Если СтрДлина(Стр.cis)=29 Тогда
					Добав.СерийныйНомер=Сред(Стр.cis,1,21);
				Иначе
					Добав.СерийныйНомер=Стр.cis;
				КонецЕсли;
				
				
			Иначе
				Если ЭтотОбъект.ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ОтчетОбИспользовании 
					Тогда
						Добав=Движения.ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ.Добавить();
						
					cis=Стр.cis;	
					Если            Найти(Стр.cis,"%1D")>0 Тогда
						 cis=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПолучитьКороткийНомерКМ_Сайт(
						 Стр.cis,ЭтотОбъект.ТекущийПользователь.СайтыВходаВСистему.Наименование);
					Иначе
					
								Если ЭтотОбъект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Молоко" Тогда
									//Добав.СерийныйНомер=Сред(cis,1,39);
										Если Сред(cis,32,4)="7003" Тогда	
										 	Добав.СерийныйНомер=Сред(cis,1,45);
										ИначеЕсли Сред(cis,32,2)="17" Тогда
										 	Добав.СерийныйНомер=Сред(cis,1,39);
										ИначеЕсли СтрДлина(cis)<=30 Тогда
										 	Добав.СерийныйНомер=Сред(cis,1,24);
										Иначе
										 	Добав.СерийныйНомер=Сред(cis,1,31);
											
											
										КонецЕсли;
									ИначеЕсли ЭтотОбъект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Альтернативный табак"
										ИЛИ ЭтотОбъект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Табак"
										Тогда
										Если Сред(cis,1,2)="01" Тогда
													Добав.СерийныйНомер=Сред(cis,1,25);
												Иначе
													Добав.СерийныйНомер=Сред(cis,1,21);
													
												КонецЕсли;
								ИначеЕсли ТекущийПользователь.СайтыВходаВСистему.Наименование="Фото" Тогда
										//cis=Сред(cis,1,38);
										Добав.СерийныйНомер=Сред(cis,1,38);
								Иначе
									Добав.СерийныйНомер=Сред(cis,1,31);
									
								КонецЕсли;
					    Конецесли;
					
				Иначе
					Добав=Движения.ОстаткиКМЭмитированые_ХамелеонЦРПТ.Добавить();
						
					Если СтрДлина(Стр.cis)=29 Тогда
						Добав.СерийныйНомер=Сред(Стр.cis,1,21);
					Иначе
						Добав.СерийныйНомер=Стр.cis;
					КонецЕсли;
							
				КонецЕсли;
					//Добав.ID_Строки=Стр.ID_строки_партии;
				
				
				Добав.ВидДвижения=ВидДвиженияНакопления.Расход;
				Добав.Количество=1;
				Добав.Организация=ЭтотОбъект.Организация;
				Добав.Период=Дата;
				Добав.Продукция=Стр.НаименованиеТовара;
				//Добав.СерийныйНомер=Стр.cis;
				
				
				
				Если ЭтотОбъект.ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ОтчетОбИспользовании Тогда
					
					Если ТекущийПользователь.СайтыВходаВСистему.Наименование="Табак" 
						ИЛИ ТекущийПользователь.СайтыВходаВСистему.Наименование="Альтернативный табак" ТОгда
						Добав=Движения.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Добавить();
					Иначе
						Добав=Движения.ОстаткиКМЭмитированые_ХамелеонЦРПТ.Добавить();
					КонецЕсли;
					cis=Стр.cis;
					Если Найти(cis,"%1D")>0 Тогда
						
						cis=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПолучитьКороткийНомерКМ_Сайт(cis,ЭтотОбъект.ТекущийПользователь.СайтыВходаВСистему.Наименование);
	//					cis=СтрЗаменить(Стр.cis,"%1D","");;
	//					cis=РаскодироватьСтроку(cis,СпособКодированияСтроки.КодировкаURL);
					Иначе
							Если ЭтотОбъект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Молоко" Тогда
									Если Сред(cis,32,4)="7003" Тогда	
									 	cis=Сред(cis,1,45);
									ИначеЕсли Сред(cis,32,2)="17" Тогда
									 	cis=Сред(cis,1,39);
									ИначеЕсли СтрДлина(cis)<=30 Тогда
									 	Добав.СерийныйНомер=Сред(cis,1,24);
									Иначе
									 	cis=Сред(cis,1,31);
										
									КонецЕсли;
								ИначеЕсли ЭтотОбъект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Альтернативный табак" 
									ИЛИ ЭтотОбъект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Табак" 
									Тогда
									
									
									Если Сред(cis,1,2)="01" Тогда
												cis=Сред(cis,1,25);
											Иначе
												cis=Сред(cis,1,21);
												
											КонецЕсли;

												//Добав.СерийныйНомер=Сред(cis,1,25);
								ИначеЕсли ТекущийПользователь.СайтыВходаВСистему.Наименование="Фото" Тогда
										//cis=Сред(cis,1,38);
										cis=Сред(cis,1,38);
							Иначе
								cis=Сред(cis,1,31);
							КонецЕслИ;
					Конецесли;
						Добав.СерийныйНомер=cis;
				Иначе
					Добав=Движения.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Добавить();
					Если СтрДлина(Стр.cis)=29 Тогда
						Добав.СерийныйНомер=Сред(Стр.cis,1,21);
					Иначе
						Добав.СерийныйНомер=Стр.cis;
					КонецЕсли;
					Если ТекущийПользователь.СайтыВходаВСистему.Наименование="Фармацевтика" Тогда
						Если Сред(Стр.cis,1,2)="01" Тогда
							//Добав.СерийныйНомер=Стр.cis;
						Добав.СерийныйНомер=Сред(Стр.cis,3,14)+Сред(Стр.cis,19);

						
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				//Добав.ID_Строки=Стр.ID_строки_партии;
				Добав.ВидДвижения=ВидДвиженияНакопления.Приход;
				Добав.Количество=1;
				Добав.Организация=ЭтотОбъект.Организация;
				Добав.Период=Дата;
				Добав.Продукция=Стр.НаименованиеТовара;
				
			КонецЕсли;
				//Если ЗначениеЗАполнено(Стр.НомерКороба)  Тогда
				//	НМарк=РезультатЗапроса.НайтиСтроки(
				//	Новый Структура("УИТ",Стр.cis));
				//	ПрерватьДанные=Ложь;
				//	Для Каждого Стр_Р Из НМарк Цикл
				//		Если ЗначениеЗаполнено(Стр_р.Ссылканаобъект) И Стр_р.Ссылканаобъект.дата>Ссылка.Дата 
				//			ИЛИ Стр_р.Ссылканаобъект=Ссылка
				//			Тогда
				//			ПрерватьДанные=Истина;
				//			Прервать;
				//		Иначе
				//			РегДв=РегистрыСведений.УникальныеУпаковки_ХамелеонЦРПТ.СоздатьНаборЗаписей();
				//			РегДв.Отбор.Марка.Установить(Стр.Марка);
				//			РегДв.Отбор.СправкаАБ.Установить(Стр.СправкаАБ.Ссылка);
				//		 	//РегДв.Удалить(Стр_Р);
				//			РегДв.Записать(Истина);
				//		КонецЕсли;
				//		Прервать;
				//		
				//	Конеццикла;
				//	
				//	
				//	
				//	
				//	РегДв=РегистрыСведений.УникальныеУпаковки_ХамелеонЦРПТ.СоздатьНаборЗаписей();
				//	
				//КонецЕсли;
				
			КонецЦикла;

			
		Конецесли;	
	КонецПроцедуры


	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		// Вставить содержимое обработчика.
		
		Если не ЗначениеЗаполнено(Ссылка) тогда
			ЭтотОБъект.ПродолжитьВводВОборот=ТекущийПользователь.СоздаватьИОтправлятьВводВОборотПослеЭмитирования;
		 	ЭтотОБъект.СоздатьАгрегацию=РегистрыСведений.НастройкиПрограммы_ХамелеонЦРПТ.Получить().ДелатьАгрегациюПослеОбработкиОтчетаОбИспользования;
		Конецесли;
		
		Если ЭтотОбъект.ТипДокумента<>Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ОтчетОбИспользовании Тогда
			Для каждого Стр_1 Из ЭтотОБъект.СерийныеНомера Цикл
				Если ТекущийПользователь.СайтыВходаВСистему.Наименование="Фото" Тогда
					Стр_1.cis=Сред(Стр_1.cis,1,38)
				ИначеЕсли СтрДлина(Стр_1.cis)=38 И Сред(Стр_1.cis,32,3)<>"240" Тогда
					Стр_1.cis=Сред(Стр_1.cis,1,31)
				КонецЕсли;
			Конеццикла;
		Конецесли;
		СуммаДокумента=0;
		Если Товары.Количество()=0 Тогда
			СтатусМеняем=Статус;
		Иначе
			СтатусМеняем=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.Обработан
		КонецЕсли;
		Для Каждого Стр ИЗ Товары Цикл
			СуммаДокумента=СуммаДокумента+Стр.Цена*Стр.КоличествоКМ;
			Если СтатусМеняем=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.Обработан
				ИЛИ СтатусМеняем=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.ПодготовленКОтправке 
				ИЛИ Не ЗначениеЗаполнено(СтатусМеняем) Тогда
				Если Стр.Статус=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.Отказ тогда
					СтатусМеняем=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.Отказ;
				ИначеЕсли Стр.Статус=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.ВПроцессе Тогда
					СтатусМеняем=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.ВПроцессе;
				ИначеЕсли Стр.Статус=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.ОжидаетОтвета Тогда
					СтатусМеняем=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.ОжидаетОтвета;
				ИначеЕсли Стр.Статус<>Перечисления.СтатусыДокументов_ХамелеонЦРПТ.Обработан Тогда
					СтатусМеняем=Статус;
				КонецЕсли;
			КонецЕсли;
		Конеццикла;
		Статус=СтатусМеняем;
		ЭтотОбъект.КоличествоКМ=СерийныеНомера.Количество();
		ЭтотОбъект.КоличествоНомеровКМ=Товары.Итог("КоличествоНомеровКМ");
	КонецПроцедуры



	Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		// Вставить содержимое обработчика.
		
		Если ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВводВОборотИмпорт
			Тогда
			     ПроверяемыеРеквизиты.Добавить("КодТаможенногоОргана");
			     ПроверяемыеРеквизиты.Добавить("КодПринятогоРешения");
			     ПроверяемыеРеквизиты.Добавить("ДатаДекларацииТовара");
			     ПроверяемыеРеквизиты.Добавить("НомерДекларацииТовара");
			 ИначеЕсли ТипДОкумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ОтчетОбИспользовании 
				 //ИЛИ ТипДОкумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.МаркировкаОстатков 
				 //ИЛИ ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВыводИзОборота
				 //ИЛИ ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВыводИзОБоротаДляСобственныхНужд
				 //ИЛИ ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВыводИзОБоротаДляСобственныхНуждПокупателем
				 Тогда
				 
				    Если ТекущийПользователь.СайтыВходаВСистему.Наименование="Молоко" Тогда
					     ПроверяемыеРеквизиты.Добавить("Товары.ГоденДо");
					Конецесли;;
			

				//	     ПроверяемыеРеквизиты.Добавить("Товары.ДекларацияИлиСертификатСоответствия");

		КонецЕсли;
		
КонецПроцедуры


	Процедура ПриЗаписи(Отказ)
		// Вставить содержимое обработчика.
		Попытка
			Если ЗначениеЗаполнено(ЭтотОбъект.ДокОснование) И Не ЗначениеЗаполнено(ЭтотОбъект.ДокОснование.ВводВоборот) ТОгда
				ДокП=ЭтотОбъект.ДокОснование.ПолучитьОбъект();
				ДокП.ВводВоборот=Ссылка;
				ДокП.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		Исключение
		КонецПопытки;
		//++ МВ:Овчинников 11.06.2021  •0
		
		//-- МВ:Овчинников 11.06.2021
	КонецПроцедуры

