
&НаСервере
Процедура СоздатьАгрегацииНаСервере()
	// Вставить содержимое обработчика.
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	
	СписокИсключить=Новый СписокЗначений;
	Для Каждого Стр_1 Из Агрегации Цикл
		Для Каждого Стр_2 Из Стр_1.Агрегация.Марки Цикл
			
			СписокИсключить.Добавить(Стр_2.Марка);
		Конеццикла;
		
	Конеццикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ОстаткиКМ_в_Обороте_ХамелеонЦРПТОстатки.КоличествоОстаток) КАК КоличествоОстаток,
		|	ОстаткиКМ_в_Обороте_ХамелеонЦРПТОстатки.СерийныйНомер КАК СерийныйНомер
		|ИЗ
		|	РегистрНакопления.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Остатки(
		|			,
		|			Организация = &Организация
		|				И Продукция = &Продукция
		|				И НЕ СерийныйНомер В (&Номенклатура)) КАК ОстаткиКМ_в_Обороте_ХамелеонЦРПТОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиКМ_в_Обороте_ХамелеонЦРПТОстатки.СерийныйНомер
		|ИТОГИ
		|	СУММА(КоличествоОстаток)
		|ПО
		|	СерийныйНомер";
	
	Запрос.УстановитьПараметр("Организация", ТекущийПользователь.Организация);
	Запрос.УстановитьПараметр("Продукция", Продукция);
	Запрос.УстановитьПараметр("Номенклатура",СписокИсключить);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСерийныйНомер = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Сч_КоличествоАгрегаций=КоличествоАгрегаций;
	
	КоличествоВоВл=КоличествоВАгрегации;
	
	Если КоличествоВоВл=0 Тогда
		КоличествоВоВл=1;
	КонецЕсли;
	Докум=Документы.СозданиеНовогоШкНаКороба_ХамелеонЦРПТ.СоздатьДокумент();
	Докум.Организация=ТекущийПользователь.Организация;
	Докум.ТекущийПользователь=ТекущийПользователь;
	Докум.ТипДокумента=Перечисления.ВидДокументаУпаковок_ХамелеонЦРПТ.Формирование;
	Докум.СтатусКМ=Перечисления.СтатусыКМДляАгрегации_ХамелеонЦРПТ.КМВОбороте;
	
	Докум.Дата=ТекущаяДата();
	Пока ВыборкаСерийныйНомер.Следующий() Цикл
		// Вставить обработку выборки ВыборкаСерийныйНомер
		
		Если КоличествоВоВл=0 Тогда
			КоличествоВоВл=КоличествоВАгрегации;
	
			Если КоличествоВоВл=0 Тогда
				КоличествоВоВл=1;
			КонецЕсли;
	        Докум.Записать();
			ДД=Агрегации.Добавить();
			ДД.Агрегация=Докум.Ссылка;
			
			Сообщить("Создан документ "+Строка(Докум.Ссылка));
			
			Сч_КоличествоАгрегаций=Сч_КоличествоАгрегаций-1;
			Если Сч_КоличествоАгрегаций=0 ТОгда
				Прервать;
			КонецЕсли;
			
			
			Докум=Документы.СозданиеНовогоШкНаКороба_ХамелеонЦРПТ.СоздатьДокумент();
			Докум.Организация=ТекущийПользователь.Организация;
			Докум.ТекущийПользователь=ТекущийПользователь;
			Докум.ТипДокумента=Перечисления.ВидДокументаУпаковок_ХамелеонЦРПТ.Формирование;
			Докум.СтатусКМ=Перечисления.СтатусыКМДляАгрегации_ХамелеонЦРПТ.КМВОбороте;
			
			Докум.Дата=ТекущаяДата();
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Докум.НомерКороба) Тогда
			Докум.Номенклатура=Продукция;
			Докум.Продукция=Продукция;
			ыыы="";
			Обработки._Запуск_ХамелеонЦРПТ.СформироватьСлучайныйКоробСервер(Докум,ыыы);
		КонецЕсли;
		
		Если ВыборкаСерийныйНомер.Количество()>0 Тогда
			Если СтрДлина(ВыборкаСерийныйНомер.СерийныйНомер)=18 Тогда
				Продолжить;
			КонецЕслИ;
			Добав=Докум.Марки.Добавить();
			Добав.Марка=ВыборкаСерийныйНомер.СерийныйНомер;
		
		//Докум.Записать(РежимЗаписиДокумента.Запись);
		
			КоличествоВоВл=КоличествоВоВл-1;
		
		КонецЕсли;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьАгрегации(Команда)
	СоздатьАгрегацииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	Форм=ПолучитьФорму("Обработка._Запуск_ХамелеонЦРПТ.Форма.Форма");
	Если НЕ Форм.Открыта() Тогда
		Форм.Открыть();
	КонецЕсли;
	ТекущийПользователь=Форм.Пользователь;
КонецПроцедуры

Функция Орг()
	Возврат ТекущийПользователь.Организация
КонецФункции

&НаКлиенте
Процедура ПродукцияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка=Ложь;
	ОткрытьФорму("Справочник.Продукция_ХамелеонЦРПТ.Форма.ФормаВыбораКМ",Новый Структура("Организация",Орг()),Элемент,,,,Новый ОписаниеОповещения("ПослеВыбораПродукции",ЭтаФорма));
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПродукции(РР,ДД) Экспорт
	Если ЗначениеЗаполнено(РР) Тогда
		Продукция=РР;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СоздатьИОТправитьВЦРПТАгрегации(Команда)
	СоздатьАгрегацииНаСервере();
		
	ОтправитьАгрегации(Команда);
КонецПроцедуры


&НаКлиенте
Процедура ОтправитьАгрегации(Команда)
	Для Каждого Стр_1 Из Агрегации Цикл
		Если ЗначениеЗАполненО(Стр_1.Агрегация) Тогда
			Форм=ПолучитьФорму("Документ.СозданиеНовогоШкНаКороба_ХамелеонЦРПТ.Форма.ФормаДокумента",
			Новый Структура("Ключ",Стр_1.Агрегация));
			Форм.ОтправитьВЦРПТ("");
		КонецЕсли;
		
	Конеццикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтветы(Команда)
	// Вставить содержимое обработчика.
	// Вставить содержимое обработчика.
	Обр=ОткрытьФорму("Обработка._Запуск_ХамелеонЦРПТ.Форма.Форма");
	Для Каждого Стр_11 Из Агрегации Цикл
		Обр.ОбновитьСтатусыДокументов(Команда,,,Стр_11.Агрегация);
		оповестить(Стр_11.Агрегация);
	Конеццикла;
	Попытка
		ЭтаФорма.ВладелецФормы.Активизировать();
	исключение
	КонецПопытки;
	ЭтаФорма.Активизировать();
	Элементы.Агрегации.Обновить();;
	
	
КонецПроцедуры



