// Возвращает данные о транспортной операции по номеру и виду ТТН.
//
// Параметры:
//	НомерТТН - Строка(12) - Номер ТТН
//	ВидТТН - Перечисление.ФТО_ВидыТТН - Вид ТТН.
//
// Возвращаемое значение:
//  Массив - массив, содержащий транспортные операции.
//
Функция ВводВОборотПоДаннымФайла(СтукрутаОтбора, МассивИсключений) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МВ_СоотвествиеФайловВводуВОборот.ВводВОборот КАК ВводВОборот
		|ИЗ
		|	РегистрСведений.МВ_СоотвествиеФайловВводуВОборот КАК МВ_СоотвествиеФайловВводуВОборот
		|ГДЕ
		|	МВ_СоотвествиеФайловВводуВОборот.GTIN = &GTIN
		|	И МВ_СоотвествиеФайловВводуВОборот.НомерПартии = &НомерПартии
		|	И МВ_СоотвествиеФайловВводуВОборот.ДатаПроизводства = &ДатаПроизводства
		|	И НЕ МВ_СоотвествиеФайловВводуВОборот.ВводВОборот В (&МассивИсключений)";
	
	Запрос.УстановитьПараметр("МассивИсключений", МассивИсключений);
	Запрос.УстановитьПараметр("GTIN", СтукрутаОтбора.GTIN);
		Запрос.УстановитьПараметр("НомерПартии", СтукрутаОтбора.НомерПартии);
	Запрос.УстановитьПараметр("ДатаПроизводства", СтукрутаОтбора.ДатаПроизводства);

	РезультатЗапроса = Запрос.Выполнить();	
	ПроизводственныеОперации = РезультатЗапроса.Выгрузить();  
	
	Возврат ПроизводственныеОперации.ВыгрузитьКолонку("ПроизводственныеОперации");;
	
КонецФункции
