
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.GTIN = ""
			ИЛИ Запись.НомерПартии = ""
			ИЛИ Запись.ДатаПроизводства = "" Тогда
			Продолжить;	
		КонецЕсли; 
		
		МассивИсключений = Новый Массив;
		МассивИсключений.Добавить(Запись.ВводВОборот);

		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("GTIN",Запись.GTIN );
		СтруктураДанных.Вставить("НомерПартии",Запись.НомерПартии );
		СтруктураДанных.Вставить("ДатаПроизводства",Запись.ДатаПроизводства );

		
		ВводВОборот = РегистрыСведений.МВ_СоотвествиеФайловВводуВОборот.ВводВОборотПоДаннымФайла(СтруктураДанных, МассивИсключений);
		
		Если ВводВОборот.Количество() Тогда

			ЕстьПроведенный = Ложь;
			Для Каждого ТО из ВводВОборот Цикл
				Если ТО.Проведен Тогда
					ЕстьПроведенный = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю( СтрШаблон(нСтр("ru='Для GTIN: 1% НомерПартии: 2% ДатаВыработки от 3% существует ввод в оборот 4%'", "ru"), Запись.GTIN,Запись.НомерПартии,Запись.ДатаПроизводства,ВводВОборот[0])) ;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры
