

&НаКлиенте
Процедура КаталогЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выбирите путь создания файлов ОКТО";
	Диалог.ПолноеИмяФайла = "";
	
	Если Диалог.Выбрать() Тогда
		КаталогЗагрузки = Диалог.Каталог;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(КаталогЗагрузки) Тогда
		Возврат;
	КонецЕсли;
	
	Состояние(НСтр("ru='Открывается файл:'") + " " + ИмяФайла);

	

	ПолучитьФайлНаСервере();
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ПолучитьФайлНаСервере()

	
КонецПроцедуры // ПолучитьФайлНаСервере()
