&НаКлиенте
Процедура ПолучитьНаименованиеПоИНН(Команда)
	// Вставить содержимое обработчика.
	Масс1=ПолучиьМассивИНН();
	//Новый Массив;
	//Масс1.Добавить(Объект.ИНН);
	ОткрытьФорму("Справочник.ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ.Форма.ФормаКапчаУФ",Новый Структура("МассивКлиентов",Масс1),,,,,Новый ОписаниеОповещения("ВыбратьДвоичн",ЭтаФорма));
	
КонецПроцедуры

Функция ПолучиьМассивИНН()
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ.ИНН КАК Ссылка
		|ИЗ
		|	Справочник.ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ КАК ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ
		|ГДЕ
		|	ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ.ИНН = ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Массив=Новый Массив;
 	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка) тогда
			Массив.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	Возврат   Массив
КонецФункции

Процедура	ЗаполнитьИнфуНаСервере(ВыбранноеЗначение_1)
	Для Каждого ВыбранноеЗначение_2 ИЗ ВыбранноеЗначение_1 Цикл
		
				//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ.Ссылка
		|ИЗ
		|	Справочник.ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ КАК ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ
		|ГДЕ
		|	ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ.ИНН = &ИНН";
	
	Запрос.УстановитьПараметр("ИНН", ВыбранноеЗначение_2.Значение.ИНН);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка) тогда
			Продолжить;
		КонецЕсли;
		Объект=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ВыбранноеЗначение=ВыбранноеЗначение_2.Значение.Дв;
			Если ВыбранноеЗначение.Свойство("n",Объект.НаименованиеПолное) Тогда
			
			
				ВыбранноеЗначение.Свойство("n",Объект.Наименование);
				Если СтрДлина(СокрЛП(Объект.ИНН))=12 Тогда
					Объект.Наименование="ИП "+Объект.Наименование;
					
					Объект.НаименованиеПолное="ИП "+Объект.НаименованиеПолное;
				КонецЕсли;
			КонецЕсли;
			//Заполним адреса
			
			ВыбранноеЗначение.Свойство("a",Объект.ЮридическийАдрес);
			Объект.Записать();
		КонецЦикла;
		Конеццикла;
			//ВыбранноеЗначение.Свойство("o",Объект.ОГРН);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДвоичн(ВыбранноеЗначение_1, ИсточникВыбора) Экспорт
 	// Вставить содержимое обработчика.
	Если ЗначениеЗаполнено(ВыбранноеЗначение_1) Тогда
		Если ВыбранноеЗначение_1.Количество()=0 Тогда
			Возврат;
		КонецЕсли;
		
			
			ЗаполнитьИнфуНаСервере(ВыбранноеЗначение_1);
		//Объект.ИНН						= ВыбранноеЗначение.i;
	
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры
