Функция ВернутьСписокПользователей()  Экспорт
	
	//МассивПользователей=Новый Массив;
	
	//Если    СокрЛП(ПараметрыСеанса.ТекущийПользователь.Код)="Федоров (администратор)" Тогда
		//МассивПользователей.Добавить(Справочники.Пользователи_ХамелеонЦРПТ.НайтиПоНаименованию("__1"));
	//	
	//ИначеЕсли    СокрЛП(ПараметрыСеанса.ТекущийПользователь.Код)="Иванов" Тогда
	//	МассивПользователей.Добавить(Справочники.Пользователи_ХамелеонЦРПТ.НайтиПоНаименованию("___2"));
	//	
	//КонецЕсли;
	//Возврат МассивПользователей;
	//
	//
	//
	//
	//	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	//// Данный фрагмент построен конструктором.
	//// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Пользователи_ХамелеонЦРПТ.Ссылка
	//	|ИЗ
	//	|	Справочник.Пользователи_ХамелеонЦРПТ КАК Пользователи_ХамелеонЦРПТ";
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//МассивП=Новый Массив;
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//	МассивП.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	//КонецЦикла;
	//
	////}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	//Возврат МассивП;	
	//
	
	
	//не комментарить!!!
	Возврат Неопределено;
	//не комментарить!!!

	
КонецФункции