
&НаКлиенте
Процедура Команда1(Команда)
	// Вставить содержимое обработчика.
	//Декларация=СоздатьДекларацию();
	
	МассивПродукций=Новый Массив;
	Для Каждого Стр_1 Из ЭтаФорма.ВладелецФормы.Элементы.Товары.ВыделенныеСтроки Цикл
		Стр=ЭтаФорма.ВладелецФормы.Объект.Товары.НайтиПоИдентификатору(Стр_1);
		Стр.КодТНВЭД=ДекларацияИлиСертификат;
		Если МассивПродукций.Найти(Стр.GTIN)=Неопределено Тогда
			МассивПродукций.Добавить(Стр.GTIN);
		КонецЕсли;
		//ЗагрузитьДекларацииВВСД(Стр);
		//Стр.ДекларацияИлиСертификатСоответствия=Декларация;
	Конеццикла;
	
	ЗаписатьКодТНВЭДВМассив(МассивПродукций);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

Процедура ЗаписатьКодТНВЭДВМассив(МассивПродукций)
	Для Каждого Стр_1 Из МассивПродукций Цикл
		ПолОб=Стр_1.ПолучитьОбъект();
		ПолОб.КодТНВЭД=ДекларацияИлиСертификат;
		ПолОб.Записать(); 
	Конеццикла;
КонецПроцедуры

