
&НаКлиенте
Процедура ИмяВнешнейОБработкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Режим=РежимДиалогаВыбораФайла.Открытие;
	нДиалог= НОвый ДиалогВыбораФайла(Режим);
	Фильтр="Файл epf (*.epf)|*.epf";
	нДиалог.Фильтр=Фильтр;
	нДиалог.Заголовок="Выберите файл внешней обарботки..." ;
	
	нДиалог.Показать(Новый ОписаниеОповещения("ВыборФайла",ЭтаФорма));
	СтандартнаяОбработка=Ложь;	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайла(ВыборЗагрExcel,РР)        Экспорт 
	Если ВыборЗагрExcel<>Неопределено Тогда
		Объект.ИмяВнешнейОБработки=ВыборЗагрExcel[0];
		ДовичНданные=Новый ДвоичныеДанные(Объект.ИмяВнешнейОБработки);
		АдресХранилища=ПоместитьВоВременноеХранилище(ДовичНданные);
		СохранитьВХранилище(АдресХранилища);
		ЭтаФорма.Прочитать();
		
	КонецЕсли;
КонецПроцедуры
Процедура СохранитьВХранилище(АдресХранилища)
	ЭтаФорма.Записать();
	ОО=Объект.Ссылка.ПолучитьОбъект();
	ОО.Хранилище=Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресХранилища));
	ОО.Записать();
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Если Не ЗначениеЗАполнено(Объект.Ссылка) И НЕ Параметры.Свойство("Тип",Объект.Наименование) Тогда
		Отказ=Истина;
	Конецесли;
	
КонецПроцедуры
