// ФТО:ALNA 07.08.2019 30701

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Запись, Параметры.ЗначенияЗаполнения);	
	Элементы.Значение.ОграничениеТипа = Запись.Настройка.ТипЗначения;
	Запись.Значение = Элементы.Значение.ОграничениеТипа.ПривестиЗначение(Запись.Значение);
	
	Заголовок = "" + Запись.Настройка + ?(ЗначениеЗаполнено(Запись.Организация), " (" + Запись.Организация + ")", " (общая)"); 
	
	//++ ФТО:ALNA 15.08.2019 31209
	ДиалогВыбораФайла = "";
	ПВХ = ПланыВидовХарактеристик.МВ_ПереченьДополнительныхНастроек;
		
	Если Запись.Настройка = ПВХ.КаталогЧтенияВСД Тогда	
		//-- ФТО:SOAL 12.03.2020 
		Элементы.Значение.КнопкаВыбора = Истина;
		ДиалогВыбораФайла = "КАТАЛОГ";
	//++ ФТО:ALNA 23.08.2019 31369
	ИначеЕсли Запись.Настройка = "КаталогОбмена" Тогда
			Элементы.Значение.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
	//-- ФТО:ALNA 23.08.2019	
	//++ ФТО:SOAL 03.10.2019 32239
	ИначеЕсли РегистрыСведений.МВ_ДополнительныеНастройки.ВключатьРежимПароляДляНастройки(Запись.Настройка) Тогда
		Элементы.Значение.РежимПароля = Истина;
	//-- ФТО:SOAL 03.10.2019 	
	//++ ФТО:KOLT 14.10.2019 32652
	ИначеЕсли Запись.Настройка = "ПВХ.СкладОбеспеченияДляТранзита" Тогда
		Элементы.Значение.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
	//-- ФТО:KOLT 14.10.2019
	//++ ФТО:ALNA 16.10.2019 30701
	ИначеЕсли Запись.Настройка = "ПВХ.ОсновнойПоставщик" Тогда
		ПараметрыВыбора = Новый Массив;
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Поставщик", Истина));
		НовыеПараметры = Новый ФиксированныйМассив(ПараметрыВыбора);
		Элементы.Значение.ПараметрыВыбора = НовыеПараметры;
	//-- ФТО:ALNA 16.10.2019
	КонецЕсли;	
	//-- ФТО:ALNA 15.08.2019
		
КонецПроцедуры
	
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("МВ_ДополнительныеНастройки.ИзменениеНастроек");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ ФТО:ALNA 15.08.2019 31209
&НаКлиенте
Процедура ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ДиалогВыбораФайла = "КАТАЛОГ" Тогда	
		СтандартнаяОбработка = Ложь;
		
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		Диалог.Каталог = Запись.Значение;
		ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(Новый ОписаниеОповещения("ДиалогВыбораФайлаЗавершение", ЭтаФорма), Диалог);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДиалогВыбораФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		Запись.Значение = ВыбранныеФайлы[0] + "\";
	КонецЕсли;
	
КонецПроцедуры
//-- ФТО:ALNA 15.08.2019

#КонецОбласти
