
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ДЖСОН=Неопределено;
	ТаблицаЭДО.Очистить();
	Если Параметры.Свойство("ДЖСОН",ДЖСОН) Тогда
		Для Каждого Стр Из ДЖСОН.identifierInfos Цикл
			Добав=таблицаЭДО.Добавить();
			Добав.ТипЭДО=Справочники.ЭДО_ХамелеонЦРПТ.НайтиПоРеквизиту("ИдентификаторОператораЭДО",
			Сред(Стр.id,1,3));
			Добав.КодЭДО=Сред(Стр.id,1,3);
			Добав.Идентификатор=Стр.id;
			
			
		Конеццикла;
	Иначе
		Отказ=Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЭДОВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Этаформа.Закрыть(Элементы.ТаблицаЭДО.ТекущиеДанные.Идентификатор);
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
Если 	Элементы.ТаблицаЭДО.ТекущиеДанные.Идентификатор<>Неопределено Тогда
		Этаформа.Закрыть(Элементы.ТаблицаЭДО.ТекущиеДанные.Идентификатор);
	КонецЕсли;

КонецПроцедуры
