
&НаКлиенте
Процедура РегистрационныйНомерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Форм=ОткрытьФорму("Справочник.Договора_ХамелеонЦРПТ.Форма.ФормаВыбораАдресов",Новый Структура("Контрагент",Объект.Владелец),,,,,Новый ОписаниеОповещения("ПослеВыбора",ЭтаФорма));
	//Форм.Контрагент=Объект.Владелец;
	
	
КонецПроцедуры

&наКлиенте
Процедура ПослеВыбора(РР,ДД) Экспорт
	Если ЗначениеЗаполнено(РР) тогда
		ЗаполнитьЗначенияСвойств(Объект,РР);
	КонецЕсли;
	ЭтаФорма.Активизировать();
КонецПроцедуры