
&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Если Не Закрыть Тогда
		Отказ=Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	ПодключитьОбработчикОжидания("ОбработкаГлобальногоЗадания_ХамелеонЦРПТ",300,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	// Вставить содержимое обработчика.
	ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопроса",ЭтаФорма),"После закрытия этой обработки перестанут выполняться регламентые задания",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопроса(Д,А) Экспорт
	Если Д=КодВозвратаДиалога.Да Тогда
		Закрыть=Истина;
		ЭтаФорма.Закрыть();
	КонецЕслИ;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
		НеПисатьВЖурналРегламентныеЗадания=РегистрыСведений.НастройкиПрограммы_ХамелеонЦРПТ.Получить().НеПисатьВЖурналРегламентныеЗадания;
	Если не НеПисатьВЖурналРегламентныеЗадания Тогда
		
		ТекДата=ТекущаяДата();
		РегСвНабор=РегистрыСведений.ЗапускРегламентыхЗаданий_ХамелеонЦРПТ.СоздатьНаборЗаписей();
		РегСвНабор.Отбор.Период.Установить(текДата);
		РегсвНабор.Отбор.НазваниеАлгоритма.Установить("Запуск авто регламента");
		РегСвНабор.Отбор.ТипЗапуска.Установить(Перечисления.ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ.Запуск);
		Доб=РегСвНабор.Добавить();
		доб.НазваниеАлгоритма="Запуск авто регламента";
		Доб.Ошибка="";
		Доб.Период=ТекДата;
		Доб.ТипЗапуска=Перечисления.ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ.Запуск;
		РегСвНабор.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Поле1ПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
		ААА=РегистрыСведений.НастройкиПрограммы_ХамелеонЦРПТ.СоздатьНаборЗаписей();
	ААА.Прочитать();
	Если ААА.Количество()>0 Тогда
		СтрТ=ААА[0];
	Иначе
		СтрТ=ААА.Добавить();
	КонецЕсли;
	СтрТ.НеПисатьВЖурналРегламентныеЗадания=НеПисатьВЖурналРегламентныеЗадания;
	ААА.Записать(Истина);
	

КонецПроцедуры

&НаКлиенте
Процедура Поле1ПриИзменении(Элемент)
	Поле1ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	// Вставить содержимое обработчика.
		Если не НеПисатьВЖурналРегламентныеЗадания Тогда
		
		ТекДата=ТекущаяДата();
		РегСвНабор=РегистрыСведений.ЗапускРегламентыхЗаданий_ХамелеонЦРПТ.СоздатьНаборЗаписей();
		РегСвНабор.Отбор.Период.Установить(текДата);
		РегсвНабор.Отбор.НазваниеАлгоритма.Установить("Запуск авто регламента");
		РегСвНабор.Отбор.ТипЗапуска.Установить(Перечисления.ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ.Остановка);
		Доб=РегСвНабор.Добавить();
		доб.НазваниеАлгоритма="Запуск авто регламента";
		Доб.Ошибка="";
		Доб.Период=ТекДата;
		Доб.ТипЗапуска=Перечисления.ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ.Остановка;
		РегСвНабор.Записать(Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ПриЗакрытииНаСервере();
КонецПроцедуры
