
&НаКлиенте
Процедура СоздатьИОтправить(Команда)
	// Вставить содержимое обработчика.
	Если Не ЗначениеЗаполнено(Объект.КоличествоЗаказов) 
		ИЛИ Объект.ТабличнаяЧастьЗаказов.Количество()=0
		ИЛИ Не ЗначениеЗаполнено(Объект.ТекущийПользователь) Тогда
		Возврат;
	Конецесли;
	МассивДляОтправки=СоздатьЗаказы();
	
	Для Каждого Стр_11 Из МассивДляОтправки Цикл
		Форм=ПолучитьФорму("Документ.ЗаказМарок_ХамелеонЦРПТ.Форма.ФормаДокумента",
		Новый Структура("Ключ",Стр_11));
		Форм.ОтправитьВЦРПТ(Команда);
	Конеццикла;
КонецПроцедуры


Функция СоздатьЗаказы()
	
	МассивЗаказов=Новый Массив;
	Для Сч=1 По Объект.КоличествоЗаказов Цикл
		СоздатьЗаказ=Документы.ЗаказМарок_ХамелеонЦРПТ.СоздатьДокумент();
		СоздатьЗаказ.Дата=Текущаядата();
		СоздатьЗаказ.ТекущийПользователь=Объект.ТекущийПользователь;
		если СоздатьЗаказ.ТекущийПользователь.ТипВводаВОборот=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.МаркировкаОстатков Тогда
			СоздатьЗаказ.СпособВыпускаТоваров=Перечисления.СпособВыпускаТоваров_ХамелеонЦРПТ.МаркировкаОстатков;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.ТипВводаВОборот=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВводВОборотИмпорт 
			ИЛИ СоздатьЗаказ.ТекущийПользователь.ТипВводаВОборот=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ИмпортСФТС
			Тогда
			СоздатьЗаказ.СпособВыпускаТоваров=Перечисления.СпособВыпускаТоваров_ХамелеонЦРПТ.ВвезенВРФ;
		Иначе
			СоздатьЗаказ.СпособВыпускаТоваров=Перечисления.СпособВыпускаТоваров_ХамелеонЦРПТ.ПроизведенВРФ
		КонецЕсли;
		
		СоздатьЗаказ.Организация=СоздатьЗаказ.ТекущийПользователь.Организация;
		СоздатьЗаказ.ШаблонКМ=СоздатьЗаказ.ТекущийПользователь.ШаблонКМПоУмолчанию;
		СоздатьЗаказ.ШаблонКМ_Табак=СоздатьЗаказ.ТекущийПользователь.ШаблонКМТабакПоУмолчанию;
		СоздатьЗаказ.ТипОплаты=СоздатьЗаказ.ТекущийПользователь.ТипОплаты;
		Если Не ЗначениеЗаполнено(СоздатьЗаказ.ШаблонЭтикетки) Тогда
			СоздатьЗаказ.ШаблонЭтикетки=СоздатьЗаказ.ТекущийПользователь.ШаблонЭтикетки;
		КонецЕсли;
		Если Не ЗначениеЗАполнено(СоздатьЗаказ.НомерДоговораСОператором) ТОгда
			СоздатьЗаказ.НомерДоговораСОператором=СоздатьЗаказ.ТекущийПользователь.НомерДоговораСОператором;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СоздатьЗаказ.ДатаДоговораСОператором) Тогда
			СоздатьЗаказ.ДатаДоговораСОператором=СоздатьЗаказ.ТекущийПользователь.ДатаДоговораСОператором;
		КонецЕсли;
		Если не ЗначениеЗаполнено(СоздатьЗаказ.ШаблонЭтикетки) тогда
			СоздатьЗаказ.ШаблонЭтикетки=СоздатьЗаказ.ТекущийПользователь.ШаблонЭтикетки;
		КонецЕсли;
		Для Каждого Стр Из СоздатьЗаказ.Товары Цикл
			Если Не ЗначениеЗаполнено(Стр.СпособФормированияСН) Тогда
				Стр.СпособФормированияСН=СоздатьЗаказ.ТекущийПользователь.СпособФормированияСН;
				
			КонецЕслИ;
			Если Не ЗначениеЗаполнено(Стр.ВидСИ) Тогда
				Стр.ВидСИ=СоздатьЗаказ.ТекущийПользователь.ВидСИ;
				
			КонецЕслИ;
			Если Не ЗначениеЗаполнено(Стр.ВидМаркировки) Тогда
				Стр.ВидМаркировки=СоздатьЗаказ.ТекущийПользователь.ВидМаркировки;
			КонецЕслИ;
		Конеццикла;
		Если СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Шины" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Шины;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Молоко" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Молоко;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Одежда" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Одежда;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Табак" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Табак;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Альтернативный табак" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.АльтернативныйТабак;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Фармацевтика" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Фармацевтика;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Фото" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Фото;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Парфюм" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Парфюм;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Велосипеды" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Велосипеды;
			
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Питьевая вода" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.ПитьеваяВода;
			
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Кресла-коляски" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.КреслаКоляски;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Пиво" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Пиво;
			
		Иначе
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Обувь
		КонецЕсли;
		
		Для Каждого Стр_1 Из Объект.ТабличнаяЧастьЗаказов Цикл
			Добав=СоздатьЗаказ.Товары.Добавить();
			Добав.GTIN=Стр_1.Продукция;
			Добав.КоличествоКМ=Стр_1.КоличествоКМ;
			
			Добав.ВидМаркировки=Перечисления.ВидМаркировки_ХамелеонЦРПТ.НаТовар;
			Добав.ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.UNIT;
			Добав.СпособФормированияСН=Перечисления.СпособФормированияСН_ХамелеонЦРПТ.ОператорИСМП;
		Конеццикла;
		
		СоздатьЗаказ.Записать();
		МассивЗаказов.Добавить(СоздатьЗаказ.Ссылка);
	Конеццикла;
	
	Возврат МассивЗаказов
	
КонецФункции