
&НаКлиенте
Процедура ПрименитьОтбор(МассивКМ) Экспорт
	
	ОтборДелаемНаСервере(МассивКМ);
	
КонецПроцедуры


Процедура ОтборДелаемНаСервере(МассивКМ)
	ООО="";
	Попытка
	Если ЗначениеЗаполнено(МассивКМ) Тогда
		Для Каждого Стр Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если Строка(Стр.ЛевоеЗначение)="Продукция" Тогда
				//НашлиНоменклатуру=Истина;
				//Стр.ПравоеЗначение=НоменклатураВОтбор;
				//Стр.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
				//Стр.Использование=Истина;
				
				Для каждого СтрП Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
					Если СтрП.ИдентификаторПользовательскойНастройки=Стр.ИдентификаторПользовательскойНастройки Тогда
						
						СтрП.Использование=Истина;
						СтрП.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке;
						СтрП.ПравоеЗначение=МассивКМ;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				Прервать;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
Исключение
	КонецПопытки;
	
КонецПроцедуры