
Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОБъект._Order_ID="";
	ЭтоТОбъект.Статус="";
	ЭтотОбъект.ОшибкаОтправки="";
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ДатаПроизводства=ТекущаяДата();
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено Тогда
		
		Если ТипДанныхЗаполнения <> Тип("Структура")
			И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
			ДокументОснование = ДанныеЗаполнения;
		ИначеЕсли ТипДанныхЗаполнения = Тип("Структура")
			И ДанныеЗаполнения.Свойство("Основание")
			И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Основание.Метаданные()) Тогда
			ДокументОснование = ДанныеЗаполнения.Основание;
		КонецЕсли;

		
		
		
		Если ДокументОснование <> Неопределено Тогда
			
			
			ДДДД=Документы.СозданиеНовогоШкНаКороба_ХамелеонЦРПТ.НайтиПоРеквизиту("ЗаказДляФормированияНомераКОроба",ДокументОснование);
					
			
				//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
			// Данный фрагмент построен конструктором.
			// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
			
			
			
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ОстаткиКМЭмитированые_ХамелеонЦРПТОстатки.СерийныйНомер КАК СерийныйНомер,
				|	СУММА(ОстаткиКМЭмитированые_ХамелеонЦРПТОстатки.КоличествоОстаток) КАК КоличествоОстаток,
				|	ОстаткиКМЭмитированые_ХамелеонЦРПТОстатки.Продукция КАК Продукция
				|ИЗ
				|	РегистрНакопления.ОстаткиКМЭмитированые_ХамелеонЦРПТ.Остатки(
				|			,
				|			Организация = &Организация
				|				И СерийныйНомер В
				|					(ВЫБРАТЬ
				|						ОстаткиКМЭмитированые_ХамелеонЦРПТ.СерийныйНомер
				|					ИЗ
				|						РегистрНакопления.ОстаткиКМЭмитированые_ХамелеонЦРПТ КАК ОстаткиКМЭмитированые_ХамелеонЦРПТ
				|					ГДЕ
				|						ОстаткиКМЭмитированые_ХамелеонЦРПТ.Регистратор = &Регистратор)) КАК ОстаткиКМЭмитированые_ХамелеонЦРПТОстатки
				|
				|СГРУППИРОВАТЬ ПО
				|	ОстаткиКМЭмитированые_ХамелеонЦРПТОстатки.СерийныйНомер,
				|	ОстаткиКМЭмитированые_ХамелеонЦРПТОстатки.Продукция
				|ИТОГИ
				|	СУММА(КоличествоОстаток)
				|ПО
				|	СерийныйНомер,
				|	Продукция";
			
			Запрос.УстановитьПараметр("Организация", ДокументОснование.Организация);
			Если ЗначениеЗаполнено(ДДДД)  ТОгда
				Запрос.УстановитьПараметр("Регистратор", ДДДД);
			Иначе
				Запрос.УстановитьПараметр("Регистратор", ДокументОснование.Ссылка);
			КонецЕсли;
			
			РезультатЗапроса_М = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
			
			//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


			
			
			//Если Документоснование.Статус<>Перечисления.СтатусыДокументов_ХамелеонЦРПТ.КМЭмитирован Тогда
			//	Сообщить("Документ заказа по маркам доолжен быть в статусе КМ эмитированы");
			//	Возврат;
			//КонецЕсли;
			ДокОснование=Документоснование;
			ЗаполнитьЗначенияСвойств(ЭтотОБъект,ДокОснование,,"Номер,Дата,_Order_ID,Статус");
			
			Если ДокОснование.СпособВыпускаТоваров=Перечисления.СпособВыпускаТоваров_ХамелеонЦРПТ.ВвезенВРФ Тогда
				ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВводВОборотИмпорт;
			ИначеЕсли ДокОснование.СпособВыпускаТоваров=Перечисления.СпособВыпускаТоваров_ХамелеонЦРПТ.МаркировкаОстатков Тогда
				ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.МаркировкаОстатков;
			ИначеЕсли ДокОснование.СпособВыпускаТоваров=Перечисления.СпособВыпускаТоваров_ХамелеонЦРПТ.ПроизведенВРФ Тогда
				ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВводВОборот;
			
				
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	НомераКМ_ХамелеонЦРПТ.НомерКМ
				|ИЗ
				|	РегистрСведений.НомераКМ_ХамелеонЦРПТ КАК НомераКМ_ХамелеонЦРПТ
				|ГДЕ
				|	НомераКМ_ХамелеонЦРПТ.ДокументЗаказа = &ДокументЗаказа";
			
			Запрос.УстановитьПараметр("ДокументЗаказа", ДокОснование);
			
			РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗАпроса.Прямой);
			
			Если РезультатЗапроса.Количество()>0 Тогда 
				КоличествоНеобходмо=РезультатЗапроса.Количество();
				Смещение=0;
				Пока КоличествоНеобходмо>0 Цикл
					Если КоличествоНеобходмо<=99999 Тогда
						Для Сч=Смещение По  Смещение+КоличествоНеобходмо-1 Цикл
							
							GGG=РезультатЗапроса[Сч].НомерКМ;
							cis=Сред(СтрЗаменить(GGG,"%1D",""),1,38);
							
							Если Сред(cis,32,3)<>"240" Тогда
								//cis=Сред(cis,1,31);
								
								cis=Сред(GGG,1,Найти(GGG,"%1D")-1);
								cis=РаскодироватьСтроку(cis,СпособКодированияСтроки.КодировкаURL);
							КонецЕсли;
							
							ППП=РезультатЗапроса_М.НайтиСтроки(Новый Структура("СерийныйНомер",cis));
							Если ППП.Количество()=0 
								//И ППП.КоличествоОстаток<=0 
								Тогда
								Продолжить;
							КонецЕсли;
							Продукция=Неопределено;
							Для Каждого Стр_1П Из ППП Цикл
								Если ЗначениеЗаполнено(Стр_1П.Продукция) Тогда
									Продукция=Стр_1П.Продукция
								КонецЕсли;
								
								
							Конеццикла;
							
							
							ДД=ЭтотОБъект.СерийныеНомера.Добавить();
							Если ЗначениеЗаполнено(Продукция) Тогда
								ДД.НаименованиеТовара=Продукция
							Иначе
								Если Сред(cis,1,2)="01" тогда
								
									ДД.GTIN=Сред(cis,3,14);
								Иначе
									ДД.GTIN=Сред(cis,1,14);
									
								КонецЕсли;
								ДД.НаименованиеТовара=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",число(ДД.GTIN));;
							КонецЕсли;
							ДД.cis=cis;
							
							Добав=Товары.Найти(ДД.НаименованиеТовара,"GTIN");
							Если Добав=Неопределено Тогда
								Добав=Товары.Добавить();
								Добав.GTIN=ДД.НаименованиеТовара;
								Добав.ДекларацияИлиСертификатСоответствия=РЕгистрыСведений.ПодтверждающиеДокументы_ХамелеонЦРПТ.ПолучитьПоследнее(
										ТекущаяДата(),Новый Структура("Продукция",Добав.GTIN)).Документ;
								Добав.НомерСтрокиСвязи=Добав.НомерСтроки;
								Добав.КодТНВЭД=Добав.GTIN.КодТНВЭД;
							КонецЕсли;
							ДД.НомерСтрокиСвязи=Добав.НомерСтрокиСвязи;
							Добав.КоличествоКМ=Добав.КоличествоКМ+1;
							Добав.СпособВыпускаТоваров="";
							
						КонецЦикла;;
						
						КоличествоНеобходмо=0;               
					Иначе
						НадоСпсать=Мин(КоличествоНеобходмо,99999);
						ДокумС=Документы.ВводВОборот_ХамелеонЦРПТ.СоздатьДокумент();
						ЗаполнитьЗначенияСвойств(ДокумС,ЭтотОбъект,,"Номер");
						ДокумС.Дата=ТекущаяДата();
						Для Сч=Смещение По Смещение+НадоСпсать-1 Цикл
							GGG=РезультатЗапроса[Сч].НомерКМ;
							cis=Сред(СтрЗаменить(GGG,"%1D",""),1,38);
							Если Сред(cis,32,3)<>"240" Тогда
								//cis=Сред(cis,1,31);
								cis=Сред(GGG,1,Найти(GGG,"%1D")-1);
								cis=РаскодироватьСтроку(cis,СпособКодированияСтроки.КодировкаURL);
							КонецЕсли;

							ППП=РезультатЗапроса_М.НайтиСтроки(Новый Структура("СерийныйНомер",cis));
							Если ППП.Количество()=0 
								//И ППП.КоличествоОстаток<=0 
								Тогда
								Продолжить;
							КонецЕсли;
							Продукция=Неопределено;
							Для Каждого Стр_1П Из ППП Цикл
								Если ЗначениеЗаполнено(Стр_1П.Продукция) Тогда
									Продукция=Стр_1П.Продукция
								КонецЕсли;
								
								
							Конеццикла;
							
							
							ДД=ДокумС.СерийныеНомера.Добавить();
							Если ЗначениеЗаполнено(Продукция) Тогда
								ДД.НаименованиеТовара=Продукция
							Иначе
								Если Сред(cis,1,2)="01" тогда
								
									ДД.GTIN=Сред(cis,3,14);
								Иначе
									ДД.GTIN=Сред(cis,1,14);
									
								КонецЕсли;
								ДД.НаименованиеТовара=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",число(ДД.GTIN));;
							КонецЕсли;
							ДД.cis=cis;
							
							Добав=ДокумС.Товары.Найти(ДД.НаименованиеТовара,"GTIN");
							Если Добав=Неопределено Тогда
								Добав=ДокумС.Товары.Добавить();
								Добав.GTIN=ДД.НаименованиеТовара;
								Добав.ДекларацияИлиСертификатСоответствия=РЕгистрыСведений.ПодтверждающиеДокументы_ХамелеонЦРПТ.ПолучитьПоследнее(
										ТекущаяДата(),Новый Структура("Продукция",Добав.GTIN)).Документ;
								Добав.НомерСтрокиСвязи=Добав.НомерСтроки;
								Добав.КодТНВЭД=Добав.GTIN.КодТНВЭД;
							КонецЕсли;
							ДД.НомерСтрокиСвязи=Добав.НомерСтрокиСвязи;
							Добав.КоличествоКМ=Добав.КоличествоКМ+1;
							Добав.СпособВыпускаТоваров="";

						КонецЦикла;
						Смещение=Смещение+НадоСпсать;
						КоличествоНеобходмо=КоличествоНеобходмо-НадоСпсать;
						ДокумС.Записать();
						Сообщить("Создан документ "+Строка(ДокумС.Ссылка));
					КонецЕсли;
					
				КонецЦикла;
			Иначе
				
						Для Каждого Стр_1 Из Документоснование.КМИзAPI    Цикл
GGG=Стр_1.НомерКМ;							
							cis=Сред(СтрЗаменить(GGG,"%1D",""),1,38);
							Если Сред(cis,32,3)<>"240" Тогда
								cis=Сред(GGG,1,Найти(GGG,"%1D")-1);
								cis=РаскодироватьСтроку(cis,СпособКодированияСтроки.КодировкаURL);
								
//								cis=Сред(cis,1,31);
							КонецЕсли;

							ППП=РезультатЗапроса_М.НайтиСтроки(Новый Структура("СерийныйНомер",cis));
	Если (Документоснование.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Табак
		  ИЛИ Документоснование.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.АльтернативныйТабак)
		И Документоснование.ШаблонКМ_Табак=Перечисления.Шаблоны_подписи_кодов_КМ_Табак_ХамелеонЦРПТ.Блок Тогда
		                   //Документоснование.Товары[0].GTIN;
						   Для Каждого Стр_22 Из Документоснование.Товары Цикл
							   Если ЗначениеЗаполнено(Стр_22.GTIN) Тогда
							   	Продукция=Стр_22.GTIN;
							КонецЕсли;
							   
							Конеццикла;
						   
						   
						Иначе
							Если ППП=Неопределено ИЛИ (ППП.Количество()=0 
								//И ППП.КоличествоОстаток<=0
								) 
								Тогда
								Продолжить;
							КонецЕсли;
							Продукция=Неопределено;
							Для Каждого Стр_1П Из ППП Цикл
								Если ЗначениеЗаполнено(Стр_1П.Продукция) Тогда
									Продукция=Стр_1П.Продукция;
									Прервать;
								КонецЕсли;
								
								
							Конеццикла;
						КонецЕсли;
							
							
							ДД=ЭтотОБъект.СерийныеНомера.Добавить();
							Если ЗначениеЗаполнено(Продукция) Тогда
								ДД.НаименованиеТовара=Продукция
							Иначе
								Если Сред(cis,1,2)="01" тогда
								
									ДД.GTIN=Сред(cis,3,14);
								Иначе
									ДД.GTIN=Сред(cis,1,14);
									
								КонецЕсли;
								ДД.НаименованиеТовара=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",число(ДД.GTIN));;
							КонецЕсли;
							ДД.cis=cis;
						
							Добав=Товары.Найти(ДД.НаименованиеТовара,"GTIN");
							Если Добав=Неопределено Тогда
								Добав=Товары.Добавить();
								Добав.GTIN=ДД.НаименованиеТовара;
								Добав.ДекларацияИлиСертификатСоответствия=РЕгистрыСведений.ПодтверждающиеДокументы_ХамелеонЦРПТ.ПолучитьПоследнее(
										ТекущаяДата(),Новый Структура("Продукция",Добав.GTIN)).Документ;
								Добав.НомерСтрокиСвязи=Добав.НомерСтроки;
								Добав.КодТНВЭД=Добав.GTIN.КодТНВЭД;
							КонецЕсли;
							ДД.НомерСтрокиСвязи=Добав.НомерСтрокиСвязи;
							Добав.КоличествоКМ=Добав.КоличествоКМ+1;
							Добав.СпособВыпускаТоваров="";
							
						КонецЦикла;;
				
				
		//		Для Каждого Стр_1 Из ДокОснование.Товары Цикл
		//			Добав=Товары.Добавить();
		//			ЗаполнитьЗначенияСвойств(Добав,Стр_1);
		//			Добав.ДекларацияИлиСертификатСоответствия=РЕгистрыСведений.ПодтверждающиеДокументы_ХамелеонЦРПТ.ПолучитьПоследнее(
		//			ТекущаяДата(),Новый Структура("Продукция",Добав.GTIN)).Документ;
		//			
		//		КонецЦикла;
		//
		//		Для Каждого Стр_1 Из ДокОснование.СерийныеНомера Цикл
		//			Добав=СерийныеНомера.Добавить();
		//			ЗаполнитьЗначенияСвойств(Добав,Стр_1);	
		//			Если Не ЗначениеЗаполнено(Добав.cis) Тогда
		//				Тов=ДокОснование.Товары.Найти(Стр_1.НомерСтрокиСвязи,"НомерСтрокиСвязи");
		//				Добав.cis="01"+Стр_1.GTIN+"21"+Стр_1.СерийныйНомер+"240"+xmlString(Сред(Тов.КодТНВЭД.Код,1,4));
		//			КонецЕсли;
		//		Конеццикла;
	КонецЕсли;
	       
			//ЭтотОбъект.ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВводВОборотИмпорт;
			 
			
		КонецЕсли;
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое обработчика.
	Движения.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Записывать=Истина;
	Движения.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Очистить();
	
	Движения.ОстаткиКМЭмитированые_ХамелеонЦРПТ.Записывать=Истина;
	Движения.ОстаткиКМЭмитированые_ХамелеонЦРПТ.Очистить();
	Если ЭтоТОбъект.Статус=перечисления.СтатусыДокументов_ХамелеонЦРПТ.Обработан Тогда
		
	//	Марки=СерийныеНомера.ВыгрузитьКолонку("cis");
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//	"ВЫБРАТЬ
		//	|	УникальныеУпаковки_ХамелеонЦРПТ.УИТ,
		//	|	УникальныеУпаковки_ХамелеонЦРПТ.Ссылканаобъект
		//	|ИЗ
		//	|	РегистрСведений.УникальныеУпаковки_ХамелеонЦРПТ КАК УникальныеУпаковки_ХамелеонЦРПТ
		//	|ГДЕ
		//	|	УникальныеУпаковки_ХамелеонЦРПТ.УИТ В(&УИТ)
		//	|	И УникальныеУпаковки_ХамелеонЦРПТ.Ссылканаобъект <> &Ссылканаобъект";
		//
		//Запрос.УстановитьПараметр("Ссылканаобъект", ЭтотОБъект.Ссылка);
		//Запрос.УстановитьПараметр("УИТ", Марки);
		//
		//РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
		//РезультатЗапроса.Индексы.Добавить("УИТ");
		
		//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
		
		Для Каждого Стр Из ЭтотОбъект.СерийныеНомера Цикл
			
			
			//Добав.ID_Строки=Стр.ID_строки_партии;
			
			Если ЗначениеЗаполнено(Стр.cis) Тогда
			Добав=Движения.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Добавить();
				
				Добав.ВидДвижения=ВидДвиженияНакопления.Расход;
				Добав.Количество=1;
				Добав.Организация=ЭтотОбъект.Организация;
				Добав.Период=Дата;
				Добав.Продукция=Стр.НаименованиеТовара;
				Добав.СерийныйНомер=Стр.cis;
				
			КонецЕсли;
			
			
			
			Добав=Движения.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Добавить();
			//Добав.ID_Строки=Стр.ID_строки_партии;
			Добав.ВидДвижения=ВидДвиженияНакопления.Приход;
			Добав.Количество=1;
			Добав.Организация=ЭтотОбъект.Организация;
			Добав.Период=Дата;
			Добав.Продукция=Стр.НаименованиеТовара;
			//Если СтрДлина(Стр.cis)=29 Тогда
			//	Добав.СерийныйНомер=Сред(Стр.cis,1,21);
			//Иначе
				Добав.СерийныйНомер=Стр.НовыйКМ;
			//КонецЕсли;
			
			
		КонецЦикла;
	Конецесли;	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое обработчика.
	
	Для каждого Стр_1 Из ЭтотОБъект.СерийныеНомера Цикл
			Если ТекущийПользователь.СайтыВходаВСистему.Наименование="Фото" Тогда
					Стр_1.cis=Сред(Стр_1.cis,1,38);
			Иначе			
				Если СтрДлина(Стр_1.cis)=38 И Сред(Стр_1.cis,32,3)<>"240" Тогда
					Стр_1.cis=Сред(Стр_1.cis,1,31)
				Конецесли;
		КонецЕсли;
	Конеццикла;
	СуммаДокумента=0;
	Для Каждого Стр ИЗ Товары Цикл
		СуммаДокумента=СуммаДокумента+Стр.Цена*Стр.КоличествоКМ;
	Конеццикла;
	ЭтотОбъект.КоличествоКМ=СерийныеНомера.Количество();
	ЭтотОбъект.КоличествоНомеровКМ=Товары.Итог("КоличествоНомеровКМ");
КонецПроцедуры



Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Вставить содержимое обработчика.
	
	//Если ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВводВОборотИмпорт
	//	Тогда
	//	     ПроверяемыеРеквизиты.Добавить("КодТаможенногоОргана");
	//	     ПроверяемыеРеквизиты.Добавить("КодПринятогоРешения");
	//	     ПроверяемыеРеквизиты.Добавить("ДатаДекларацииТовара");
	//	     ПроверяемыеРеквизиты.Добавить("НомерДекларацииТовара");
	//	 ИначеЕсли ТипДОкумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ОтчетОбИспользовании 
	//		 ИЛИ ТипДОкумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.МаркировкаОстатков 
	//		 ИЛИ ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВыводИзОборота
	//		 ИЛИ ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВыводИзОБоротаДляСобственныхНужд
	//		 //ИЛИ ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВыводИзОБоротаДляСобственныхНуждПокупателем
	//		 Тогда
	//	
	//			     //ПроверяемыеРеквизиты.Добавить("СерийныеНомера.ГоденДо");
	//	
	//Иначе
	//			     ПроверяемыеРеквизиты.Добавить("Товары.ДекларацияИлиСертификатСоответствия");

	//КонецЕсли;
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	// Вставить содержимое обработчика.
	Попытка
		Если ЗначениеЗаполнено(ЭтотОбъект.ДокОснование) И Не ЗначениеЗаполнено(ЭтотОбъект.ДокОснование.ВводВоборот) ТОгда
			ДокП=ЭтотОбъект.ДокОснование.ПолучитьОбъект();
			ДокП.ВводВоборот=Ссылка;
			ДокП.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

