// ФТО:ALNA 22.07.2019 30701

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий	
	
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Количество() = 1 Тогда
		
		НастройкаОбщая = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект[0].Настройка, "Общая");
		Если НастройкаОбщая = Ложь Тогда //может быть NULL
			ПроверяемыеРеквизиты.Добавить("Организация");
		КонецЕсли;
		
	ИначеЕсли Количество() > 1 Тогда
		
		ЗаполнениеПравильное = Истина;
		Для Каждого Запись Из ЭтотОбъект Цикл
			НастройкаОбщая = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Настройка, "Общая");
			Если НастройкаОбщая = NULL
			 ИЛИ НастройкаОбщая И ЗначениеЗаполнено(Запись.Организация)
			 ИЛИ НЕ НастройкаОбщая И НЕ ЗначениеЗаполнено(Запись.Организация) Тогда
				ЗаполнениеПравильное = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ЗаполнениеПравильное Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Неверная заполненность полей ''Организация'''"),,,, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
