
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
//		Реквизит1="https://merucry.vetrf.ru"
	ПодключитьОбработчикОжидания("аа",0.1,Истина);
КонецПроцедуры

&НаКлиенте
Процедура аа() 
	Реквизит1="https://mercury.vetrf.ru/hs";
	Флаг=ложь;
//	ПодключитьОбработчикОжидания("аа_1",0.1,Истина);
//	
//	
//	//а=1;
КонецПроцедуры

//&НаКлиенте
//Процедура аа_1() 
//	Если Флаг<>Истина Тогда
//		
//		ПодключитьОбработчикОжидания("аа_1",1,Истина);
//	Иначе
//		
//		
//		
//		а=1;
//	Конецесли;
//Конецпроцедуры


&НаКлиенте
Процедура Поле2ПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Поле1ПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
//	а=1;
КонецПроцедуры

&НаКлиенте
Процедура Поле1ДокументСформирован(Элемент)
	// Вставить содержимое обработчика.
	Флаг=Истина;
	
	Попытка
		Если Элементы.Поле1.Документ.forms["loggedas"]<>Неопределено Тогда
			ЗаписатьКукиНаСервере(Элементы.Поле1.Документ.Cookie);
			ЭтаФорма.Закрыть();
			Сообщить("Успешное подключение к Меркурию");
			Возврат;
		//	а=1;
		Конецесли;
		
		
		Если Элементы.Поле1.Документ.forms["username"]<>Неопределено Тогда
			Элементы.Поле1.Документ.forms["username"].value=ВернутьИнициатора(Пользователь);
			Элементы.Поле1.Документ.forms["password"].value=ВернутьПароль(Пользователь);
			
			
			Документ = Элементы.Поле1.Документ;

			ЭлементыHTMLДокумента =Документ.querySelectorAll("[type=""submit""]");

			Для Каждого ТекЭлементHTMLДокумента Из ЭлементыHTMLДокумента Цикл
			        ТекЭлементHTMLДокумента.click();
					  
					  Прервать;
			    КонецЦикла;		
		//	СТ = "submit"; 		
		////	ЭлементHTMLДокумента = Элементы.Поле1.Документ.querySelector("input[type="""+СТ+"""]");
		//	ЭлементHTMLДокумента.click();		
			
	Конецесли;
	Исключение
	КонецПопытки;
	//	Элементы.Поле1.Документ.ПолучитьЭлементыПоИмени("input");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьИнициатора(Поль)
	Возврат Поль.Инициатор
КонецФункции


&НаСервереБезКонтекста
Функция ВернутьПароль(Поль)
	Возврат Поль.ПарольМеркурий
КонецФункции

&НаСервере
Процедура ЗаписатьКукиНаСервере(Куки)
	// Вставить содержимое обработчика.
	Попытка
		
		УстановитьПривилегированныйРежим (Истина);
		
		
		Струк=СтрокаВМассивСтрок(Куки,";");
		ВсеКуки="";
		Для Каждого Стр_11 Из Струк Цикл
			
			ВсеКуки=ВсеКуки+Символы.ПС+"Set-Cookie: "+Стр_11+";";
			
		Конеццикла;
		
		РегДв=РегистрыСведений.СохранитьКэшМеркурий_ХамелеонЦРПТ.СоздатьНаборЗаписей();
		РегДв.Отбор.Пользователь.Установить(Пользователь);
		Добав=РегДв.Добавить();
		Добав.Пользователь=Пользователь;
		Добав.Кэш=ВсеКуки;
		Регдв.Записать(Истина);
		
		УстановитьПривилегированныйРежим (Ложь);
		
		
	Исключение
	КонецПопытки;
КонецПроцедуры

Функция СтрокаВМассивСтрок(Знач Стр, Разделитель)
    
    Результат = Новый Массив;
    
    Строки = СтрЗаменить(Стр, Разделитель, Символы.ПС);
    
    Для Индекс = 1 По СтрЧислоСтрок(Строки) Цикл
        Результат.Добавить(СтрПолучитьСтроку(Строки, Индекс));
    КонецЦикла;
    
    Возврат Результат;
    
КонецФункции
&НаКлиенте
Процедура ЗаписатьКуки(Команда)
	ЗаписатьКукиНаСервере(Элементы.Поле1.Документ.Cookie);
КонецПроцедуры
