
&НаКлиенте
Процедура Команда1(Команда)
	// Вставить содержимое обработчика.
	ЭтаФорма.Закрыть(Новый Структура("Число,email,НомерЛицевогоСчета",Число,email,НомерЛицевогоСчета));
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	// Вставить содержимое обработчика.
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Поле1ПриИзменении(Элемент)
	// Вставить содержимое обработчика.
//	ЭтаФорма.Закрыть(Число);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	ПодключитьОбработчикОжидания("аа",0.1,Истина);
КонецПроцедуры


&НаКлиенте
Процедура аа()
		ЭтаФорма.Активизировать();
КонецПроцедуры