// ФТО:ALNA 22.07.2019 30701

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.РежимВыбора = Истина;
	КонецЕсли;
	
	//++ ФТО:ALNA 10.10.2019 32391
	СписокПолей = РегистрыСведений.МВ_ДополнительныеНастройки.СписокПолейСРежимомПароль();
	Для каждого ПолеПароль Из СписокПолей Цикл
		РегистрыСведений.МВ_ДополнительныеНастройки.УстановитьУсловноеОформлениеДляПароля(ЭтаФорма, "ЗначениеПоУмолчанию", "Список.ЗначениеПоУмолчанию", "Список.Ссылка", ПолеПароль);
	КонецЦикла;
	//-- ФТО:ALNA 10.10.2019
	
КонецПроцедуры

&НаСервере
Процедура Действие1НаСервере()
	//НомерДействияСтр ="1";
	//КомандаПредварительная = "Действие" + НомерДействияСтр + "(ИСТИНА, ЗаголовокДействия, ВерсияДействия)";

	//Попытка
	//	Выполнить(КомандаПредварительная);
	//	ПоследнийНомерСуществующегоДействия = НомерДействия;
	//Исключение
	//	Продолжить; //нет действия с таким номером
	//КонецПопытки;
	ТолькоИнформация = Ложь;
	ВозвращаемыйЗаголовок = "ЗаголовокДействия";
	ВозвращаемаяВерсия = "ВерсияДействия";
	ПланыВидовХарактеристик.МВ_ПереченьДополнительныхНастроек.ЗадатьРеквизитыПредопределенныхНастроек(
		ТолькоИнформация, ВозвращаемыйЗаголовок, ВозвращаемаяВерсия);	

КонецПроцедуры

&НаКлиенте
Процедура Действие1(Команда)
	Действие1НаСервере();
КонецПроцедуры

#КонецОбласти