Процедура ЗагрузитьобновитьПроверкуПросту(Объект) Экспорт
	             ;
//	ЗагрузитьКМ() ;
Если Объект.ПроверкаПоНомерамКМ.Итог("Количество")>0 Тогда
	Возврат;
КонецЕсли;


	Объект.ПроверкаПоНомерамКМ.Очистить();;
	Объект.ПроверкаПростая.Очистить();;
	Для Каждого Стр_1 Из Объект.СерийныеНомера Цикл

		
		
		Если Стр_1.ТипУпаковки=Перечисления.Тип_КМ_ХамелеонЦРПТ.Штука Тогда
			Если Сред(Стр_1.cis,1,2)="01" Тогда
			GTIN=Сред(Стр_1.cis,3,14);
		Иначе
			GTIN=Сред(Стр_1.cis,1,14);
			
		КонецЕсли;
		Стр_1.GTIN=GTIN;
		КонецЕсли;
	
		Если  ЗначениеЗаполнено(Стр_1.GTIN) Тогда
			НСтр=Объект.ПроверкаПростая.НайтиСтроки(Новый Структура("GTINНаименованиеТовара",Стр_1.gtin));
			Если НСтр.Количество()=0 Тогда
			Добав_пр=Объект.ПроверкаПростая.Добавить();
			Добав_пр.GTINНаименованиеТовара=Стр_1.gtin;
			 Добав_пр.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",число(Стр_1.gtin));
			
			Добав_пр.Количество=1;
		Иначе
			
			Нстр[0].Количество=НСТр[0].Количество+1;
			КонецЕсли;
		Иначе
			НСтр=Объект.ПроверкаПростая.НайтиСтроки(Новый Структура("GTINНаименованиеТовара",Стр_1.НаименованиеТовараСтрокой));
			Если НСтр.Количество()=0 Тогда
			Добав_пр=Объект.ПроверкаПростая.Добавить();
			Добав_пр.GTINНаименованиеТовара=Стр_1.НаименованиеТовараСтрокой;
			Если ЗначениеЗаполнено(Стр_1.КоличествоКМ) Тогда
				Добав_пр.Количество=Стр_1.КоличествоКМ;
			Иначе
				Добав_пр.Количество=1;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(Стр_1.КоличествоКМ) Тогда
				//Добав_пр.Количество=Стр_1.КоличествоКМ;
				Нстр[0].Количество=НСТр[0].Количество+1;
			Иначе
				Нстр[0].Количество=НСТр[0].Количество+1;
			КонецЕсли;
			
			//Нстр[0].Количество=НСТр[0].Количество+1;
			КонецЕсли;
			
			
		КонецЕсли;
		
		Если Стр_1.ТипУпаковки=Перечисления.Тип_КМ_ХамелеонЦРПТ.Упаковка Тогда
			Продолжить;
		КонецЕсли;
		
		Если Объект.Короба.НайтиСтроки(Новый Структура("НомерКороба",Стр_1.cis)).Количество()>0 Тогда
			Продолжить;
		КонецЕсли;
		
		
		
		//Стр_1=Объект.СерийныеНомера.НайтиСтроки(Новый Структура("cis",Стр_2.НомерКороба))[0];
		Если Сред(Стр_1.cis,1,2)="01" Тогда
			GTIN=Сред(Стр_1.cis,3,14);
		Иначе
			GTIN=Сред(Стр_1.cis,1,14);
			
		КонецЕсли;

			НСтр=Объект.ПроверкаПоНомерамКМ.НайтиСтроки(Новый Структура("GTINНаименованиеТовара",gtin));
			Если НСтр.Количество()=0 Тогда
			Добав_пр=Объект.ПроверкаПоНомерамКМ.Добавить();
			Добав_пр.GTINНаименованиеТовара=gtin;
			 Добав_пр.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",число(gtin));
			 
			// СтрокаТовара=Объект.Товары.НайтиСтроки(Новый Структура("НомерСтрокиСвязи",Стр_1.НомерСтрокиСвязи));
			// 
			// КоличествоКМ=СтрокаТовара[0].КоличествоНомеровКМ;
			// Если Не ЗначениеЗаполненО(КоличествоКМ) Тогда
			//	 КоличествоКМ=СтрокаТовара[0].КоличествоКМ;
			// КонецЕсли;
			// Если ЗначениеЗаполнено(КоличествоКМ) тогда
			// 	Добав_Пр.цена=СтрокаТовара[0].Цена*СтрокаТовара[0].КоличествоКМ/КоличествоКМ;
			//КонецЕсли;
			// Если ЗначениеЗаполнено(КоличествоКМ) тогда
			// 	Добав_Пр.НДС=СтрокаТовара[0].НДС/КоличествоКМ;
			//КонецЕсли;
			Добав_пр.Количество=1;
		Иначе
			
			Нстр[0].Количество=НСТр[0].Количество+1;
		КонецЕсли;
		
		
		
		
	Конеццикла;
	
	 Для Каждого Стр_2 Из Объект.Короба Цикл
		 Если Не ЗначениеЗаполнено(Стр_2.ШтрихКод) ИЛИ Не ЗначениеЗаполнено(Стр_2.НомерКороба) Тогда
			 Продолжить;
		КонецЕсли;
		 	
		Если Стр_2.ТипУпаковки=Перечисления.Тип_КМ_ХамелеонЦРПТ.Упаковка Тогда
			Продолжить;
		КонецЕсли;
		
		Если Объект.Короба.НайтиСтроки(Новый Структура("НомерКороба",Стр_2.ШтрихКод)).Количество()>0 Тогда
			Продолжить;
		КонецЕсли;
		
		
		//Стр_1=Объект.СерийныеНомера.НайтиСтроки(Новый Структура("cis",Стр_2.НомерКороба))[0];
		Если Сред(Стр_2.ШтрихКод,1,2)="01" Тогда
			GTIN=Сред(Стр_2.ШтрихКод,3,14);
		Иначе
			GTIN=Сред(Стр_2.ШтрихКод,1,14);
			
		КонецЕсли;

			НСтр=Объект.ПроверкаПоНомерамКМ.НайтиСтроки(Новый Структура("GTINНаименованиеТовара",gtin));
			Если НСтр.Количество()=0 Тогда
			Добав_пр=Объект.ПроверкаПоНомерамКМ.Добавить();
			Добав_пр.GTINНаименованиеТовара=gtin;
			Попытка
			 Добав_пр.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",число(gtin));
		 Исключение
			Конецпопытки;
			 СтрокаТовара=Объект.Товары.НайтиСтроки(Новый Структура("gtin",Добав_пр.Продукция));
			 Если        СтрокаТовара.Количество()>0 Тогда
			 Идентификатор1=СтрокаТовара[0];
	
			 КоличествоКМ=СтрокаТовара[0].КоличествоНомеровКМ;
			 Если Не ЗначениеЗаполненО(КоличествоКМ) Тогда
				 КоличествоКМ=СтрокаТовара[0].КоличествоКМ;
			 КонецЕсли;
			 Если ЗначениеЗаполнено(КоличествоКМ) тогда
			 	Добав_Пр.цена=СтрокаТовара[0].Цена*СтрокаТовара[0].КоличествоКМ/КоличествоКМ;
			КонецЕсли;
			 Если ЗначениеЗаполнено(КоличествоКМ) тогда
			 	Добав_Пр.НДС=СтрокаТовара[0].НДС/КоличествоКМ;
			КонецЕсли;
			КонецЕсли;
			
			Добав_пр.Количество=1;
		Иначе
			
			Нстр[0].Количество=НСТр[0].Количество+1;
		КонецЕсли;
		
		
	Конеццикла;
	
	Для Каждого Стр_1 Из Объект.ПроверкаПоНомерамКМ Цикл
		Стр_1.НДС=Стр_1.НДС*Стр_1.Количество;
		Стр_1.Сумма=Стр_1.Цена*Стр_1.Количество;
		
	Конеццикла;
	
	Для каждого Стр_1 Из Объект.Марки Цикл
			   Добав=Стр_1;
								Стр_1.Нет=Ложь;
		
				Марка=Стр_1.Марка;
				     штрихКод_1=Марка;
							Марка_1=Марка;		
					Если Объект.ОбратныйАкцепт=Истина тогда
								Если СтрдЛина(Марка)<>18 Тогда
								
								//ШтрихКод_1=КодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
								//штрихКод=СтрЗаменить(ШтрихКод_1,"%1D","");
								ШтрихКод=Сред(ШтрихКод,1,38);
								//штрихКод_1=РаскодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
									Если Сред(штрихКод_1,32,3)<>"240" Тогда
															ШтрихКод=Сред(ШтрихКод,1,31);
															//ШтрихКод=Сред(штрихКод_1,1,Найти(штрихКод_1,"%1D")-1);
															//ШтрихКод=РаскодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
														Иначе
															
															           ШтрихКод=штрихКод_1;
														
														КонецЕсли;
														
														Марка=ШтрихКод;
														Попытка
														GTIN=Сред(ШтрихКод,3,14)
														//Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",
														//Число(Сред(ШтрихКод,3,14)));
													Исключение
													КонецПопытки;  
								Если Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Фармацевтика" Тогда
									Если Сред(Марка,1,2)="01" Тогда
										Марка=Сред(Марка,3,14)+Сред(Марка,19);
									Иначе
										GTIN=Сред(ШтрихКод,1,14)
										
									КонецЕсли;
								ИначеЕсли 	Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Табак"
									ИЛИ Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Альтернативный табак"
									Тогда
									Если Сред(Марка,1,2)<>"01" Тогда
										GTIN=Сред(Марка,1,14)
										
									КонецЕсли;
								КонецЕсли;
								
							Иначе
								Марка=Марка_1;
								   КонецЕсли;
								
								МаркаЕсть=Объект.Марки.НайтиСтроки(Новый Структура("Марка",Марка));
								Если МаркаЕсть.Количество()>0 Тогда
									Сообщить("cis "+марка+" уже отсканировали");
									Возврат;
								КонецЕслИ;
								Если СтрдЛина(Марка)=18 Тогда
									Попытка
										Ч=ЧИсло(Марка);
										ДД=Объект.СерийныеНомера.НайтиСтроки(Новый Структура("cis",Марка));
//										Добав=Объект.Марки.Добавить();
//										Добав.Марка=Марка;
										Колстрок=1;
										//Если ДД.Количество()=0 Тогда
										//	
										//	НайтиВдругомМесте=Объект.Короба.НайтиСтроки(Новый Структура("Штрихкод",Марка));
										//	Если НайтиВдругомМесте.Количество()=0 Тогда
										//		Добав.НаименованиеТовара="НЕ ПОЛУЧАЛИ";
										//		Добав.Нет=Истина;
										//	Иначе
										//		    ////Короб в сотсаве друогого короба
										//		
										//	КонецЕслИ;
										//Иначе
										//	Добав.НаименованиеТовара=ДД[0].НаименованиеТовараСтрокой;
										//	Колстрок=ДД[0].КоличествоКМ;
										//КонецЕслИ;
										//
										
									Исключение
								 		Сообщить("Сканируемая cis "+марка+" имеет не правильный формат");
										
									КонецПопытки;
								Иначе
									Попытка	
										Если Найти(Марка_1,"<ГС1>")=0 Тогда
											
											Марка_1=Сред(Марка_1,1,16)
											+Сред(Марка_1,17,15)+"<ГС1>"+Сред(Марка_1,32,6)+"<ГС1>"+Сред(Марка_1,39);
											Марка_1=СтрЗаменить(Марка_1,"<ГС1>",Символ(29));
											Марка_1=КодироватьСтроку(Марка_1,СпособКодированияСтроки.КодировкаURL);
											
							Иначе
								Марка_1=СтрЗаменить(Марка_1,"<ГС1>",Символ(29));
					            Марка_1=КодироватьСтроку(Марка_1,СпособКодированияСтроки.КодировкаURL);
										КонецЕсли;
										
									//	Добав=Объект.Марки.Добавить();
									//	Добав.Марка=Марка;
									//	Добав.ДлиннаяМарка=Марка_1;
									//	Добав.Нет=Ложь;
									
									Исключение
										Сообщить("Сканируемая cis "+марка+" имеет не правильный формат");
									КонецПопытки;
								КонецЕсли;
								
								
						
						
						Возврат;
					КонецЕсли;
					
					
					 ШтрихКод=Марка;
					
					
					Если СтрдЛина(Марка)<>18 Тогда
								ИскатьПоСтрочно=Ложь;
					//	ШтрихКод=СтрЗаменить(Марка_1,"<ГС1>","");
					//	ШтрихКод_1=(ШтрихКод);
					
					//ШтрихКод_1=КодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
					//штрихКод=СтрЗаменить(ШтрихКод_1,"%1D","");
					Если Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Фото" Тогда
						ШтрихКод=Сред(ШтрихКод,1,38);
						
					ИначеЕсли Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование<>"Табак"
						И Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование<>"Альтернативный табак" ТОгда 
						ШтрихКод=Сред(ШтрихКод,1,38);
					//штрихКод_1=РаскодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
						Если Сред(штрихКод_1,32,3)<>"240" Тогда
												ШтрихКод=Сред(ШтрихКод,1,31);
												//ШтрихКод=Сред(штрихКод_1,1,Найти(штрихКод_1,"%1D")-1);
												//ШтрихКод=РаскодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
											Иначе
												
												           ШтрихКод=штрихКод_1;
											
														   
													   КонецЕсли;
												   Иначе
													   				ИскатьПоСтрочно=Истина;

					КонецЕсли;
					ДД=Новый Массив;
				ДД.Очистить();
					Если СтрДлина(ШтрихКод)>50 Тогда
						ШтрихКод=Сред(ШтрихКод,1,35);
						//ИскатьПоСтрочно=Истина;
					КонецЕсли;
					
					Марка=ШтрихКод;
											Попытка
											GTIN=Сред(ШтрихКод,3,14)
											//Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",
											//Число(Сред(ШтрихКод,3,14)));
										Исключение
										КонецПопытки;  
					Если Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Фармацевтика" Тогда
						Если Сред(Марка,1,2)="01" Тогда
							Марка=Сред(Марка,3,14)+Сред(Марка,19);
						КонецЕсли;
						
					КонецЕсли;
					
					
				Иначе
					Марка=Марка_1;
					   КонецЕсли;
					   
					Если СтрдЛина(Марка)=18 Тогда
						Попытка
							Ч=ЧИсло(Марка);
							Нашли=Ложь;
							
							ДД=новый Массив;
							ДД.Очистить();
							//Если ИскатьПоСтрочно=Истина Тогда
							//	Для Каждого Стр_1 Из Объект.СерийныеНомера Цикл
							//		Если Найти(Стр_1.cis,Марка)=1 Тогда
							//			Нашли=Истина;
							//			
							//			Прервать;
							//		КонецЕсли;
							//	Конеццикла;
							//	
							//	
							//	
							//Иначе
								
							ДД=Объект.СерийныеНомера.НайтиСтроки(Новый Структура("cis",Марка));
							Если ДД.Количество()>0 	 Тогда
								//идентификатор3=ДД[0].Полуитьидентификатор();
							КонецЕсли;
								
								
							//КонецЕсли;
							//Добав=Объект.Марки.Добавить();
							//Добав.Марка=Марка;
							Колстрок=1;
							Если Нашли=Ложь И ДД.Количество()=0 Тогда
								
								ДД=Новый Массив;
								ДД.Очистить();
								//Если ИскатьПоСтрочно=Истина Тогда
								//	Нашли=Ложь;
								//	Для Каждого Стр_1 Из Объект.Короба Цикл
								//		Если Найти(Стр_1.ШтрихКод,Марка)=1 Тогда
								//			Нашли=Истина;
								//			Прервать;
								//		КонецЕсли;
								//	Конеццикла;
								//	Если Нашли=Ложь Тогда
								//		Добав.НаименованиеТовара="НЕ ПОЛУЧАЛИ";
								//		Добав.Нет=Истина;
								//		
								//	КонецЕсли;
								//	
								//	
								//Иначе
									НайтиВдругомМесте=Объект.Короба.НайтиСтроки(Новый Структура("Штрихкод",Марка));
									Если НайтиВдругомМесте.Количество()=0 Тогда
										//Добав.НаименованиеТовара="НЕ ПОЛУЧАЛИ";
										//Добав.Нет=Истина;
									Иначе
										    ////Короб в сотсаве друогого короба
									
										КонецЕслИ;
								//КонецЕсли;
							Иначе
								//Добав.НаименованиеТовара=ДД[0].НаименованиеТовараСтрокой;
								Колстрок=ДД[0].КоличествоКМ;
							КонецЕслИ;
							
							ДД=Объект.ПроверкаПростая.НайтиСтроки(Новый Структура("GTINНаименованиеТовара",Добав.НаименованиеТовара));
							Если ДД.Количество()=0 И ЗначениеЗАполнено(Добав.Продукция) Тогда
								ДД=Объект.ПроверкаПростая.НайтиСтроки(Новый Структура("Продукция",Добав.Продукция));
							Конецесли;
							//Колстрок_1=Объект.СерийныеНомера.НайтиСтроки(Новый Структура("cis",Марка));
							//Если 
							Если    Колстрок=0 Тогда
								Колстрок=1;
							КонецЕсли;
							
							Если ДД.Количество()=0 Тогда
								Добав_пр=Объект.ПроверкаПростая.Добавить();
								Добав_пр.GTINНаименованиеТовара=Добав.НаименованиеТовара;
								Добав_пр.КоличествоСканированных=1;
								Идентификатор4=Добав_пр.Получитьидентификатор();
							Иначе
								ДД[0].КоличествоСканированных=ДД[0].КоличествоСканированных+1;
								Идентификатор4=ДД[0].Получитьидентификатор();
							КонецЕсли;
						Исключение
					 		Сообщить("Сканируемая cis "+марка+" имеет не правильный формат");
							
						КонецПопытки;
					Иначе
						Попытка	
							Если Найти(Марка_1,"<ГС1>")=0 Тогда
								
								Марка_1=Сред(Марка_1,1,16)
								+Сред(Марка_1,17,15)+"<ГС1>"+Сред(Марка_1,32,6)+"<ГС1>"+Сред(Марка_1,39);
								Марка_1=СтрЗаменить(Марка_1,"<ГС1>",Символ(29));
								Марка_1=КодироватьСтроку(Марка_1,СпособКодированияСтроки.КодировкаURL);
								
							Иначе
								Марка_1=СтрЗаменить(Марка_1,"<ГС1>",Символ(29));
					            Марка_1=КодироватьСтроку(Марка_1,СпособКодированияСтроки.КодировкаURL);
							КонецЕсли;
							
//						Добав=Объект.Марки.Добавить();
//						Добав.Марка=Марка;
//						Добав.ДлиннаяМарка=Марка_1;
//						Добав.Нет=Ложь;
						
						СпрП=Неопределено;
						
							Нашли=Ложь;
							
							ДД=Новый Массив;
							ДД.Очистить();
							Если ИскатьПоСтрочно=Истина Тогда
								Для Каждого Стр_22 Из Объект.СерийныеНомера Цикл
									Если Найти(Стр_22.cis,Марка)=1 
										ИЛИ Найти(Марка,Стр_22.cis)=1 
										Тогда
										Нашли=Истина;
										//Идентификатор3=Стр_1.ПолучитьИдентификатор();
										Прервать;
									КонецЕсли;
								Конеццикла;
								
								
								
							Иначе
								
								ДД=Объект.СерийныеНомера.НайтиСтроки(Новый Структура("cis",Марка));
								Если ДД.Количество()>0 Тогда
									//Идентификатор3=ДД[0].ПолучитьИдентификатор();
								КонецЕсли;
								
							КонецЕсли;

							
							
						//
						//ДД=Объект.СерийныеНомера.НайтиСтроки(Новый Структура("cis",Марка));
						Если Нашли=Ложь И ДД.Количество()=0 Тогда
							GTIN="НЕ ПОЛУЧАЛИ";
							
							ДД=Новый Массив;
				ДД.Очистить();
											Если ИскатьПоСтрочно=Истина Тогда
									Нашли=Ложь;
									Для Каждого Стр_22 Из Объект.Короба Цикл
										Если Найти(Стр_22.ШтрихКод,Марка)=1 
											ИЛИ Найти(Марка,Стр_22.ШтрихКод)=1 
											Тогда
											Нашли=Истина;
											Прервать;
										КонецЕсли;
									Конеццикла;
									Если Нашли=Ложь Тогда
										Добав.Нет=Истина;
										
									КонецЕсли;
									
									
								Иначе
										НайтиВдругомМесте=Объект.Короба.НайтиСтроки(Новый Структура("ШтрихКод",Марка));
										Если НайтиВдругомМесте.Количество()=0 Тогда
										//	GTIN="НЕ ПОЛУЧАЛИ";
											Добав.Нет=Истина;
										//Иначе
											//GTIN=Сред(Марка,3,14);
											//НомерКороба=НайтиВдругомМесте[0].НомерКороба;
											//Нстроку=Объект.СерийныеНомера.НайтиСтроки(Новый Структура("cis",НомерКороба));
											//Если Нстроку.Количество()>0 Тогда
											//	GTIN=Нстроку[0].НаименованиеТовараСтрокой;
											//КонецЕслИ;
											
										КонецЕслИ;
									КонецЕсли;
						КонецЕсли;	
						//Иначе         
						//Если GTIN="НЕ ПОЛУЧАЛИ" Тогда
						//	Добав.Нет=Истина;
						//КонецЕсли;
						
						//Добав.Продукция=СпрП;
						
										
						Если Добав.Нет=Ложь Тогда
							Если Сред(Марка,1,2)="01" Тогда
								GTIN=Сред(Марка,3,14);
							Иначе
								GTIN=Сред(Марка,1,14);
								
							КонецЕсли;
						КонецЕсли;

						ДД=Объект.ПроверкаПростая.НайтиСтроки(Новый Структура("GTINНаименованиеТовара",GTIN));
						
						
						Если ДД.Количество()=0 Тогда
				//GTIN		="НЕ ПОЛУЧАЛИ";
							Добав.GTIN="НЕ ПОЛУЧАЛИ";
						ДД=Объект.ПроверкаПростая.НайтиСтроки(Новый Структура("GTINНаименованиеТовара",Добав.GTIN));
						Если ДД.Количество()=0 Тогда
							Добав_пр=Объект.ПроверкаПростая.Добавить();
							Добав_пр.GTINНаименованиеТовара="НЕ ПОЛУЧАЛИ";
							Добав_пр.КоличествоСканированных=1;
							Добав_Пр.Продукция=СпрП;
							Идентификатор4=Добав_Пр.ПолучитьИдентификатор();
						Иначе
							Идентификатор4=ДД[0].ПолучитьИдентификатор();
							
							ДД[0].КоличествоСканированных=ДД[0].КоличествоСканированных+1;
							//Добав.GTIN=gtin;

							КонецЕсли;
						Иначе
							Идентификатор4=ДД[0].ПолучитьИдентификатор();
							ДД[0].КоличествоСканированных=ДД[0].КоличествоСканированных+1;
										Добав.GTIN=GTIN;

									КонецЕсли;
									
											//СпрП =справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",Число(gtin));
									
						ДД=Объект.ПроверкаПоНомерамКМ.НайтиСтроки(Новый Структура("GTINНаименованиеТовара",GTIN));
						Если ДД.Количество()=0 Тогда
				GTIN		="НЕ ПОЛУЧАЛИ";
							Добав.GTIN="НЕ ПОЛУЧАЛИ";
							Добав.Нет=Истина;
						ДД=Объект.ПроверкаПоНомерамКМ.НайтиСтроки(Новый Структура("GTINНаименованиеТовара",GTIN));
						Если ДД.Количество()=0 Тогда
							Добав_пр=Объект.ПроверкаПоНомерамКМ.Добавить();
							Добав_пр.GTINНаименованиеТовара="НЕ ПОЛУЧАЛИ";
							Добав_пр.КоличествоСканированных=1;
							Добав_Пр.Продукция=СпрП;
							
							
							Идентификатор2=Добав_пр.ПолучитьИдентификатор();
						Иначе
							Идентификатор2=ДД[0].ПолучитьИдентификатор();
							
							ДД[0].КоличествоСканированных=ДД[0].КоличествоСканированных+1;
							//Добав.GTIN=gtin;

							КонецЕсли;
						Иначе
							Идентификатор2=ДД[0].ПолучитьИдентификатор();
							ДД[0].КоличествоСканированных=ДД[0].КоличествоСканированных+1;
									//	Добав.GTIN=GTIN;

									КонецЕсли;
						Исключение
						Сообщить("Сканируемая cis "+марка+" имеет не правильный формат");
					КонецПопытки;
					КонецЕсли;
					
												
						Если Идентификатор1=Неопределено Тогда
								Нстр=Объект.СерийныеНомера.НайтиСтроки(Новый Структура("cis",Марка));
								
								Если НСтр.Количество()>0  Тогда
									Товар=Объект.Товары.НайтиСтроки(Новый Структура("НомерСтрокиСвязи",Нстр[0].НомерСтрокиСвязи));
									Если Товар.Количество()>0 Тогда
										Идентификатор1=Товар[0].ПолучитьИдентификатор();
									КонецЕсли;
								КонецЕсли;
							
						КонецЕсли;
						
						
						
						
						
						
						
						
						

				
				
		Конеццикла;
		
		
		
КонецПроцедуры



Процедура ДобавитьcisВдокумент(Знач Марка_1,Объект,Идентификатор1=Неопределено,Идентификатор2=Неопределено,Идентификатор3=Неопределено,Идентификатор4=Неопределено) Экспорт

	Если 	Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Фармацевтика" Тогда
		
		Если Сред(Марка_1,1,1)="/" Тогда
			Марка_1=Сред(Марка_1,2);
		Конецесли;
		
		Если СтрДлина(Марка_1)>20 Тогда
			
				Если Сред(Марка_1,1,2)="01" Тогда
					Марка_1=Сред(Марка_1,3,14)+Сред(Марка_1,19);
				КонецЕсли;
				Марка_1=Сред(Марка_1,1,27); 
								
			
			Если ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПроверитьСтроку(Марка_1,"[0-9]{14}[&#x21;-&#x22;&#x25;-&#x2F;&#x30;-&#x39;&#x41;-&#x5A;&#x5F;&#x61;-&#x7A;]{13}")=Ложь Тогда
				 Сообщить("Штрихкод "+Марка_1+" не соответствует шаблону ");
				 //Если ИздаватьЗвукПрИНеправильнойКМ Тогда
					// Сигналить=истина;
				//Конецесли;
				Возврат;
			Конецесли;
		Иначе
			
			Если СтрДлина(Марка_1)=20 Тогда
				Марка_1=Сред(Марка_1,3);
			КонецЕсли;
			Если ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПроверитьСтроку(Марка_1,"[0-9]{18}")=Ложь Тогда
				 Сообщить("Штрихкод "+Марка_1+" не соответствует шаблону ");
				Возврат;
			Конецесли;

		Конецесли;

		
		
	КонецЕсли;
								
	
	
	Если ТипЗнч(Объект)=Тип("ДанныеФормыСтруктура") 
		И РегистрыСведений.НастройкиПрограммы_ХамелеонЦРПТ.Получить().ПриСканированииВПриемкеИскатьСтрочки
		Тогда
	
					
						Если СтрДлина(Марка_1)=20 Тогда
							Марка_1=СтрЗаменить(Марка_1,"<ГС1>","");
							Марка_1=Сред(Марка_1,3);
						КонецЕсли;
					ШтрихКод_1=(Марка_1);
					ШтрихКод=ШтрихКод_1;
						
						Марка=Марка_1; 

					
					Если Объект.ОбратныйАкцепт=Истина тогда
								Если СтрдЛина(Марка)<>18 Тогда
								
								//ШтрихКод_1=КодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
								//штрихКод=СтрЗаменить(ШтрихКод_1,"%1D","");
								ШтрихКод=Сред(ШтрихКод,1,38);
								//штрихКод_1=РаскодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
									Если Сред(штрихКод_1,32,3)<>"240" Тогда
															ШтрихКод=Сред(ШтрихКод,1,31);
															//ШтрихКод=Сред(штрихКод_1,1,Найти(штрихКод_1,"%1D")-1);
															//ШтрихКод=РаскодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
														Иначе
															
															           ШтрихКод=штрихКод_1;
														
														КонецЕсли;
														
														Марка=ШтрихКод;
														Попытка
														GTIN=Сред(ШтрихКод,3,14)
														//Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",
														//Число(Сред(ШтрихКод,3,14)));
													Исключение
													КонецПопытки;  
								Если Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Фармацевтика" Тогда
									Если Сред(Марка,1,2)="01" Тогда
										Марка=Сред(Марка,3,14)+Сред(Марка,19);
									Иначе
										GTIN=Сред(ШтрихКод,1,14)
										
									КонецЕсли;
								ИначеЕсли 	Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Табак"
									ИЛИ Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Альтернативный табак"
									Тогда
									Если Сред(Марка,1,2)<>"01" Тогда
										GTIN=Сред(Марка,1,14)
										
									КонецЕсли;
								КонецЕсли;
								
							Иначе
								Марка=Марка_1;
								   КонецЕсли;
								
								МаркаЕсть=Объект.Марки.НайтиСтроки(Новый Структура("Марка",Марка));
								Если МаркаЕсть.Количество()>0 Тогда
									Сообщить("cis "+марка+" уже отсканировали");
									Возврат;
								КонецЕслИ;
								Если СтрдЛина(Марка)=18 Тогда
									Попытка
										Ч=ЧИсло(Марка);
										ДД=Объект.СерийныеНомера.НайтиСтроки(Новый Структура("cis",Марка));
										Добав=Объект.Марки.Добавить();
										Добав.Марка=Марка;
										Колстрок=1;
										//Если ДД.Количество()=0 Тогда
										//	
										//	НайтиВдругомМесте=Объект.Короба.НайтиСтроки(Новый Структура("Штрихкод",Марка));
										//	Если НайтиВдругомМесте.Количество()=0 Тогда
										//		Добав.НаименованиеТовара="НЕ ПОЛУЧАЛИ";
										//		Добав.Нет=Истина;
										//	Иначе
										//		    ////Короб в сотсаве друогого короба
										//		
										//	КонецЕслИ;
										//Иначе
										//	Добав.НаименованиеТовара=ДД[0].НаименованиеТовараСтрокой;
										//	Колстрок=ДД[0].КоличествоКМ;
										//КонецЕслИ;
										//
										
									Исключение
								 		Сообщить("Сканируемая cis "+марка+" имеет не правильный формат");
										
									КонецПопытки;
								Иначе
									Попытка	
										Если Найти(Марка_1,"<ГС1>")=0 Тогда
											
											Марка_1=Сред(Марка_1,1,16)
											+Сред(Марка_1,17,15)+"<ГС1>"+Сред(Марка_1,32,6)+"<ГС1>"+Сред(Марка_1,39);
											Марка_1=СтрЗаменить(Марка_1,"<ГС1>",Символ(29));
											Марка_1=КодироватьСтроку(Марка_1,СпособКодированияСтроки.КодировкаURL);
											
										Иначе
											Марка_1=СтрЗаменить(Марка_1,"<ГС1>",Символ(29));
					                        Марка_1=КодироватьСтроку(Марка_1,СпособКодированияСтроки.КодировкаURL);
											
										КонецЕсли;
										
										Добав=Объект.Марки.Добавить();
										Добав.Марка=Марка;
										Добав.ДлиннаяМарка=Марка_1;
										Добав.Нет=Ложь;
									
									Исключение
										Сообщить("Сканируемая cis "+марка+" имеет не правильный формат");
									КонецПопытки;
								КонецЕсли;
								
								
						
						
						Возврат;
					КонецЕсли;
					
					
					
					
					
					Если СтрдЛина(Марка)<>18 Тогда
								ИскатьПоСтрочно=Ложь;
					//	ШтрихКод=СтрЗаменить(Марка_1,"<ГС1>","");
					//	ШтрихКод_1=(ШтрихКод);
					
					//ШтрихКод_1=КодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
					//штрихКод=СтрЗаменить(ШтрихКод_1,"%1D","");
					
					Если Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Фото" Тогда
						ШтрихКод=Сред(ШтрихКод,1,38);
					
					ИначеЕсли Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование<>"Табак"
						И Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование<>"Альтернативный табак" ТОгда 
						ШтрихКод=Сред(ШтрихКод,1,38);
					//штрихКод_1=РаскодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
						Если Сред(штрихКод_1,32,3)<>"240" Тогда
												ШтрихКод=Сред(ШтрихКод,1,31);
												//ШтрихКод=Сред(штрихКод_1,1,Найти(штрихКод_1,"%1D")-1);
												//ШтрихКод=РаскодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
											Иначе
												
												           ШтрихКод=штрихКод_1;
											
														   
													   КонецЕсли;
												   Иначе
													   				ИскатьПоСтрочно=Истина;

					КонецЕсли;
					ДД=Новый Массив;
				ДД.Очистить();
					Если СтрДлина(ШтрихКод)>50 Тогда
						ШтрихКод=Сред(ШтрихКод,1,35);
						//ИскатьПоСтрочно=Истина;
					КонецЕсли;
					
					Марка=ШтрихКод;
											Попытка
											GTIN=Сред(ШтрихКод,3,14)
											//Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",
											//Число(Сред(ШтрихКод,3,14)));
										Исключение
										КонецПопытки;  
					Если Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Фармацевтика" Тогда
						Если Сред(Марка,1,2)="01" Тогда
							Марка=Сред(Марка,3,14)+Сред(Марка,19);
						КонецЕсли;
						
					КонецЕсли;
					
					
				Иначе
					Марка=Марка_1;
					   КонецЕсли;
					
					МаркаЕсть=Объект.Марки.НайтиСтроки(Новый Структура("Марка",Марка));
					Если МаркаЕсть.Количество()>0 Тогда
						Сообщить("cis "+марка+" уже отсканировали");
						Возврат;
					КонецЕслИ;
					Если СтрдЛина(Марка)=18 Тогда
						Попытка
							Ч=ЧИсло(Марка);
							Нашли=Ложь;
							
							ДД=новый Массив;
							ДД.Очистить();
							//Если ИскатьПоСтрочно=Истина Тогда
							//	Для Каждого Стр_1 Из Объект.СерийныеНомера Цикл
							//		Если Найти(Стр_1.cis,Марка)=1 Тогда
							//			Нашли=Истина;
							//			
							//			Прервать;
							//		КонецЕсли;
							//	Конеццикла;
							//	
							//	
							//	
							//Иначе
								
							ДД=Объект.СерийныеНомера.НайтиСтроки(Новый Структура("cis",Марка));
							Если ДД.Количество()>0 	 Тогда
								идентификатор3=ДД[0].Получитьидентификатор();
							КонецЕсли;
								
								
							//КонецЕсли;
							Добав=Объект.Марки.Добавить();
							Добав.Марка=Марка;
							Колстрок=1;
							Если Нашли=Ложь И ДД.Количество()=0 Тогда
								
								ДД=Новый Массив;
								ДД.Очистить();
								//Если ИскатьПоСтрочно=Истина Тогда
								//	Нашли=Ложь;
								//	Для Каждого Стр_1 Из Объект.Короба Цикл
								//		Если Найти(Стр_1.ШтрихКод,Марка)=1 Тогда
								//			Нашли=Истина;
								//			Прервать;
								//		КонецЕсли;
								//	Конеццикла;
								//	Если Нашли=Ложь Тогда
								//		Добав.НаименованиеТовара="НЕ ПОЛУЧАЛИ";
								//		Добав.Нет=Истина;
								//		
								//	КонецЕсли;
								//	
								//	
								//Иначе
									НайтиВдругомМесте=Объект.Короба.НайтиСтроки(Новый Структура("Штрихкод",Марка));
									Если НайтиВдругомМесте.Количество()=0 Тогда
										Добав.НаименованиеТовара="НЕ ПОЛУЧАЛИ";
										Добав.Нет=Истина;
									Иначе
										    ////Короб в сотсаве друогого короба
									
										КонецЕслИ;
								//КонецЕсли;
							Иначе
								Добав.НаименованиеТовара=ДД[0].НаименованиеТовараСтрокой;
								Добав.Продукция=ДД[0].НаименованиеТовара;
								Колстрок=ДД[0].КоличествоКМ;
							КонецЕслИ;
							
							ДД=Объект.ПроверкаПростая.НайтиСтроки(Новый Структура("GTINНаименованиеТовара",Добав.НаименованиеТовара));
							Если ДД.Количество()=0 И ЗначениеЗАполнено(Добав.Продукция) Тогда
								ДД=Объект.ПроверкаПростая.НайтиСтроки(Новый Структура("Продукция",Добав.Продукция));
							Конецесли;
							//Колстрок_1=Объект.СерийныеНомера.НайтиСтроки(Новый Структура("cis",Марка));
							//Если 
							Если    Колстрок=0 Тогда
								Колстрок=1;
							КонецЕсли;
							
							Если ДД.Количество()=0 Тогда
								Добав_пр=Объект.ПроверкаПростая.Добавить();
								Добав_пр.GTINНаименованиеТовара=Добав.НаименованиеТовара;
								Добав_пр.КоличествоСканированных=1;
								Идентификатор4=Добав_пр.Получитьидентификатор();
							Иначе
								ДД[0].КоличествоСканированных=ДД[0].КоличествоСканированных+1;
								Идентификатор4=ДД[0].Получитьидентификатор();
							КонецЕсли;
						Исключение
					 		Сообщить("Сканируемая cis "+марка+" имеет не правильный формат");
							
						КонецПопытки;
					Иначе
						Попытка	
							Если Найти(Марка_1,"<ГС1>")=0 Тогда
								
								Марка_1=Сред(Марка_1,1,16)
								+Сред(Марка_1,17,15)+"<ГС1>"+Сред(Марка_1,32,6)+"<ГС1>"+Сред(Марка_1,39);
								Марка_1=СтрЗаменить(Марка_1,"<ГС1>",Символ(29));
								Марка_1=КодироватьСтроку(Марка_1,СпособКодированияСтроки.КодировкаURL);
								
							Иначе
								Марка_1=СтрЗаменить(Марка_1,"<ГС1>",Символ(29));
					            Марка_1=КодироватьСтроку(Марка_1,СпособКодированияСтроки.КодировкаURL);
							КонецЕсли;
							
						Добав=Объект.Марки.Добавить();
						Добав.Марка=Марка;
						Добав.ДлиннаяМарка=Марка_1;
						Добав.Нет=Ложь;
						
						СпрП=Неопределено;
						
							Нашли=Ложь;
							
							ДД=Новый Массив;
							ДД.Очистить();
							Если ИскатьПоСтрочно=Истина Тогда
								Для Каждого Стр_1 Из Объект.СерийныеНомера Цикл
									Если Найти(Стр_1.cis,Марка)=1 
										ИЛИ Найти(Марка,Стр_1.cis)=1 
										Тогда
										Нашли=Истина;
										Идентификатор3=Стр_1.ПолучитьИдентификатор();
										Прервать;
									КонецЕсли;
								Конеццикла;
								
								
								
							Иначе
								
								ДД=Объект.СерийныеНомера.НайтиСтроки(Новый Структура("cis",Марка));
								Если ДД.Количество()>0 Тогда
									Идентификатор3=ДД[0].ПолучитьИдентификатор();
								КонецЕсли;
								
							КонецЕсли;

							
							
						//
						//ДД=Объект.СерийныеНомера.НайтиСтроки(Новый Структура("cis",Марка));
						Если Нашли=Ложь И ДД.Количество()=0 Тогда
							GTIN="НЕ ПОЛУЧАЛИ";
							
							ДД=Новый Массив;
				ДД.Очистить();
											Если ИскатьПоСтрочно=Истина Тогда
									Нашли=Ложь;
									Для Каждого Стр_1 Из Объект.Короба Цикл
										Если Найти(Стр_1.ШтрихКод,Марка)=1 
											ИЛИ Найти(Марка,Стр_1.ШтрихКод)=1 
											Тогда
											Нашли=Истина;
											Прервать;
										КонецЕсли;
									Конеццикла;
									Если Нашли=Ложь Тогда
										Добав.Нет=Истина;
										
									КонецЕсли;
									
									
								Иначе
										НайтиВдругомМесте=Объект.Короба.НайтиСтроки(Новый Структура("ШтрихКод",Марка));
										Если НайтиВдругомМесте.Количество()=0 Тогда
										//	GTIN="НЕ ПОЛУЧАЛИ";
											Добав.Нет=Истина;
										//Иначе
											//GTIN=Сред(Марка,3,14);
											//НомерКороба=НайтиВдругомМесте[0].НомерКороба;
											//Нстроку=Объект.СерийныеНомера.НайтиСтроки(Новый Структура("cis",НомерКороба));
											//Если Нстроку.Количество()>0 Тогда
											//	GTIN=Нстроку[0].НаименованиеТовараСтрокой;
											//КонецЕслИ;
											
										КонецЕслИ;
									КонецЕсли;
						КонецЕсли;	
						//Иначе         
						//Если GTIN="НЕ ПОЛУЧАЛИ" Тогда
						//	Добав.Нет=Истина;
						//КонецЕсли;
						
						//Добав.Продукция=СпрП;
						ДД=Объект.ПроверкаПростая.НайтиСтроки(Новый Структура("GTINНаименованиеТовара",GTIN));
						//	Если ДД.Количество()=0 И ЗначениеЗАполнено(Добав.Продукция) Тогда
						//		ДД=Объект.ПроверкаПростая.НайтиСтроки(Новый Структура("Продукция",Добав.Продукция));
						//	Конецесли;
						
						
						Если ДД.Количество()=0 Тогда
				//GTIN		="НЕ ПОЛУЧАЛИ";
							Добав.GTIN="НЕ ПОЛУЧАЛИ";
						ДД=Объект.ПроверкаПростая.НайтиСтроки(Новый Структура("GTINНаименованиеТовара",Добав.GTIN));
						Если ДД.Количество()=0 Тогда
							Добав_пр=Объект.ПроверкаПростая.Добавить();
							Добав_пр.GTINНаименованиеТовара="НЕ ПОЛУЧАЛИ";
							Добав_пр.КоличествоСканированных=1;
							Добав_Пр.Продукция=СпрП;
							Идентификатор4=Добав_Пр.ПолучитьИдентификатор();
						Иначе
							Идентификатор4=ДД[0].ПолучитьИдентификатор();
							
							ДД[0].КоличествоСканированных=ДД[0].КоличествоСканированных+1;
							//Добав.GTIN=gtin;

							КонецЕсли;
						Иначе
							Идентификатор4=ДД[0].ПолучитьИдентификатор();
							ДД[0].КоличествоСканированных=ДД[0].КоличествоСканированных+1;
										Добав.GTIN=GTIN;

									КонецЕсли;
									
									
						Если Добав.Нет=Ложь Тогда
							Если Сред(Марка,1,2)="01" Тогда
								GTIN=Сред(Марка,3,14);
							Иначе
								GTIN=Сред(Марка,1,14);
								
							КонецЕсли;
						КонецЕсли;
						//СпрП =справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",Число(gtin));
									
						ДД=Объект.ПроверкаПоНомерамКМ.НайтиСтроки(Новый Структура("GTINНаименованиеТовара",GTIN));
						Если ДД.Количество()=0 Тогда
				GTIN		="НЕ ПОЛУЧАЛИ";
							Добав.GTIN="НЕ ПОЛУЧАЛИ";
							Добав.Нет=Истина;
						ДД=Объект.ПроверкаПоНомерамКМ.НайтиСтроки(Новый Структура("GTINНаименованиеТовара",GTIN));
						Если ДД.Количество()=0 Тогда
							Добав_пр=Объект.ПроверкаПоНомерамКМ.Добавить();
							Добав_пр.GTINНаименованиеТовара="НЕ ПОЛУЧАЛИ";
							Добав_пр.КоличествоСканированных=1;
							Добав_Пр.Продукция=СпрП;
							
							
							Идентификатор2=Добав_пр.ПолучитьИдентификатор();
						Иначе
							Идентификатор2=ДД[0].ПолучитьИдентификатор();
							
							ДД[0].КоличествоСканированных=ДД[0].КоличествоСканированных+1;
							//Добав.GTIN=gtin;

							КонецЕсли;
						Иначе
							Идентификатор2=ДД[0].ПолучитьИдентификатор();
							ДД[0].КоличествоСканированных=ДД[0].КоличествоСканированных+1;
										Добав.GTIN=GTIN;

									КонецЕсли;
						Исключение
						Сообщить("Сканируемая cis "+марка+" имеет не правильный формат");
					КонецПопытки;
					КонецЕсли;
					
												
						Если Идентификатор1=Неопределено Тогда
								Нстр=Объект.СерийныеНомера.НайтиСтроки(Новый Структура("cis",Марка));
								
								Если НСтр.Количество()>0  Тогда
									Товар=Объект.Товары.НайтиСтроки(Новый Структура("НомерСтрокиСвязи",Нстр[0].НомерСтрокиСвязи));
									Если Товар.Количество()>0 Тогда
										Идентификатор1=Товар[0].ПолучитьИдентификатор();
									КонецЕсли;
								КонецЕсли;
							
						КонецЕсли;
						
						
						
						
						
						
						
						
						
						
						
						
						///////////////////
						
						
		
	Иначе
						
						
						
		
		
	
						Если СтрДлина(Марка_1)=20 Тогда
							Марка_1=СтрЗаменить(Марка_1,"<ГС1>","");
							Марка_1=Сред(Марка_1,3);
						КонецЕсли;
					ШтрихКод_1=(Марка_1);
					ШтрихКод=ШтрихКод_1;
						
						Марка=Марка_1; 

					
					Если Объект.ОбратныйАкцепт=Истина тогда
								Если СтрдЛина(Марка)<>18 Тогда
								
								//ШтрихКод_1=КодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
								//штрихКод=СтрЗаменить(ШтрихКод_1,"%1D","");
								ШтрихКод=Сред(ШтрихКод,1,38);
								//штрихКод_1=РаскодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
									Если Сред(штрихКод_1,32,3)<>"240" Тогда
															ШтрихКод=Сред(ШтрихКод,1,31);
															//ШтрихКод=Сред(штрихКод_1,1,Найти(штрихКод_1,"%1D")-1);
															//ШтрихКод=РаскодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
														Иначе
															
															           ШтрихКод=штрихКод_1;
														
														КонецЕсли;
														
														Марка=ШтрихКод;
														Попытка
														GTIN=Сред(ШтрихКод,3,14)
														//Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",
														//Число(Сред(ШтрихКод,3,14)));
													Исключение
													КонецПопытки;  
								Если Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Фармацевтика" Тогда
									Если Сред(Марка,1,2)="01" Тогда
										Марка=Сред(Марка,3,14)+Сред(Марка,19);
									КонецЕсли;
									
								КонецЕсли;
								
							Иначе
								Марка=Марка_1;
								   КонецЕсли;
								
								МаркаЕсть=Объект.Марки.НайтиСтроки(Новый Структура("Марка",Марка));
								Если МаркаЕсть.Количество()>0 Тогда
									Сообщить("cis "+марка+" уже отсканировали");
									Возврат;
								КонецЕслИ;
								Если СтрдЛина(Марка)=18 Тогда
									Попытка
										Ч=ЧИсло(Марка);
										ДД=Объект.СерийныеНомера.НайтиСтроки(Новый Структура("cis",Марка));
										Добав=Объект.Марки.Добавить();
										Добав.Марка=Марка;
										Колстрок=1;
										//Если ДД.Количество()=0 Тогда
										//	
										//	НайтиВдругомМесте=Объект.Короба.НайтиСтроки(Новый Структура("Штрихкод",Марка));
										//	Если НайтиВдругомМесте.Количество()=0 Тогда
										//		Добав.НаименованиеТовара="НЕ ПОЛУЧАЛИ";
										//		Добав.Нет=Истина;
										//	Иначе
										//		    ////Короб в сотсаве друогого короба
										//		
										//	КонецЕслИ;
										//Иначе
										//	Добав.НаименованиеТовара=ДД[0].НаименованиеТовараСтрокой;
										//	Колстрок=ДД[0].КоличествоКМ;
										//КонецЕслИ;
										//
										
									Исключение
								 		Сообщить("Сканируемая cis "+марка+" имеет не правильный формат");
										
									КонецПопытки;
								Иначе
									Попытка	
										Если Найти(Марка_1,"<ГС1>")=0 Тогда
											
											Марка_1=Сред(Марка_1,1,16)
											+Сред(Марка_1,17,15)+"<ГС1>"+Сред(Марка_1,32,6)+"<ГС1>"+Сред(Марка_1,39);
											Марка_1=СтрЗаменить(Марка_1,"<ГС1>",Символ(29));
											Марка_1=КодироватьСтроку(Марка_1,СпособКодированияСтроки.КодировкаURL);
											
										Иначе
											Марка_1=СтрЗаменить(Марка_1,"<ГС1>",Символ(29));
								            Марка_1=КодироватьСтроку(Марка_1,СпособКодированияСтроки.КодировкаURL);
										КонецЕсли;
										
										Добав=Объект.Марки.Добавить();
										Добав.Марка=Марка;
										Добав.ДлиннаяМарка=Марка_1;
										Добав.Нет=Ложь;
									
									Исключение
										Сообщить("Сканируемая cis "+марка+" имеет не правильный формат");
									КонецПопытки;
								КонецЕсли;
								
								
						
						
						Возврат;
					КонецЕсли;
					
					
					
					
					
					Если СтрдЛина(Марка)<>18 Тогда
								ИскатьПоСтрочно=Ложь;
					//	ШтрихКод=СтрЗаменить(Марка_1,"<ГС1>","");
					//	ШтрихКод_1=(ШтрихКод);
					
					//ШтрихКод_1=КодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
					//штрихКод=СтрЗаменить(ШтрихКод_1,"%1D","");
					Если Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Фото" Тогда
						ШтрихКод=Сред(ШтрихКод,1,38);
						
					ИначеЕсли Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование<>"Табак"
						И Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование<>"Альтернативный табак" ТОгда 
						ШтрихКод=Сред(ШтрихКод,1,38);
					//штрихКод_1=РаскодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
						Если Сред(штрихКод_1,32,3)<>"240" Тогда
												ШтрихКод=Сред(ШтрихКод,1,31);
												//ШтрихКод=Сред(штрихКод_1,1,Найти(штрихКод_1,"%1D")-1);
												//ШтрихКод=РаскодироватьСтроку(ШтрихКод,СпособКодированияСтроки.КодировкаURL);
											Иначе
												
												           ШтрихКод=штрихКод_1;
											
														   
													   КонецЕсли;
												   Иначе
													   				ИскатьПоСтрочно=Истина;

					КонецЕсли;
					ДД=Новый Массив;
				ДД.Очистить();
					Если СтрДлина(ШтрихКод)>50 Тогда
						ШтрихКод=Сред(ШтрихКод,1,35);
						//ИскатьПоСтрочно=Истина;
					КонецЕсли;
					
					Марка=ШтрихКод;
											Попытка
											GTIN=Сред(ШтрихКод,3,14)
											//Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",
											//Число(Сред(ШтрихКод,3,14)));
										Исключение
										КонецПопытки;  
					Если Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Фармацевтика" Тогда
						Если Сред(Марка,1,2)="01" Тогда
							Марка=Сред(Марка,3,14)+Сред(Марка,19);
						КонецЕсли;
						
					КонецЕсли;
					
					
				Иначе
					Марка=Марка_1;
					   КонецЕсли;
					
					МаркаЕсть=Объект.Марки.НайтиСтроки(Новый Структура("Марка",Марка));
					Если МаркаЕсть.Количество()>0 Тогда
						Сообщить("cis "+марка+" уже отсканировали");
						Возврат;
					КонецЕслИ;
					Если СтрдЛина(Марка)=18 Тогда
						Попытка
							//Ч=ЧИсло(Марка);
							Нашли=Ложь;
							
							ДД=новый Массив;
							ДД.Очистить();
							//Если ИскатьПоСтрочно=Истина Тогда
							//	Для Каждого Стр_1 Из Объект.СерийныеНомера Цикл
							//		Если Найти(Стр_1.cis,Марка)=1 Тогда
							//			Нашли=Истина;
							//			
							//			Прервать;
							//		КонецЕсли;
							//	Конеццикла;
							//	
							//	
							//	
							//Иначе
								
								ДД=Объект.СерийныеНомера.НайтиСтроки(Новый Структура("cis",Марка));
							//КонецЕсли;
							Добав=Объект.Марки.Добавить();
							Добав.Марка=Марка;
							Колстрок=1;
							Если Нашли=Ложь И ДД.Количество()=0 Тогда
								
								ДД=Новый Массив;
								ДД.Очистить();
								//Если ИскатьПоСтрочно=Истина Тогда
								//	Нашли=Ложь;
								//	Для Каждого Стр_1 Из Объект.Короба Цикл
								//		Если Найти(Стр_1.ШтрихКод,Марка)=1 Тогда
								//			Нашли=Истина;
								//			Прервать;
								//		КонецЕсли;
								//	Конеццикла;
								//	Если Нашли=Ложь Тогда
								//		Добав.НаименованиеТовара="НЕ ПОЛУЧАЛИ";
								//		Добав.Нет=Истина;
								//		
								//	КонецЕсли;
								//	
								//	
								//Иначе
									НайтиВдругомМесте=Объект.Короба.НайтиСтроки(Новый Структура("Штрихкод",Марка));
									Если НайтиВдругомМесте.Количество()=0 Тогда
										Добав.НаименованиеТовара="НЕ ПОЛУЧАЛИ";
										Добав.Нет=Истина;
									Иначе
										    ////Короб в сотсаве друогого короба
									
										КонецЕслИ;
								//КонецЕсли;
							Иначе
								Добав.НаименованиеТовара=ДД[0].НаименованиеТовараСтрокой;
								Добав.Продукция=ДД[0].НаименованиеТовара;
								Колстрок=ДД[0].КоличествоКМ;
							КонецЕслИ;
							
							ДД=Объект.ПроверкаПростая.НайтиСтроки(Новый Структура("GTINНаименованиеТовара",Добав.НаименованиеТовара));
							Если ДД.Количество()=0 И ЗначениеЗАполнено(Добав.Продукция) Тогда
								ДД=Объект.ПроверкаПростая.НайтиСтроки(Новый Структура("Продукция",Добав.Продукция));
							Конецесли;
							//Колстрок_1=Объект.СерийныеНомера.НайтиСтроки(Новый Структура("cis",Марка));
							//Если 
							Если    Колстрок=0 Тогда
								Колстрок=1;
							КонецЕсли;
							
							Если ДД.Количество()=0 Тогда
								Добав_пр=Объект.ПроверкаПростая.Добавить();
								Добав_пр.GTINНаименованиеТовара=Добав.НаименованиеТовара;
								Добав_пр.КоличествоСканированных=1;
							Иначе
								ДД[0].КоличествоСканированных=ДД[0].КоличествоСканированных+1;
							КонецЕсли;
						Исключение
					 		Сообщить("Сканируемая cis "+марка+" имеет не правильный формат");
							
						КонецПопытки;
					Иначе
						Попытка	
							Если Найти(Марка_1,"<ГС1>")=0 Тогда
								
								Марка_1=Сред(Марка_1,1,16)
								+Сред(Марка_1,17,15)+"<ГС1>"+Сред(Марка_1,32,6)+"<ГС1>"+Сред(Марка_1,39);
								Марка_1=СтрЗаменить(Марка_1,"<ГС1>",Символ(29));
								Марка_1=КодироватьСтроку(Марка_1,СпособКодированияСтроки.КодировкаURL);
							Иначе
								Марка_1=СтрЗаменить(Марка_1,"<ГС1>",Символ(29));
					            Марка_1=КодироватьСтроку(Марка_1,СпособКодированияСтроки.КодировкаURL);
								
							КонецЕсли;
							
						Добав=Объект.Марки.Добавить();
						Добав.Марка=Марка;
						Добав.ДлиннаяМарка=Марка_1;
						Добав.Нет=Ложь;
						
						СпрП=Неопределено;
						
							Нашли=Ложь;
							
							ДД=Новый Массив;
							ДД.Очистить();
							Если ИскатьПоСтрочно=Истина Тогда
								Для Каждого Стр_1 Из Объект.СерийныеНомера Цикл
									Если Найти(Стр_1.cis,Марка)=1 
										ИЛИ Найти(Марка,Стр_1.cis)=1 
										Тогда
										Нашли=Истина;
										Прервать;
									КонецЕсли;
								Конеццикла;
								
								
								
							Иначе
								
								ДД=Объект.СерийныеНомера.НайтиСтроки(Новый Структура("cis",Марка));
							КонецЕсли;

						//
						//ДД=Объект.СерийныеНомера.НайтиСтроки(Новый Структура("cis",Марка));
						Если Нашли=Ложь И ДД.Количество()=0 Тогда
							GTIN="НЕ ПОЛУЧАЛИ";
							
							ДД=Новый Массив;
				ДД.Очистить();
											Если ИскатьПоСтрочно=Истина Тогда
									Нашли=Ложь;
									Для Каждого Стр_1 Из Объект.Короба Цикл
										Если Найти(Стр_1.ШтрихКод,Марка)=1 
											ИЛИ Найти(Марка,Стр_1.ШтрихКод)=1 
											Тогда
											Нашли=Истина;
											Прервать;
										КонецЕсли;
									Конеццикла;
									Если Нашли=Ложь Тогда
										Добав.Нет=Истина;
										
									КонецЕсли;
									
									
								Иначе
										НайтиВдругомМесте=Объект.Короба.НайтиСтроки(Новый Структура("ШтрихКод",Марка));
										Если НайтиВдругомМесте.Количество()=0 Тогда
										//	GTIN="НЕ ПОЛУЧАЛИ";
											Добав.Нет=Истина;
										//Иначе
											//GTIN=Сред(Марка,3,14);
											//НомерКороба=НайтиВдругомМесте[0].НомерКороба;
											//Нстроку=Объект.СерийныеНомера.НайтиСтроки(Новый Структура("cis",НомерКороба));
											//Если Нстроку.Количество()>0 Тогда
											//	GTIN=Нстроку[0].НаименованиеТовараСтрокой;
											//КонецЕслИ;
											
										КонецЕслИ;
									КонецЕсли;
						КонецЕсли;	
						//Иначе         
						//Если GTIN="НЕ ПОЛУЧАЛИ" Тогда
						//	Добав.Нет=Истина;
						//КонецЕсли;
						
						//Добав.Продукция=СпрП;
									
						Если Добав.Нет=Ложь Тогда
							Если Сред(Марка,1,2)="01" Тогда
								GTIN=Сред(Марка,3,14);
							Иначе
								GTIN=Сред(Марка,1,14);
								
							КонецЕсли;
						КонецЕсли;

						ДД=Объект.ПроверкаПростая.НайтиСтроки(Новый Структура("GTINНаименованиеТовара",GTIN));
						
						
						
						Если ДД.Количество()=0 Тогда
				//GTIN		="НЕ ПОЛУЧАЛИ";
							Добав.GTIN="НЕ ПОЛУЧАЛИ";
						ДД=Объект.ПроверкаПростая.НайтиСтроки(Новый Структура("GTINНаименованиеТовара",Добав.GTIN));
						Если ДД.Количество()=0 Тогда
							Добав_пр=Объект.ПроверкаПростая.Добавить();
							Добав_пр.GTINНаименованиеТовара="НЕ ПОЛУЧАЛИ";
							Добав_пр.КоличествоСканированных=1;
							Добав_Пр.Продукция=СпрП;
						Иначе
							
							ДД[0].КоличествоСканированных=ДД[0].КоличествоСканированных+1;
							//Добав.GTIN=gtin;

							КонецЕсли;
						Иначе
							ДД[0].КоличествоСканированных=ДД[0].КоличествоСканированных+1;
										Добав.GTIN=GTIN;

									КонецЕсли;
									
												//СпрП =справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",Число(gtin));
									
						ДД=Объект.ПроверкаПоНомерамКМ.НайтиСтроки(Новый Структура("GTINНаименованиеТовара",GTIN));
						Если ДД.Количество()=0 Тогда
				GTIN		="НЕ ПОЛУЧАЛИ";
							Добав.GTIN="НЕ ПОЛУЧАЛИ";
							Добав.Нет=Истина;
						ДД=Объект.ПроверкаПоНомерамКМ.НайтиСтроки(Новый Структура("GTINНаименованиеТовара",GTIN));
						Если ДД.Количество()=0 Тогда
							Добав_пр=Объект.ПроверкаПоНомерамКМ.Добавить();
							Добав_пр.GTINНаименованиеТовара="НЕ ПОЛУЧАЛИ";
							Добав_пр.КоличествоСканированных=1;
							Добав_Пр.Продукция=СпрП;
							
							
						Иначе
							
							ДД[0].КоличествоСканированных=ДД[0].КоличествоСканированных+1;
							//Добав.GTIN=gtin;

							КонецЕсли;
						Иначе
							ДД[0].КоличествоСканированных=ДД[0].КоличествоСканированных+1;
										Добав.GTIN=GTIN;

									КонецЕсли;
						Исключение
						Сообщить("Сканируемая cis "+марка+" имеет не правильный формат");
					КонецПопытки;
					КонецЕсли;
					
	КонецЕсли;
КонецПроцедуры

