
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Вставить содержимое обработчика.
	Отказ=Истина;
	ОткрытьФорму("Справочник.ВнешниеОбработки_ХамелеонЦРПТ.Форма.ФормаЭлемента",
	Новый Структура("Тип",ТипДанных));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Если НЕ Параметры.Свойство("Тип",ТипДанных) Тогда
		Отказ=Истина;
		Возврат;
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("Наименование",ТипДанных);
КонецПроцедуры
