
&НаСервере
Процедура Команда1НаСервере()
	// Вставить содержимое обработчика.
	
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВводВОборот_ХамелеонЦРПТСерийныеНомера.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВводВОборот_ХамелеонЦРПТ КАК ВводВОборот_ХамелеонЦРПТСерийныеНомера
		|ГДЕ
		|	ВводВОборот_ХамелеонЦРПТСерийныеНомера.Проведен
		|	И ВводВОборот_ХамелеонЦРПТСерийныеНомера.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыДокументов_ХамелеонЦРПТ.Отправлен);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	ДокумВВобВоборот=Документы.ВводВОборот_ХамелеонЦРПТ.СоздатьДокумент();
	ТаблицаЗн=Новый ТаблицаЗначений;
	ТаблицаЗн.Колонки.Добавить("ВводВОборот");
	ТаблицаЗн.Колонки.Добавить("НомерДекларацииТовара");
	ТаблицаЗн.Колонки.Добавить("ДатаДекларацииТовара");
	ТаблицаЗн.Колонки.Добавить("ТипДокумента");
	ТаблицаЗн.Колонки.Добавить("ДатаПроизводства");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		
		
	//	Сообщить(ВыборкаДетальныеЗаписи.Ссылка);
	//	Продолжить;
		
		Для Каждого Стр_1 Из   ВыборкаДетальныеЗаписи.Ссылка.СерийныеНомера Цикл

			Если СтрДлина(Стр_1.cis)>18 Тогда
				
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СозданиеНовогоШкНаКороба_ХамелеонЦРПТМарки.Ссылка.НомерКороба КАК НомерКороба
		|ИЗ
		|	Документ.СозданиеНовогоШкНаКороба_ХамелеонЦРПТ.Марки КАК СозданиеНовогоШкНаКороба_ХамелеонЦРПТМарки
		|ГДЕ
		|	ПОДСТРОКА(СозданиеНовогоШкНаКороба_ХамелеонЦРПТМарки.cis, 1, 1000) = &cis
		|	И СозданиеНовогоШкНаКороба_ХамелеонЦРПТМарки.Ссылка.Статус = &Статус
		|	И СозданиеНовогоШкНаКороба_ХамелеонЦРПТМарки.Ссылка.ТипДокумента = &ТипДокумента";
	
	Запрос.УстановитьПараметр("cis", Стр_1.cis);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыДокументов_ХамелеонЦРПТ.Обработан);
	Запрос.УстановитьПараметр("ТипДокумента", Перечисления.ВидДокументаУпаковок_ХамелеонЦРПТ.Формирование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	ВыборкаДетальныеЗаписи_2 = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи_2.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		ССылк=ВыборкаДетальныеЗаписи.Ссылка;
		СтруктураПоиска=Новый Структура("НомерДекларацииТовара,ДатаДекларацииТовара,ТипДокумента,ДатаПроизводства");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска,ССылк);
		Нстр=ТаблицаЗн.НайтиСтроки(СтруктураПоиска);
		Если Нстр.Количество()>0 Тогда
			ВводВ=Нстр[0].ВводВОборот;
		Иначе
			ВводВ=Документы.ВводВОборот_ХамелеонЦРПТ.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(ВводВ,Ссылк,,"Дата,Номер,Статус,ОшибкаОтправки,_Order_ID");
			ВводВ.Дата=ТекущаяДата();
			ВводВ.Комментарий="Созданы по агрегациям";
			
			НСтр=ТаблицаЗн.Добавить();
			ЗаполнитьЗначенияСвойств(НСтр,ВВодВ);
			НСтр.ВводВОборот=ВводВ;
		КонецЕслИ;
		
		Если ВводВ.СерийныеНомера.Найти(ВыборкаДетальныеЗаписи_2.НомерКороба,"cis")=Неопределено Тогда
			
			Добав=ВводВ.СерийныеНомера.Добавить();
			ЗаполнитьЗначенияСвойств(Добав,Стр_1,,"НомерКороба,НомерСтрокиСвязи");
			Добав.cis=ВыборкаДетальныеЗаписи_2.НомерКороба;
			
			НстрокаТовара=Ссылк.Товары.Найти(Стр_1.НомерСтрокиСвязи,"НомерСтрокиСвязи");
			Структ=Новый Структура("GTIN,КодТНВЭД,ДекларацияИлиСертификатСоответствия");
			Если         НстрокаТовара<>Неопределено Тогда
				
				ЗаполнитьЗначенияСвойств(Структ,НстрокаТовара);
				
				СтрокуВВ=ВводВ.Товары.НайтиСтроки(Структ);
				Если    СтрокуВВ.Количество()=0 Тогда
					Добав_СтрТ=ВводВ.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(Добав_СтрТ,Структ);
					Добав_СтрТ.КоличествоКМ=1;
					Добав_СтрТ.НомерСтрокиСвязи=Добав_СтрТ.НомерСтроки;
					Добав.НомерСтрокиСвязи=					Добав_СтрТ.НомерСтрокиСвязи;
					
				Иначе
					СтрокуВВ[0].КоличествоКМ=СтрокуВВ[0].КоличествоКМ+1;
					Добав.НомерСтрокиСвязи=СтрокуВВ[0].НомерСтрокиСвязи;
					
				КонецЕсли;
				
			Иначе
				Добав_Т=ВводВ.Товары.Добавить();
				Добав_Т.НомерСтрокиСвязи=Добав_Т.НомерСтроки;
				Добав.НомерСтрокиСвязи=Добав_Т.НомерСтрокиСвязи;
				
				
			КонецЕсли;
			
			
		КонецЕсли;
		
		Прервать
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				
			КонецЕслИ;
				
			
		Конеццикла;
		
		
	КонецЦикла;
	

	Для Каждого Стр_1 из ТаблицаЗн Цикл
		       Стр_1.ВводВОборот.Записать();
			   СообщитЬ(Стр_1.ВводВОборот.Ссылка);
			//   Возврат;
	Конеццикла;
	
	
КонецПроцедуры


&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры
