
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого Сообщение Из Параметры.Сообщения Цикл
		ЗаполнитьЗначенияСвойств(Сообщения.Добавить(), Сообщение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТД = Элемент.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТД.КлючДанных) Тогда
		Форма = ТД.КлючДанных.ПолучитьФорму();
		Форма.Открыть();
		ТекЭл = Форма.Элементы.Найти(ТД.Поле);
		Если ТекЭл <> Неопределено Тогда
			ТекЭл.АвтоОтметкаНезаполненного = Истина;
			ТекЭл.Подсказка = ТД.Текст;
			ТекЭл.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
			Форма.ТекущийЭлемент = ТекЭл;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
