
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Если Константы.РежимРаботыХамелеонЦРПТ.Получить()=2 Тогда
		Элементы.Гиперссылка.Заголовок="https://integration.taxcom.ru"
	Иначе
		Элементы.Гиперссылка.Заголовок="https://lk.taxcom.ru/"
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ГиперссылкаНажатие(Элемент)
	НачатьЗапускПриложения(Новый ОписаниеОповещения("ПослеВ",Этаформа), Элементы.Гиперссылка.Заголовок);
КонецПроцедуры


&НаКлиенте
Процедура ПослеВ(РР,ДД) Экспорт
	
КонецПроцедуры