// <Описание процедуры>
//
Процедура МВ_СформироватьВВодВОборотОКТО() Экспорт
	
	РегламентноеЗадание = Метаданные.РегламентныеЗадания.МВ_СформироватьВВодВОборотОКТО;
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(РегламентноеЗадание);
	СформироватьВВодВОборотОКТО(РегламентноеЗадание);
	
КонецПроцедуры // МВ_СформироватьВВодВОборотОКТО()

Процедура СформироватьВВодВОборотОКТО(РегламентноеЗадание)
		
	Обработка = Обработки.МВ_СформироватьВВодВОборотОКТО.Создать();
	
	ТекстСообщения = Обработка.ЗагрузитьФайлыОКТОНаСервере(РегламентноеЗадание);
КонецПроцедуры
