&НаСервереБезКонтекста
Функция ПолучитьИзПользователя(ТекущийПользователь)
	Возврат Обработки._Запуск_ХамелеонЦРПТ.ПолучитьИзПользователя(ТекущийПользователь);
КонецФункции
&НаСервереБезКонтекста
Функция ПолучитьТокенСрегистра(Thumbprint_1)
	Возврат Регистрысведений.ТокенПоСертификату_ХамелеонЦРПТ.Получить(Новый Структура("Отпечаток",Thumbprint_1)).Токен;
КонецФункции

&НаСервереБезКонтекста
Процедура ОчиститьТокенСрегистра(ТТ)
	ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ЗаписатьТокенВРегистр(ТТ,"")
КонецПроцедуры

//Функция   ЗагрузкаНаСервере(Thumbprint_1,СРегистра,УжеОтправили)
//		Если ЗначениеЗАполнено(Thumbprint_1.АдресПрокси) Тогда
//				Прокси=Новый ИнтернетПрокси;
//				Прокси.Установить("http",Thumbprint_1.АдресПрокси,Thumbprint_1.ПортПрокси,Thumbprint_1.ПользовательПрокси,Thumbprint_1.ПарольПрокси);
//			
//	HTTPСервисЗапрос=Новый HTTPСоединение(Thumbprint_1.АдресКАПИ,,,,Прокси,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
//			Иначе
//	HTTPСервисЗапрос=Новый HTTPСоединение(Thumbprint_1.АдресКАПИ,,,,,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
//			КонецЕсли;
//	
//	HTTPЗапрос=Новый HTTPЗапрос("api/v3/facade/tnved/search?prefix=6401,6402,6403,6404,6405");
//	HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json;charset=UTF-8");
//	HTTPЗапрос.Заголовки.Вставить("Authorization","Bearer "+СРегистра);
//	//HTTPЗапрос.Заголовки.Вставить("Host","ismotp.crptech.ru");
//	///Константин           
//	Ответ=HTTPСервисЗапрос.Получить(HTTPЗапрос);
//	Текст1=Ответ.ПолучитьТелоКакСтроку();
//	
//	
//	Если Ответ.КодСостояния=200 Тогда
//		ЗагрузаемКодыТНВДНАсервере(Текст1);
//		
//		
//	ИначеЕсли Ответ.КодСостояния=401 
//		ИЛИ Ответ.КодСостояния=502  
//		Тогда
//			Если УжеОтправили=Истина Тогда
//				ОчиститьТокенСрегистра(Thumbprint_1.Thumbprint_1)
//			Иначе
//				Возврат Ложь;			
//		КонецЕсли
//	КонецЕсли;
//	Возврат Истина;
//КонецФункции

&НаКлиенте
Процедура Загрузить(Команда)
	
	
	Обр=ПолучитьФорму("Обработка._Запуск_ХамелеонЦРПТ.Форма.Форма");
	Thumbprint_1=ПолучитьИзПользователя(Обр.Пользователь);	
	ОбщиеМетоды_НаКлиенте_ХамелеонЦРПТ.ЗагрузитьКодыТНВЭД(Thumbprint_1);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
							   ОбработкаWEBНаСервере=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ОбработкаWEBНаСервере();

КонецПроцедуры
