
&НаКлиенте
Процедура СоздатьВводВОборотXMLСтандарт(Команда)
	
	Перем Файл;
	ВклЗаг = 0;
	//ДанныеЛиста.Очистить();
	Режим=РежимДиалогаВыбораФайла.Открытие;
	нДиалог= НОвый ДиалогВыбораФайла(Режим);
	//Фильтр="Файл xls/txt/xml|*.xls;*.xlsx;*.txt;*.xml|Файл txt|*.txt|Файл xls|*.xls;*.xlsx|Файл xml|*.xml";
	Фильтр="Файл xml|*.xml";
	нДиалог.МножественныйВыбор=Истина;
	нДиалог.Фильтр=Фильтр;
	нДиалог.Заголовок="Выберите файл для загрузки..." ;
	нДиалог.Показать(Новый ОписаниеОповещения("ПослеВыбораФайла_ВводВОБОРОТ_ХамелеонЦРПТСтандарт",ЭтаФорма,Ложь));
	
		

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла_ВводВОБОРОТ_ХамелеонЦРПТСтандарт(РР,ДД) Экспорт
	МассивАгрегация=Новый Массив;
	МассивАгрегация.Очистить();
	Если РР<>Неопределено тогда
		Для Каждого Стр_Ф Из РР Цикл
			
			ДвоичнДанные=Новый ДвоичныеДанные(Стр_Ф);
			создатьАгрегацииПоФайлуСтандарт(ДвоичнДанные,МассивАгрегация);
			
		Конеццикла;
		
		Если дД=Истина Тогда
			
			Для Каждого Стр_1 Из МассивАгрегация Цикл
				Форм=ПолучитьФорму("Документ.ВводВОборот_ХамелеонЦРПТ.Форма.ФормаДокумента",Новый Структура(
				"Ключ",Стр_1));
				Форм.ОтправитьЗаявку(ДД);
				
			Конеццикла;
			
		КонецЕслИ;
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

Процедура создатьАгрегацииПоФайлуСтандарт(ДвоичнДанные,МассивАгрегация)
	
	ОбщийМодуль_НаСервере_ХамелеонЦРПТ.СоздатьВводВОборотПоФайлуСтандарт(ДвоичнДанные,МассивАгрегация);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьВводВОборотJSON(Команда)
		// Вставить содержимое обработчика.

	Перем Файл;
	ВклЗаг = 0;
	//ДанныеЛиста.Очистить();
	Режим=РежимДиалогаВыбораФайла.Открытие;
	нДиалог= НОвый ДиалогВыбораФайла(Режим);
	//Фильтр="Файл xls/txt/xml|*.xls;*.xlsx;*.txt;*.xml|Файл txt|*.txt|Файл xls|*.xls;*.xlsx|Файл xml|*.xml";
	Фильтр="Файл *|*.*";
	нДиалог.МножественныйВыбор=Истина;
	нДиалог.Фильтр=Фильтр;
	нДиалог.Заголовок="Выберите файл для загрузки..." ;
	нДиалог.Показать(Новый ОписаниеОповещения("ПослеВыбораФайла_ВводВОБОРОТ_ХамелеонЦРПТJSON",ЭтаФорма,Ложь));
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла_ВводВОБОРОТ_ХамелеонЦРПТJSON(РР,ДД) Экспорт
	МассивАгрегация=Новый Массив;
	МассивАгрегация.Очистить();
	Если РР<>Неопределено тогда
		Для Каждого Стр_Ф Из РР Цикл
			
			ДвоичнДанные=Новый ДвоичныеДанные(Стр_Ф);
			СоздатьАгрегацииПоФайлуJSON(ДвоичнДанные,МассивАгрегация);
			
		Конеццикла;
		
		Если дД=Истина Тогда
			
			Для Каждого Стр_1 Из МассивАгрегация Цикл
				Форм=ПолучитьФорму("Документ.ВводВОборот_ХамелеонЦРПТ.Форма.ФормаДокумента",Новый Структура(
				"Ключ",Стр_1));
				Форм.ОтправитьЗаявку(ДД);
				
			Конеццикла;
			
		КонецЕслИ;
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры
Процедура СоздатьАгрегацииПоФайлуJSON(ДвоичнДанные,МассивАгрегация)
	
	Пользователь=ХранилищеСистемныхНастроек.Загрузить("ТекущийПользователь_ХамелеонЦРПТ","ТекущийПользователь_ХамелеонЦРПТ");
	Если ЗначениеЗаполнено(Пользователь) И типЗнч(Пользователь)=Тип("СправочникСсылка.Пользователи_ХамелеонЦРПТ") тогда
		ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ЗагрузитьВводВоборотJSON(ДвоичнДанные,МассивАгрегация,Пользователь);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка. Пользователь не определен");
	КонецЕсли;
	
		
КонецПроцедуры


&НаКлиенте
Процедура СоздатьОтчетОНанесенииXML(Команда)
		// Вставить содержимое обработчика.
		
	Перем Файл;
	ВклЗаг = 0;
	//ДанныеЛиста.Очистить();
	Режим=РежимДиалогаВыбораФайла.Открытие;
	нДиалог= НОвый ДиалогВыбораФайла(Режим);
	//Фильтр="Файл xls/txt/xml|*.xls;*.xlsx;*.txt;*.xml|Файл txt|*.txt|Файл xls|*.xls;*.xlsx|Файл xml|*.xml";
	Фильтр="Файл xml|*.xml";
	нДиалог.МножественныйВыбор=Истина;
	нДиалог.Фильтр=Фильтр;
	нДиалог.Заголовок="Выберите файл для загрузки..." ;
	нДиалог.Показать(Новый ОписаниеОповещения("ПослеВыбораФайла_ОтчетНанесения_ХамелеонЦРПТ",ЭтаФорма,Ложь));
	
	

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла_ОтчетНанесения_ХамелеонЦРПТ(РР,ДД) Экспорт
	МассивАгрегация=Новый Массив;
	МассивАгрегация.Очистить();
	Если РР<>Неопределено тогда
		Для Каждого Стр_Ф Из РР Цикл
			
			ДвоичнДанные=Новый ДвоичныеДанные(Стр_Ф);
			СоздатьОтчетОНанесении(ДвоичнДанные,МассивАгрегация);
			
			
			
		Конеццикла;
		
		Если дД=Истина Тогда
			
			Для Каждого Стр_1 Из МассивАгрегация Цикл
				Форм=ПолучитьФорму("Документ.ВводВОборот_ХамелеонЦРПТ.Форма.ФормаДокумента",Новый Структура(
				"Ключ",Стр_1));
				Форм.ОтправитьЗаявку(ДД);
				
			Конеццикла;
			
		КонецЕслИ;
		Элементы.Список.Обновить();
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура СоздатьОтчетОНанесении(ДвоичнДанные,МассивАгрегация)
	
	
	//ОбщийМодуль_НаСервере_ХамелеонЦРПТ.СоздатьОтчетОНанесении(ДвоичнДанные,МассивАгрегация);
	МВ_ОбщийМодуль_НаСервере_ХамелеонЦРПТ.СоздатьВводВОборотПоФайлуСтандарт(ДвоичнДанные,МассивАгрегация);

КонецПроцедуры

