Процедура ЗапишемСтатусВПродукцию(Стр_Ошиб)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Продукция_ХамелеонЦРПТ.Ссылка
		|ИЗ
		|	Справочник.Продукция_ХамелеонЦРПТ КАК Продукция_ХамелеонЦРПТ
		|ГДЕ
		|	Продукция_ХамелеонЦРПТ.feed_id = &feed_id";
	
	Запрос.УстановитьПараметр("feed_id", Число(Стр_Ошиб));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		ПолОб=ВыборкаДетальныеЗаписи.Ссылка.ПолучитЬОбъект();
		ПолОб.СтатусКарточки=Перечисления.СтатусыКарточекВНК_ХамелеонЦРПТ.published;
		ПолОб.ЗаписатЬ();
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьГоодИД(good_id,Стр_111)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Продукция_ХамелеонЦРПТ.Ссылка
		|ИЗ
		|	Справочник.Продукция_ХамелеонЦРПТ КАК Продукция_ХамелеонЦРПТ
		|ГДЕ
		|	Продукция_ХамелеонЦРПТ.GTIN = &GTIN";
	
	Запрос.УстановитьПараметр("GTIN", Стр_111);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		ПолОб=ВыборкаДетальныеЗаписи.Ссылка.ПолучитЬобъект();
		ПолОб.feed_id=good_id["good_id"];
		
		ПолОб.СтатусКарточки=Перечисления.СтатусыКарточекВНК_ХамелеонЦРПТ[good_id["good_status"]];
		//Если ПолОб.СтатусКарточки=Перечисления.СтатусыКарточекВНК_ХамелеонЦРПТ.ОбработкаВНК 
		//	ИЛИ Не ЗначениеЗаполненО(ПолОб.СтатусКарточки)
		//	Тогда
			
		//Конецесли;
		
		ПолОб.ЗаписатЬ();
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнфуПоХСИПл(ХСПроизводитель)
	
	Возврат Новый Структура("ГУИД,Наименование",ХСПроизводитель.Код,ХСПроизводитель.Наименование)
	
КонецФункции

&НаСервереБезКонтекста
Функция Альфа2(Стр)
	Возврат Стр.Альфа2
КонецФункции


&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Вставить содержимое обработчика.
	Отказ=Истина;
	
	ОткрытьФорму("Справочник.Продукция_ХамелеонЦРПТ.Форма.ФормаВыбораМножество",,,,,,Новый ОписаниеОповещения("ПослеВыбораТоваров",ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораТоваров(РР,ДД) Экспорт
	
	Если РР<>Неопределено тогда
		Для Каждого Стр Из РР Цикл
			Если ЗначениеЗаполнено(Стр) И ОБъект.Товары.НайтиСтроки(Новый Структура("Продукция",Стр)).Количество()=0 Тогда
				
				Добав=Объект.Товары.Добавить();
				Добав.Продукция=Стр;
				
			Конецесли;
			
			
		Конеццикла;
		
	Конецесли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернемБезГТИНов(СписокПродукцией)
	
	МассивБезГтин=Новый Массив;
	КодТНВЭДНет=Ложь;
	Для Каждого Стр Из СписокПродукцией Цикл
		
		Если Не ЗначениеЗаполнено(Стр.ГТИН.КодТНВЭД) Тогда
			КодТНВЭДНет=Истина;
			Сообщить("В карточке товара "+Строка(Стр.ГТИН)+" не заполнен код ТНВЭД");
		Конецесли;
		Если Не ЗначениеЗаполнено(Стр.ГТИН.GTIN) Тогда
			МассивБезГтин.Добавить(Стр.ГТИН);
		КонецеслИ;
	Конеццикла;
	Если КодТНВЭДНет=Истина тогда
		Сообщить("Не заполнен 10 значный код ТНВЭД, отправка документа не возможна");
		Возврат Неопределено
	Конецесли;
	Возврат МассивБезГтин
Конецфункции


&НаСервереБезКонтекста
Функция ПолучитьИзПользователя(ТекущийПользователь)
	Возврат Обработки._Запуск_ХамелеонЦРПТ.ПолучитьИзПользователя(ТекущийПользователь);
КонецФункции

&НаСервереБезКонтекста
Функция СозданиеЧерновика_МассивAPI(СписокДляСозданияКарточек,КоличествоОтправленных)
	
	КоличествоНадоОтправить=СписокДляСозданияКарточек.Количество()-КоличествоОтправленных;
				 
	Чтен=Новый  ЗаписьJSON;
	Чтен.УстановитьСтроку(Новый ПараметрыЗаписиJSON());
	Чтен.ЗаписатьНачалоМассива();;
	
	Для Каждого GTIN Из СписокДляСозданияКарточек Цикл
		
		Чтен.ЗаписатьНачалоОбъекта();;
		//GTIN=СписокДляСозданияКарточек[сч];
		
		Чтен.ЗаписатьИмяСвойства("gtin");
		Чтен.ЗаписатьЗначение(xmlString(GTIN.GTIN));
		
		ШтучныйТовар=Истина;
		Если ЗначениеЗаполнено(GTIN.ТипУпаковки) Тогда
					
			Если Найти(ВРег(GTIN.ТипУпаковки.Наименование),"BUNDLE")>0 Тогда
				ШтучныйТовар=Ложь;
				
				Чтен.ЗаписатьИмяСвойства("is_kit");
				Чтен.ЗаписатьЗначение(true);
				
				
			Иначе
				Чтен.ЗаписатьИмяСвойства("is_kit");
				Чтен.ЗаписатьЗначение(false);
				
				
			Конецесли;
				
			Если Найти(ВРег(GTIN.ТипУпаковки.Наименование),"SET")>0 Тогда
				
				ШтучныйТовар=Ложь;
				Чтен.ЗаписатьИмяСвойства("is_set");
				Чтен.ЗаписатьЗначение(true);
				
				
			Иначе
				Чтен.ЗаписатьИмяСвойства("is_set");
				Чтен.ЗаписатьЗначение(false);
				
				
			Конецесли;
		Конецесли;	
		
		
		Чтен.ЗаписатьИмяСвойства("good_name");
		Чтен.ЗаписатьЗначение(GTIN.НаименованиеТовара);
		Чтен.ЗаписатьИмяСвойства("tnved");
		Чтен.ЗаписатьЗначение(GTIN.КодТНВЭД.Код);
		Чтен.ЗаписатьИмяСвойства("brand");
		Чтен.ЗаписатьЗначение(GTIN.БрендТорговаяМарка);
		
		Если ШтучныйТовар=Истина Тогда
			
			Чтен.ЗаписатьИмяСвойства("identified_by");
			Чтен.ЗаписатьНачалоМассива();
			
			Чтен.ЗаписатьНачалоОбъекта();;
			
			Чтен.ЗаписатьИмяСвойства("type");
			Чтен.ЗаписатьЗначение("gtin");
			
			Чтен.ЗаписатьИмяСвойства("value");
			Чтен.ЗаписатьЗначение(xmlString(GTIN.GTIN));
			
			Чтен.ЗаписатьИмяСвойства("level");
			Чтен.ЗаписатьЗначение("trade-unit");
			
			
			Чтен.ЗаписатьКонецОбъекта();
			Чтен.ЗаписатьКонецМассива();
			
		Конецесли;
		
		Чтен.ЗаписатьКонецОбъекта();
		КоличествоОтправленных=КоличествоОтправленных+1;
	Конеццикла;
	Чтен.ЗаписатьКонецМассива();;
	
	Возврат чтен.Закрыть()
КонецФункции


Функция ВернемДляРегистрацииЧерновика(ТипыПродукций)
	МассивГТИН=Новый Массив;
	
	УжеБылТип=Новый Массив;
	
	Для Каждого Стр Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(Стр.Продукция) Тогда
			СтруктураСт=Новый Структура();
			СтруктураСт.Вставить("Продукция",Стр.Продукция);
			Если ЗначениеЗаполнено(Стр.Продукция.GTIN) Тогда
				СтруктураСт.Вставить("GTIN",xmlString(Стр.Продукция.GTIN));
			ИначеЕсли ЗначениеЗаполнено(Стр.GTIN) Тогда
				СтруктураСт.Вставить("GTIN",xmlString(Число(Стр.GTIN)));
			Конецесли;
			
			СтруктураСт.Вставить("КодТНВЭД",Сред(Стр.Продукция.КодТНВЭД,1,4));
			МассивГТИН.Добавить(СтруктураСт);
			
			
			Если УжеБылТип.Найти(Сред(Стр.Продукция.КодТНВЭД.Код,1,4))=Неопределено Тогда
				УжеБылТип.Добавить(Стр.Продукция.Тип);
				ТипыПродукций.Добавить(Новый Структура("Тип,feed_id",Сред(Стр.Продукция.КодТНВЭД.Код,1,4),Сред(Стр.Продукция.КодТНВЭД.Код,1,4)));
			Конецесли;
			
		КонецеслИ;
		
	Конеццикла;
	Возврат МассивГТИН;
	
КонецФункции


&НаСервереБезКонтекста
Функция ВернемДляРегистрацииЧерновика_Без_ИД(СписокПродукцией)
	МассивВозвращаем=Новый Массив;
	Для Каждого Стр Из СписокПродукцией Цикл
		Если Не ЗначениеЗаполнено(Стр.ГТИН.feed_id) Тогда
			Если МассивВозвращаем.Найти(Стр.ГТИН.GTIN)=Неопределено Тогда
				МассивВозвращаем.Добавить(Стр.ГТИН.GTIN);
			Конецесли;
			
		КонецеслИ;
		
		
	Конеццикла;
	Возврат МассивВозвращаем
	
Конецфункции



Функция ПолучитьЗапрос()
	
	Чтен=Новый ЗаписьJSON;
	Чтен.УстановитьСтроку(Новый ПараметрыЗаписиJSON());
	Чтен.ЗаписатьНачалоОбъекта();
	
	Чтен.ЗаписатьИмяСвойства("goodIds");
	Чтен.ЗаписатьНачалоМассива();
	Для каждого Стр Из Объект.Товары Цикл
		
		Если Не ЗначениеЗаполнено(Стр.Продукция.feed_id) Тогда
			Сообщить("У продукции "+Стр.Продукция.НаименованиеТовара+" не опрелился ИД в НК ");
			Возврат "";
		Конецесли;
		Чтен.ЗаписатьЗначение(xmlString(Стр.Продукция.feed_id));
		
	Конеццикла;
	Чтен.ЗаписатьКонецМассива();
	Чтен.ЗаписатьИмяСвойства("publicationAgreement");
	Чтен.ЗаписатьЗначение(true);
	Чтен.ЗаписатьКонецОбъекта();
	Возврат Чтен.Закрыть()
КонецФункции

&НаКлиенте
Процедура ПодписатьКарточки()
	
	СписокПродукцией=Новый Массив;
	Для Каждого Стр Из Объект.Товары Цикл
		СписокПродукцией.Добавить(Новый Структура("ГТИН,Текст",Стр.Продукция,""));
	Конеццикла;
	
		Пользователь=Объект.ТекущийПользователь;
		Thumbprint_1=ПолучитьИзПользователя(Пользователь);
		Если ЗначениеЗаполнено(Thumbprint_1.КлючAPIККМТ) тогда
			КлючПодключения="apikey="+Thumbprint_1.КлючAPIККМТ;	
		Иначе
			
				СерийныйНомер="";

				СтруктураНастроек=Неопределено;                                                    СерийныйНомер="";
								СРегистра=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПолучитьТокенСрегистра(Thumbprint_1.Thumbprint_1,СтруктураНастроек);
										СерийныйНомер=СтруктураНастроек.СерийныйНомер;
								
									Если Не ЗначениеЗаполнено(СРегистра)  Тогда
										СРегистра=ОбщиеМетоды_НаКлиенте_ХамелеонЦРПТ.Получение_Токена(Thumbprint_1,СерийныйНомер);	
									Иначе
									   
											Если ЗначениеЗАполнено(Thumbprint_1.АдресПрокси) Тогда
												Прокси=Новый ИнтернетПрокси;
												Прокси.Установить("http",Thumbprint_1.АдресПрокси,Thumbprint_1.ПортПрокси,Thumbprint_1.ПользовательПрокси,Thumbprint_1.ПарольПрокси);
											
												HTTPСервисЗапрос=Новый HTTPСоединение(Thumbprint_1.АдресДляПолученияТокена,,,,Прокси,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
											Иначе
											
												HTTPСервисЗапрос=Новый HTTPСоединение(Thumbprint_1.АдресДляПолученияТокена,,,,,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
											КонецЕсли;
											
											HTTPЗапрос=Новый HTTPЗапрос("api/v3/facade/balance/all");
											HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json;charset=UTF-8");
											HTTPЗапрос.Заголовки.Вставить("Authorization","Bearer "+СРегистра);
											//HTTPЗапрос.Заголовки.Вставить("Host","ismotp.crptech.ru");
											///Константин           
											Ответ=HTTPСервисЗапрос.ВызватьHTTPМетод("GET",HTTPЗапрос);
											//Текст1=Ответ.ПолучитьТелоКакСтроку();
											Если Ответ.КодСостояния<>200 Тогда
												СРегистра=ОбщиеМетоды_НаКлиенте_ХамелеонЦРПТ.Получение_Токена(Thumbprint_1,СерийныйНомер);	
											КонецЕсли;
												
									КонецЕсли;
									Если Не ЗначениеЗАполнено(Срегистра) Тогда
										Возврат;
									Конецесли;
			КлючПодключения="";	
			
			
		Конецесли;
		
		
		
		Если ЗначениеЗАполнено(Thumbprint_1.АдресПрокси) Тогда
				Прокси=Новый ИнтернетПрокси;
				Прокси.Установить("http",Thumbprint_1.АдресПрокси,Thumbprint_1.ПортПрокси,Thumbprint_1.ПользовательПрокси,Thumbprint_1.ПарольПрокси);
				
				
			//	HTTPСервисЗапрос=Новый HTTPСоединение("account.integrators.nk.crpt.tech",,,,Прокси,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
			//	HTTPСервисЗапрос=Новый HTTPСоединение("xn--j1ab.xn----7sbabas4ajkhfocclk9d3cvfsa.xn--p1ai",,,,Прокси,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
				HTTPСервисЗапрос=Новый HTTPСоединение(Thumbprint_1.КаталогСайтAPI,,,,Прокси,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
			Иначе
			///	HTTPСервисЗапрос=Новый HTTPСоединение("account.integrators.nk.crpt.tech",,,,,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
				//HTTPСервисЗапрос=Новый HTTPСоединение("xn--j1ab.xn----7sbabas4ajkhfocclk9d3cvfsa.xn--p1ai",,,,,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
				HTTPСервисЗапрос=Новый HTTPСоединение(Thumbprint_1.КаталогСайтAPI,,,,,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
			КонецЕсли;
			
			
		ТекстСохранить="POST https://"+Thumbprint_1.КаталогСайтAPI+"/";

		
	ВернемДляРегистрацииЧерновика=ВернемДляРегистрацииЧерновика_Без_ИД(СписокПродукцией);
	 Для каждого Стр_111 Из ВернемДляРегистрацииЧерновика Цикл
		Если значениеЗаполнено(КлючПодключения ) тогда
			ЗапросТекст="v3/feed-product?apikey="+Thumbprint_1.КлючAPIККМТ+"&gtin="+Формат(Стр_111,"ЧГ=");
			HTTPЗапрос=Новый HTTPЗапрос(ЗапросТекст);
			
			
		Иначе
			ЗапросТекст="v3/feed-product?gtin="+Формат(Стр_111,"ЧГ=");
			HTTPЗапрос=Новый HTTPЗапрос(ЗапросТекст );
			HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json;charset=UTF-8");
			HTTPЗапрос.Заголовки.Вставить("Authorization","Bearer "+СРегистра);
		Конецесли;
		Ответ=HTTPСервисЗапрос.Получить(HTTPЗапрос);
		Если Ответ.КодСостояния=200 Тогда
			NNN=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ЗаполнитьСтруктуруИзОтветаJSON_Соответствие(Ответ.ПолучитьТелоКакСтроку());
			Если NNN["result"]<>Неопределено И NNN["result"].Количество()>0 Тогда
				
				ЗаписатьГоодИД(NNN["result"][0],Стр_111);
				
			Конецесли;
			//	ЗаполнимГТИНАМИ(ВернемБезГТИНов,NNN["result"]["drafts"]);
			//ИначеЕсли NNN["result"]<>Неопределено И NNN["result"]["error"]<>Неопределено Тогда
			//	Сообщить("Не удалось полуить ГТИНы "+NNN["result"]["error"]);
			//Иначе
				
			//	Сообщить("Не удалось полуить ГТИНы "+Ответ.ПолучитьТелоКакСтроку());
			///Конецесли;
		Конецесли;
		
		
	Конеццикла;
	
	
	ПолучитьЗапрос=ПолучитьЗапрос();
	Если ЗначениеЗаполнено(ПолучитьЗапрос) Тогда
	
			
			//ОтправляемСначалаБезГТИН=Ложь;

		 ////Отправляем снчала без GTIN
		Если значениеЗаполнено(КлючПодключения ) тогда
			
			ЗапросТекст="v3/feed-product-document?apikey="+Thumbprint_1.КлючAPIККМТ;
			HTTPЗапрос=Новый HTTPЗапрос(ЗапросТекст);
		Иначе
			ЗапросТекст="v3/feed-product-document";
			HTTPЗапрос=Новый HTTPЗапрос(ЗапросТекст );
			HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json;charset=UTF-8");
			HTTPЗапрос.Заголовки.Вставить("Authorization","Bearer "+СРегистра);
		Конецесли;
		#Если ВебКлиент Тогда
				HTTPЗапрос.УстановитьТелоИзСтроки(ПолучитьЗапрос,КодировкаТекста.UTF8);	
		#Иначе
				HTTPЗапрос.УстановитьТелоИзСтроки(ПолучитьЗапрос,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);	
		#КонецЕсли
		
		Объект.ОШибки.Очистить();
		
		
		Ответ=HTTPСервисЗапрос.ОтправитьДляОбработки(HTTPЗапрос);
		Если Ответ.КодСостояния=200 Тогда
			NNN=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ЗаполнитьСтруктуруИзОтветаJSON_Соответствие(Ответ.ПолучитьТелоКакСтроку());
			
			Если NNN["result"]<>Неопределено тогда
				
				результат=NNN["result"];
				Если результат["errors"]<>Неопределено Тогда
					Сообщить("В документе есть ошибки");
					Для Каждого Стр_Ошиб Из результат["errors"] Цикл
						Добав=Объект.ОШибки.Добавить();
						Добав.GTIN=Стр_Ошиб["goodId"];
						Добав.Ошибки=Стр_Ошиб["message"];
						
						
					конеццикла;
					
					
				КонецеслИ;
				
				Если результат["xml"]<>Неопределено 
					И результат["xml"].Количество()>0
					Тогда
					
					Чтен=Новый ЗаписьJSON;
					Чтен.УстановитьСтроку(Новый ПараметрыЗаписиJSON());
					Чтен.ЗаписатьНачалоМассива();
					
					
					
					
					Для Каждого Стр_Ошиб Из результат["xml"] Цикл
						
						Чтен.ЗаписатьНачалоОбъекта();
						Чтен.ЗаписатьИмяСвойства("goodId");
						Чтен.ЗаписатьЗначение(Стр_Ошиб["goodId"]);
						
						Чтен.ЗаписатьИмяСвойства("xml");
						
						Подписанный="";
						ОбщиеМетоды_НаКлиенте_ХамелеонЦРПТ.ПодписатьФайл_XML(
						Стр_Ошиб["xml"],Подписанный,Пользователь);
						
						Подписанный=СтрЗаменить(Подписанный,Символы.ПС,"");
						Подписанный=СтрЗаменить(Подписанный,Символы.ВК,"");
						Чтен.ЗаписатьЗначение(Подписанный);
						
						//Чтен.ЗаписатьЗначение(Стр_Ошиб["goodId"]);
						
						Чтен.ЗаписатьКонецОбъекта();
						
						
					конеццикла;
					Чтен.ЗаписатьКонецМассива();
					
					ТелоДляОтправки=Чтен.Закрыть();
					
					
					Если значениеЗаполнено(КлючПодключения ) тогда
						
						ЗапросТекст="v3/feed-product-sign?apikey="+Thumbprint_1.КлючAPIККМТ;
						HTTPЗапрос=Новый HTTPЗапрос(ЗапросТекст);
					Иначе
						ЗапросТекст="v3/feed-product-sign";
						HTTPЗапрос=Новый HTTPЗапрос(ЗапросТекст );
						HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json;charset=UTF-8");
						HTTPЗапрос.Заголовки.Вставить("Authorization","Bearer "+СРегистра);
					Конецесли;
					#Если ВебКлиент Тогда
							HTTPЗапрос.УстановитьТелоИзСтроки(ТелоДляОтправки,КодировкаТекста.UTF8);	
					#Иначе
							HTTPЗапрос.УстановитьТелоИзСтроки(ТелоДляОтправки,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);	
					#КонецЕсли
					
					Ответ=HTTPСервисЗапрос.ОтправитьДляОбработки(HTTPЗапрос);
					
					Если Ответ.КодСостояния=200 Тогда
						
						NNN=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ЗаполнитьСтруктуруИзОтветаJSON_Соответствие(Ответ.ПолучитьТелоКакСтроку());
						Если 		NNN["result"]<>Неопределено Тогда
							
							результат=NNN["result"];
							Если результат["errors"]<>Неопределено Тогда
								Сообщить("В документе есть ошибки");
								Для Каждого Стр_Ошиб Из результат["errors"] Цикл
									Добав=Объект.ОШибки.Добавить();
									Добав.GTIN=Стр_Ошиб["goodId"];
									Добав.Ошибки=Стр_Ошиб["message"];
									
									
								конеццикла;
								
								
							КонецеслИ;
							
							Если результат["signed"]<>Неопределено Тогда
								Для Каждого Стр_Ошиб Из результат["signed"] Цикл
									ЗапишемСтатусВПродукцию(Стр_Ошиб);
								конеццикла;
								
							КонецеслИ;
														
							
						конецесли;

					Иначе
						Добав=Объект.ОШибки.Добавить();
						Добав.GTIN="Общая ошибка";
						Добав.Ошибки=Ответ.ПолучитьТелоКакСтроку();
						
					КонецеслИ;
					
					
				КонецеслИ;
				
				
			Конецесли;
			
		Иначе
			
						Добав=Объект.ОШибки.Добавить();
						Добав.GTIN="Общая ошибка";
						Добав.Ошибки=Ответ.ПолучитьТелоКакСтроку();

			
			
		Конецесли;
		
		
		
	КонецеслИ;
	
	
КонецПроцедуры



&НаКлиенте
Процедура ОтправитьВЦРПТ(Команда) Экспорт
	// Вставить содержимое обработчика.
	// Вставить содержимое обработчика.
	
	Этаформа.Записать();
	Если ЗначениеЗаполнено(Объект.Статус) И Объект.Статус<>ПредопределенноеЗначение("Перечисление.СтатусыДокументов_ХамелеонЦРПТ.Отказ") Тогда
		Сообщить("Документ "+Строка(Объект.Ссылка)+" уже отправлен");
		Возврат;
	Конецесли;
	
	
	Если Объект.ТипОтправки=ПредопределенноеЗначение("Перечисление.ТипОтправкиКарточекВНКПоAPI_ХамелеонЦРПТ.Подписать") Тогда
		ПодписатьКарточки();
		
		Возврат;
	Конецесли;
	
			
	СписокПродукцией=Новый Массив;
	Для Каждого Стр Из Объект.Товары Цикл
		СписокПродукцией.Добавить(Новый Структура("ГТИН,Текст",Стр.Продукция,""));
	Конеццикла;
	
	ВернемБезГТИНов=ВернемБезГТИНов(СписокПродукцией);
	Если ВернемБезГТИНов=Неопределено тогда
		Возврат;
	Конецесли;
	
	Пользователь=Объект.ТекущийПользователь;
	
	Thumbprint_1=ПолучитьИзПользователя(Пользователь);
	
	
	
	
	
	Если ЗначениеЗаполнено(Thumbprint_1.КлючAPIККМТ) тогда
		КлючПодключения="apikey="+Thumbprint_1.КлючAPIККМТ;	
	Иначе
		
			СерийныйНомер="";

			СтруктураНастроек=Неопределено;                                                    СерийныйНомер="";
							СРегистра=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПолучитьТокенСрегистра(Thumbprint_1.Thumbprint_1,СтруктураНастроек);
									СерийныйНомер=СтруктураНастроек.СерийныйНомер;
							
								Если Не ЗначениеЗаполнено(СРегистра)  Тогда
									СРегистра=ОбщиеМетоды_НаКлиенте_ХамелеонЦРПТ.Получение_Токена(Thumbprint_1,СерийныйНомер);	
								Иначе
								   
										Если ЗначениеЗАполнено(Thumbprint_1.АдресПрокси) Тогда
											Прокси=Новый ИнтернетПрокси;
											Прокси.Установить("http",Thumbprint_1.АдресПрокси,Thumbprint_1.ПортПрокси,Thumbprint_1.ПользовательПрокси,Thumbprint_1.ПарольПрокси);
										
											HTTPСервисЗапрос=Новый HTTPСоединение(Thumbprint_1.АдресДляПолученияТокена,,,,Прокси,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
										Иначе
										
											HTTPСервисЗапрос=Новый HTTPСоединение(Thumbprint_1.АдресДляПолученияТокена,,,,,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
										КонецЕсли;
										
										HTTPЗапрос=Новый HTTPЗапрос("api/v3/facade/balance/all");
										HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json;charset=UTF-8");
										HTTPЗапрос.Заголовки.Вставить("Authorization","Bearer "+СРегистра);
										//HTTPЗапрос.Заголовки.Вставить("Host","ismotp.crptech.ru");
										///Константин           
										Ответ=HTTPСервисЗапрос.ВызватьHTTPМетод("GET",HTTPЗапрос);
										//Текст1=Ответ.ПолучитьТелоКакСтроку();
										Если Ответ.КодСостояния<>200 Тогда
											СРегистра=ОбщиеМетоды_НаКлиенте_ХамелеонЦРПТ.Получение_Токена(Thumbprint_1,СерийныйНомер);	
										КонецЕсли;
											
								КонецЕсли;
								Если Не ЗначениеЗАполнено(Срегистра) Тогда
									Возврат;
								Конецесли;
		КлючПодключения="";	
		
		
	Конецесли;
	
	
	
	Если ЗначениеЗАполнено(Thumbprint_1.АдресПрокси) Тогда
			Прокси=Новый ИнтернетПрокси;
			Прокси.Установить("http",Thumbprint_1.АдресПрокси,Thumbprint_1.ПортПрокси,Thumbprint_1.ПользовательПрокси,Thumbprint_1.ПарольПрокси);
			
			
		//	HTTPСервисЗапрос=Новый HTTPСоединение("account.integrators.nk.crpt.tech",,,,Прокси,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
		//	HTTPСервисЗапрос=Новый HTTPСоединение("xn--j1ab.xn----7sbabas4ajkhfocclk9d3cvfsa.xn--p1ai",,,,Прокси,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
			HTTPСервисЗапрос=Новый HTTPСоединение(Thumbprint_1.КаталогСайтAPI,,,,Прокси,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
		Иначе
		///	HTTPСервисЗапрос=Новый HTTPСоединение("account.integrators.nk.crpt.tech",,,,,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
			//HTTPСервисЗапрос=Новый HTTPСоединение("xn--j1ab.xn----7sbabas4ajkhfocclk9d3cvfsa.xn--p1ai",,,,,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
			HTTPСервисЗапрос=Новый HTTPСоединение(Thumbprint_1.КаталогСайтAPI,,,,,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
		КонецЕсли;
		
		ТекстСохранить="POST https://"+Thumbprint_1.КаталогСайтAPI+"/";

		
		//ОтправляемСначалаБезГТИН=Ложь;

	Если ВернемБезГТИНов.Количество()>0 Тогда
		 ////Отправляем снчала без GTIN
		Если значениеЗаполнено(КлючПодключения ) тогда
			
			ЗапросТекст="v3/generate-gtins?apikey="+Thumbprint_1.КлючAPIККМТ+"&quantity="+Формат(ВернемБезГТИНов.Количество(),"ЧГ=");
			HTTPЗапрос=Новый HTTPЗапрос(ЗапросТекст);
		Иначе
			ЗапросТекст="v3/generate-gtins?quantity="+Формат(ВернемБезГТИНов.Количество(),"ЧГ=");
			HTTPЗапрос=Новый HTTPЗапрос(ЗапросТекст );
			HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json;charset=UTF-8");
			HTTPЗапрос.Заголовки.Вставить("Authorization","Bearer "+СРегистра);
		Конецесли;
		Ответ=HTTPСервисЗапрос.Получить(HTTPЗапрос);
		Если Ответ.КодСостояния=200 Тогда
			NNN=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ЗаполнитьСтруктуруИзОтветаJSON_Соответствие(Ответ.ПолучитьТелоКакСтроку());
			Если NNN["result"]<>Неопределено И NNN["result"]["drafts"]<>Неопределено И NNN["result"]["drafts"].Количество()>0 Тогда
				
				Сч=0;
				Для Каждого Стр_1 Из NNN["result"]["drafts"] Цикл
					GTIN=ВернемБезГТИНов[0];
					НСтрок=GTIN.Товары.НайтиСтроки(Новый Структура("Продукция",GTIN));
					Для Каждого Стр_2 Из НСтрок Цикл
						Если Не ЗначениеЗаполнено(Стр_2.GTIN) Тогда
							Стр_2.GTIN=Стр_1.gtin;
						КонецеслИ;
					Конеццикла;
					
					
				Конеццикла;
				
				
				//ЗаполнимГТИНАМИ(ВернемБезГТИНов,NNN["result"]["drafts"]);
			ИначеЕсли NNN["result"]<>Неопределено И NNN["result"]["error"]<>Неопределено Тогда
				Сообщить("Не удалось полуить ГТИНы "+NNN["result"]["error"]);
			Иначе
				
				Сообщить("Не удалось полуить ГТИНы "+Ответ.ПолучитьТелоКакСтроку());
			Конецесли;
		Конецесли;
		
	Конецесли;
	

	ТипыПродукций=Новый Массив;
	ВернемВсюПродукциюСГТИН=ВернемДляРегистрацииЧерновика(ТипыПродукций);
	//СписокДляСозданияКарточек=ВернемДляРегистрацииПродукции_Элемент(СписокПродукцией,ТипыПродукций);
	
	Текстсы.Очистить();
	Для Каждого Стр_11 Из ТипыПродукций Цикл
		
		Если значениеЗаполнено(КлючПодключения ) тогда
			ЗапросТекст="v3/attributes?apikey="+Thumbprint_1.КлючAPIККМТ+"&tnved="+Стр_11.feed_id;
			HTTPЗапрос=Новый HTTPЗапрос(ЗапросТекст);
		Иначе
			ЗапросТекст="v3/attributes?tnved="+Стр_11.feed_id;
			HTTPЗапрос=Новый HTTPЗапрос(ЗапросТекст );
			HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json;charset=UTF-8");
			HTTPЗапрос.Заголовки.Вставить("Authorization","Bearer "+СРегистра);
		Конецесли;
		Ответ=HTTPСервисЗапрос.Получить(HTTPЗапрос);
		Если Ответ.КодСостояния=200 Тогда
			
			Добав=Текстсы.Добавить();
			Добав.ТипПродукции=Стр_11.Тип;
			Добав.ТекстJSON=Ответ.ПолучитьТелоКакСтроку();
			
		Иначе
			Добав=Текстсы.Добавить();
			Добав.ТипПродукции=Стр_11.Тип;
			Добав.ТекстJSON="";
			
		Конецесли;
	Конеццикла;
	
	
	
	///ПРЕЖДЕ ЧЕМ ОТПРАВИМ НЕОБХОДИМО ПОЛУЧИТЬ КАРТОЧКИ, у которых нет id
	ВернемДляРегистрацииЧерновика=ВернемДляРегистрацииЧерновика_Без_ИД(СписокПродукцией);
	 Для каждого Стр_111 Из ВернемДляРегистрацииЧерновика Цикл
		Если значениеЗаполнено(КлючПодключения ) тогда
			ЗапросТекст="v3/feed-product?apikey="+Thumbprint_1.КлючAPIККМТ+"&gtin="+Формат(Стр_111,"ЧГ=");
			HTTPЗапрос=Новый HTTPЗапрос(ЗапросТекст);
			
			
		Иначе
			ЗапросТекст="v3/feed-product?gtin="+Формат(Стр_111,"ЧГ=");
			HTTPЗапрос=Новый HTTPЗапрос(ЗапросТекст );
			HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json;charset=UTF-8");
			HTTPЗапрос.Заголовки.Вставить("Authorization","Bearer "+СРегистра);
		Конецесли;
		Ответ=HTTPСервисЗапрос.Получить(HTTPЗапрос);
		Если Ответ.КодСостояния=200 Тогда
			NNN=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ЗаполнитьСтруктуруИзОтветаJSON_Соответствие(Ответ.ПолучитьТелоКакСтроку());
			Если NNN["result"]<>Неопределено И NNN["result"].Количество()>0 Тогда
				
				ЗаписатьГоодИД(NNN["result"][0],Стр_111);
				
			Конецесли;
			//	ЗаполнимГТИНАМИ(ВернемБезГТИНов,NNN["result"]["drafts"]);
			//ИначеЕсли NNN["result"]<>Неопределено И NNN["result"]["error"]<>Неопределено Тогда
			//	Сообщить("Не удалось полуить ГТИНы "+NNN["result"]["error"]);
			//Иначе
				
			//	Сообщить("Не удалось полуить ГТИНы "+Ответ.ПолучитьТелоКакСтроку());
			///Конецесли;
		Конецесли;
		
		
	Конеццикла;
	

	
	
	
	ВернутьТелоЗапроса=СозданиеПродукции_МассивAPI(ВернемВсюПродукциюСГТИН);
	
		
	//СписокДляСозданияКарточек=ВернемДляРегистрацииЧерновика_Элемент(СписокПродукцией);
	//
	//КоличествоОтправленных=0;
	//
	////Пока КоличествоОтправленных<СписокДляСозданияКарточек.Количество() Цикл
	//	
	//	ВернутьТелоЗапроса=СозданиеЧерновика_МассивAPI(СписокДляСозданияКарточек,КоличествоОтправленных);
	//	
		Если значениеЗаполнено(КлючПодключения ) тогда
			ЗапросТекст="v3/feed?apikey="+Thumbprint_1.КлючAPIККМТ;
			HTTPЗапрос=Новый HTTPЗапрос(ЗапросТекст);
			ТекстСохранить=ТекстСохранить+"v3/feed?apikey="+Thumbprint_1.КлючAPIККМТ;
			
		Иначе
			ЗапросТекст="v3/feed";
			HTTPЗапрос=Новый HTTPЗапрос(ЗапросТекст );
			HTTPЗапрос.Заголовки.Вставить("Authorization","Bearer "+СРегистра);
			ТекстСохранить=ТекстСохранить+"v3/feed";
		Конецесли;
	//	
		HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json;charset=UTF-8");
		
		ТекстСохранить=ТекстСохранить+символы.ПС+"Запрос тела";
		ТекстСохранить=ТекстСохранить+символы.ПС+ВернутьТелоЗапроса;
		
		#Если ВебКлиент Тогда
				HTTPЗапрос.УстановитьТелоИзСтроки(ВернутьТелоЗапроса,КодировкаТекста.UTF8);	
		#Иначе
				HTTPЗапрос.УстановитьТелоИзСтроки(ВернутьТелоЗапроса,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);	
		#КонецЕсли
		Ответ=HTTPСервисЗапрос.ОтправитьДляОбработки(HTTPЗапрос);
		
		
		Если ЗаписыватьДанныеПриОтправкеЗаказа=Истина Тогда
			ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ЗапишемВРЕГИСТР_ОтправленныеПолученные_ХамелеонЦРПТ(Объект.Ссылка,ТекстСохранить,"Отправка в НК по API");
			ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ЗапишемВРЕГИСТР_ОтправленныеПолученные_ХамелеонЦРПТ(Объект.Ссылка,Ответ.ПолучитьТелоКакСтроку(),"Ответ на отправку в НК по API");
		КонецеслИ;
		
		
		Если Ответ.КодСостояния=200 Тогда
	//		Сообщить("Продукция отправлена в НК успешно. Ждем обработки.");
			NNN=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ЗаполнитьСтруктуруИзОтветаJSON_Соответствие(Ответ.ПолучитьТелоКакСтроку());
			//Если NNN["result"]<>Неопределено И NNN["result"].Количество()>0 Тогда
				
			///	ЗаписатьГоодИД(NNN["result"][0],Стр_111);
				
//			Конецесли;
			Объект.feed_id=NNN["result"]["feed_id"];
			Объект.Статус=ПредопределенноеЗначение("Перечисление.СтатусыДокументов_ХамелеонЦРПТ.Отправлен");
	    	ЭтаФорма.Записать();
		Иначе
			Сообщить("Не удалось отправит документ в НК "+Ответ.ПолучитьТелоКакСтроку());
	//		
		конецесли;
		
		
		//Смещение=Смещение+;
	//Конеццикла;
	
	
	
	
	//
	//ТипыПродукций=Новый Массив;
	//СписокДляСозданияКарточек=ВернемДляРегистрацииПродукции_Элемент(СписокПродукцией,ТипыПродукций);
	//
	//Текстсы.Очистить();
	//Для Каждого Стр_11 Из ТипыПродукций Цикл
	//	
	//	Если значениеЗаполнено(КлючПодключения ) тогда
	//		ЗапросТекст="v3/attributes?apikey="+Thumbprint_1.КлючAPIККМТ+"&tnved="+Стр_11.feed_id;
	//		HTTPЗапрос=Новый HTTPЗапрос(ЗапросТекст);
	//	Иначе
	//		ЗапросТекст="v3/attributes?tnved="+Стр_11.feed_id;
	//		HTTPЗапрос=Новый HTTPЗапрос(ЗапросТекст );
	//		HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json;charset=UTF-8");
	//		HTTPЗапрос.Заголовки.Вставить("Authorization","Bearer "+СРегистра);
	//	Конецесли;
	//	Ответ=HTTPСервисЗапрос.Получить(HTTPЗапрос);
	//	Если Ответ.КодСостояния=200 Тогда
	//		
	//		Добав=Текстсы.Добавить();
	//		Добав.ТипПродукции=Стр_11.Тип;
	//		Добав.ТекстJSON=Ответ.ПолучитьТелоКакСтроку();
	//		
	//		//NNN=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ЗаполнитьСтруктуруИзОтветаJSON_Соответствие(Ответ.ПолучитьТелоКакСтроку());
	//		//Если NNN["result"]<>Неопределено И NNN["result"].Количество()>0 Тогда
	//			
	//			//ЗаписатьГоодИД(NNN["result"][0],Стр_111);
	//			
	//		//Конецесли;
	//		//	ЗаполнимГТИНАМИ(ВернемБезГТИНов,NNN["result"]["drafts"]);
	//		//ИначеЕсли NNN["result"]<>Неопределено И NNN["result"]["error"]<>Неопределено Тогда
	//		//	Сообщить("Не удалось полуить ГТИНы "+NNN["result"]["error"]);
	//		//Иначе
	//			
	//		//	Сообщить("Не удалось полуить ГТИНы "+Ответ.ПолучитьТелоКакСтроку());
	//		///Конецесли;
	//	Конецесли;
	//	
	//
	//Конеццикла;
	
	
	
	
	//
	//КоличествоОтправленных=0;
	//
	//
	//
	//Пока КоличествоОтправленных<СписокДляСозданияКарточек.Количество() Цикл
	//	
	//	ВернутьТелоЗапроса=СозданиеПродукции_МассивAPI(СписокДляСозданияКарточек,МаксимальноеКоличествоДляОтправкиВНКПоAPI,КоличествоОтправленных);
	//	
	//	//Если значениеЗаполнено(КлючПодключения ) тогда
	//	//	ЗапросТекст="v3/feed?apikey="+Thumbprint_1.КлючAPIККМТ;
	//	//	HTTPЗапрос=Новый HTTPЗапрос(ЗапросТекст);
	//	//Иначе
	//	//	ЗапросТекст="v3/feed";
	//	//	HTTPЗапрос=Новый HTTPЗапрос(ЗапросТекст );
	//	//	HTTPЗапрос.Заголовки.Вставить("Authorization","Bearer "+СРегистра);
	//	//Конецесли;
	//	//
	//	//HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json;charset=UTF-8");
	//	//#Если ВебКлиент Тогда
	//	//		HTTPЗапрос.УстановитьТелоИзСтроки(ВернутьТелоЗапроса,КодировкаТекста.UTF8);	
	//	//#Иначе
	//	//		HTTPЗапрос.УстановитьТелоИзСтроки(ВернутьТелоЗапроса,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);	
	//	//#КонецЕсли
	//	//Ответ=HTTPСервисЗапрос.ОтправитьДляОбработки(HTTPЗапрос);
	//	//Если Ответ.КодСостояния=200 Тогда
	//	//	Сообщить("Продукция отправлена в НК успешно. Ждем обработки.");
	//	//Иначе
	//	//	Сообщить("Не удалось создать продукцию в НК "+Ответ.ПолучитьТелоКакСтроку());
	//	//	
	//	//конецесли;
	//	
	//	
	//	//Смещение=Смещение+;
	//Конеццикла;
	//
	
	
КонецПроцедуры
	
//&НаСервереБезКонтекста
//Процедура ЗаполнимГТИНАМИ(ВернемБезГТИНов,drafts)
//	сч=0;
//	Для Каждого Стр Из ВернемБезГТИНов Цикл
//		ПолОб=Стр.ПолучитЬобъект();
//		ПолОб.GTIN=drafts[сч].gtin;
//		ПолОб.Записать();
//		сч=сч+1;
//		Если drafts.Количество()>=сч Тогда
//			Сообщить("Получено "+Строка(сч)+" из "+Строка(ВернемБезГТИНов.Количество()));
//			Прервать;
//		Конецесли;
//		
//	Конеццикла;
//	
//КонецПроцедуры

Функция СозданиеПродукции_МассивAPI(СписокДляСозданияКарточек)
	
	МассивПродукцийДляОтправкиВНК=Новый Массив;
	
	
		
	Для каждого GTIN_1 Из 	СписокДляСозданияКарточек Цикл
		//Чтен.ЗаписатьНачалоGTINа();;
		
		GTIN=GTIN_1.Продукция;
		Если Не ЗначениеЗаполнено(GTIN.GTIN)
			Тогда
			Продолжить;
		Конецесли;
		
		
		
		
		
		
		
		Текст=Текстсы.НайтиСтроки(Новый Структура("ТипПродукции",Сред(GTIN.КодТНВЭД.Код,1,4)))[0].ТекстJSON;
		
		NNN=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ЗаполнитьСтруктуруИзОтветаJSON(Текст);
		NNN=NNN.result;
		ДополнительныйРеквизитОбщиеНК=GTIN.ДополнительныйРеквизитОбщиеНК;
		ДополнительныйРеквизитБелье=GTIN.ДополнительныйРеквизитБелье;
		ДополнительныеРеквизитОдежда=GTIN.ДополнительныеРеквизитОдежда;
		ДополнительныйРеквизитВелосипед=GTIN.ДополнительныйРеквизитВелосипед;
		ДополнительныеРеквизитФото=GTIN.ДополнительныеРеквизитФото;
		ДополнительныйРеквизитПарфюм=GTIN.ДополнительныйРеквизитПарфюм;
		ДополнительныеРеквизитыШины=GTIN.ДополнительныйРеквизитШины;
		ДополнительныеРеквизитВода=GTIN.ДополнительныеРеквизитВода;
		ДополнителныеРеквизитМолоко=GTIN.ДополнительныйРеквизитМолоко;
		ДополнительныйРеквизитОбувь=GTIN.ДополнительныйРеквизитОбувь;
		
		
		МассивАтрибутовДляДобавления=Новый Массив;
		
		
		Если ДополнительныйРеквизитОбщиеНК.ДополнительныеУпаковки.Количество()>0 Тогда
								
								 
//								 СЧ=ДополнительныйРеквизитОбщиеНК.ДополнительныеУпаковки.Количество()-1;
//								 Пока сч>=0 Цикл
//									 Стр_123123=ДополнительныйРеквизитОбщиеНК.ДополнительныеУпаковки[сч];
//									 сч=сч-1;
//									 Если БылаУпаковка.Найти(Стр_123123)<>Неопределено Тогда
//										 Продолжить;
//										Конецесли;
//								//Для Каждого Стр_123123 Из  ДополнительныйРеквизитОбщиеНК.ДополнительныеУпаковки Цикл
//									Стр_Н=Новый Структура;
//									Для Каждого Стр_Стр Из Запишемсюда_Потр Цикл
//										Стр_Н.Вставить(Стр_Стр.Ключ,Неопределено);
//										
//										
//										Если Стр_Стр.Ключ="vghList" тогда
//											 МассивСтруктура=Новый Массив;
//											 
//											 
//											 Для Каждого Стр_М_1 Из Стр_Стр.Значение Цикл
//												 
//												 Стр_М_Структура=Новый Структура;
//												 
//												 Для Каждого Стр_Стр_СтруктураМ Из Стр_М_1 Цикл
//													 
//													 Если Стр_Стр_СтруктураМ.Ключ="value" Тогда
//													    Стр_М_Структура.Вставить(Стр_Стр_СтруктураМ.Ключ,"");
//														Иначе
//													    Стр_М_Структура.Вставить(Стр_Стр_СтруктураМ.Ключ,Стр_Стр_СтруктураМ.Значение);
//										                Конецесли;
//													 
//												Конеццикла;
//												МассивСтруктура.Добавить(Стр_М_Структура);
//												
//											Конеццикла;
//											
//											Стр_Н.vghList=МассивСтруктура;
//										Конецесли;
//										
//										
//									Конеццикла;
//									Стр_Н.disableRequired=Ложь;
//									Стр_Н.disabled=Ложь;
//									Стр_Н.gtinType=1;
//									Стр_Н.multiplier=0;
//									Стр_Н.name="";
//									Стр_Н.unitType=Запишемсюда_Потр.unitType;
//									
//									
//									
//									Если Стр_123123.УровеньУпаковки=ПредопределенноеЗначение("Перечисление.УровниУпаковок_ХамелеонЦРПТ.ГрупповаяПотребительскаяУпаковка") тогда
//										Стр_Н.level="inner-pack";
//									ИначеЕсли Стр_123123.УровеньУпаковки=ПредопределенноеЗначение("Перечисление.УровниУпаковок_ХамелеонЦРПТ.ТранспортнаяУпаковка") тогда
//										Стр_Н.level="box";
//									Иначе
//										Стр_Н.level="";
//									Конецесли;
//									Стр_Н.gtin=Стр_123123.КодТовараУпаковки;
//									Стр_Н.gtinInner=Стр_123123.КодТовараВложенияВУпаковку;
//									
//									Стр_Н.name=Стр_123123.НаименованиеУпаковкиТовара;
//									
//									Если ЗначениеЗаполнено(Стр_123123.КоличествоВложенийВУпаковку) тогда
//										Стр_Н.multiplier=Стр_123123.КоличествоВложенийВУпаковку;
//									Конецесли;
//									
//									Если ЗначениеЗаполнено(Стр_123123.ВесБрутто) тогда
//											Стр_Н.weight=Стр_123123.ВесБрутто;
//										Конецесли;
//										Если ЗначениеЗаполнено(Стр_123123.Высота) тогда
//												Стр_Н.height=Стр_123123.Высота;
//											Конецесли;
//											Если ЗначениеЗАполнено(Стр_123123.Глубина) тогда
//												Стр_Н.length=Стр_123123.Глубина
//											
//											;
//										Конецесли;
//										Если ЗначениеЗаполнено(Стр_123123.РасчетныйОбъем) тогда
//												Стр_Н.capacity=Стр_123123.РасчетныйОбъем;		
//											Конецесли;
//											Если ЗначениеЗАполнено(Стр_123123.Ширина) тогда
//												Стр_Н.width=Стр_123123.Ширина;
//											Конецесли;
//												
//												
//												
//												
//												//////////////////////УПАК
//												Для Каждого Стр_Уп Из Стр_Н.vghList Цикл
//													Если Стр_Уп.name="packageType" Тогда
//														Если ЗначениеЗаполнено(Стр_123123.ТипУпаковки) тогда
//															Стр_Уп.value=Строка(Стр_123123.ТипУпаковки);
//														Конецесли;
//													КонецЕсли;
//													Если Стр_Уп.name="packageMaterial" Тогда
//														Если ЗначениеЗаполнено(Стр_123123.МатериалУпаковки) тогда
//															Стр_Уп.value=Строка(Стр_123123.МатериалУпаковки);
//														Конецесли;
//													КонецЕсли;
//												Конеццикла;

//												NNN.identifier.Добавить(Стр_Н);												
//															
//															
//															//Стр_Н.value=Строка(Стр_.Материал);
//															//Стр_Н.valueType=Формат(Стр_.Процент,"ЧГ=") ;
//															// Стр_1.attributes.Вставить();
////															 МассивТиповМатериалов.Добавить(Стр_Н);

//								    Конеццикла;
								
							Конецесли;
							
							
							
							
							////ПО КАЖДОМУ ТИПУ
							
							
					Если GTIN.Тип=ПредопределенноеЗначение("Перечисление.ТипПродукции_ХамелеонЦРПТ.Белье") Тогда
							Для Каждого Стр_1 Из NNN Цикл
								
								
								Если Стр_1.attr_group_name="Наименование товара и идентификация" Тогда
										Если Стр_1.attr_name="Количество единиц употребления в потребительской упаковке" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитБелье.ПотребительскаяУпаковка) Тогда
												
												Структура_добавим=Новый Структура;
												Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
												Структура_добавим.Вставить("attr_value",Формат(ДополнительныйРеквизитБелье.КоличествоВПотребительскойУпаковке,"ЧГ="));
												Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитБелье.ПотребительскаяУпаковка));
												МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												//Стр_а.value=Формат(ДополнительныйРеквизитБелье.КоличествоВПотребительскойУпаковке,"ЧГ=");
												//Стр_а.valueType=Строка(ДополнительныйРеквизитБелье.ПотребительскаяУпаковка)
												
											КонецЕсли;
									 	//ИначеЕсли  Стр_1.attr_name="Заявленный объём / вес нетто" Тогда
											
											
										Конецесли;
									
								ИначеЕсли Стр_1.attr_group_name="Происхождение и бренды" Тогда
										
										Если  Стр_1.attr_name="СТМ" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитБелье.СТМ) Тогда
												Структура_добавим=Новый Структура;
												Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
												Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитБелье.СТМ));
												//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитБелье.ПотребительскаяУпаковка));
												МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитБелье.СТМ);
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Модель / артикул производителя" Тогда
											Если ЗначениеЗаполнено(GTIN.МодельПроизводителяАртикул)
												И ДополнительныйРеквизитБелье.ДопМодельАртикулы.Количество()=0 Тогда
												
												
												Структура_добавим=Новый Структура;
												Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
												Структура_добавим.Вставить("attr_value",GTIN.МодельПроизводителяАртикул);
												Структура_добавим.Вставить("attr_value_type",Строка("Артикул"));
												МассивАтрибутовДляДобавления.Добавить(Структура_добавим);

												
											КонецЕсли;
											Для Каждого Стр_22 Из ДополнительныйРеквизитБелье.ДопМодельАртикулы Цикл
												Если ЗначениеЗаполнено(Стр_22.МодельАртикул) И ЗначениеЗаполнено(Стр_22.ТипМодельАртикул) тогда
													Структура_добавим=Новый Структура;
													Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
													Структура_добавим.Вставить("attr_value",Стр_22.МодельАртикул);
													Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
													МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												Конецесли;
											Конеццикла;
											
										Конецесли;
								
									
									
								ИначеЕсли Стр_1.attr_group_name="Потребительские свойства" Тогда
										
										
										Если  Стр_1.attr_name="Вид товара" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитБелье.ВидИзделия) Тогда
												Структура_добавим=Новый Структура;
												Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
												Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитБелье.ВидИзделия));
												//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
												МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитБелье.ВидИзделия);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитБелье.ВидИзделия);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Цвет" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитБелье.Цвет) Тогда
												Структура_добавим=Новый Структура;
												Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
												Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитБелье.Цвет));
												//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
												МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитБелье.Цвет);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитБелье.Цвет);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Возраст потребителя" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитБелье.ВозрастПотребителя) Тогда
												Структура_добавим=Новый Структура;
												Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
												Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитБелье.ВозрастПотребителя));
												//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
												МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитБелье.ВозрастПотребителя);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитБелье.ВозрастПотребителя);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Тип текстиля" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитБелье.ВидМатериала) Тогда
												Структура_добавим=Новый Структура;
												Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
												Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитБелье.ВидМатериала));
												//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
												МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитБелье.ВидМатериала);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитБелье.ВидМатериала);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
																		
										ИначеЕсли  Стр_1.attr_name="Декоративные элементы" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитБелье.ДекоративныеЭлементы) Тогда
												Структура_добавим=Новый Структура;
												Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
												Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитБелье.ДекоративныеЭлементы));
												//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
												МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитБелье.ДекоративныеЭлементы);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитБелье.ДекоративныеЭлементы);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Дизайн" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитБелье.Дизайн) Тогда
												Структура_добавим=Новый Структура;
												Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
												Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитБелье.Дизайн);
												//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
												МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитБелье.Дизайн;
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Дополнительные характеристики изделия (описание)" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитБелье.ДополнительныеХарактеристики) Тогда
												Структура_добавим=Новый Структура;
												Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
												Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитБелье.ДополнительныеХарактеристики);
												//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
												МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитБелье.ДополнительныеХарактеристики;
											КонецЕсли;
										Конецесли;
									
								ИначеЕсли Стр_1.attr_group_name="Состав" Тогда
										
										
										
										Если  Стр_1.attr_name="Состав" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитБелье.Состав) Тогда
												Структура_добавим=Новый Структура;
												Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
												Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитБелье.Состав);
												//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
												МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитБелье.Состав;
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Комплектация" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитБелье.Комплектация) Тогда
												Структура_добавим=Новый Структура;
												Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
												Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитБелье.Комплектация);
												//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
												МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитБелье.Комплектация;
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Тип материала, %" Тогда
											
											Если ДополнительныйРеквизитБелье.ТипМатериалов.Количество()>0 Тогда
													
												Для Каждого Стр_ Из ДополнительныйРеквизитБелье.ТипМатериалов Цикл
													Если ЗначениеЗаполнено(Стр_.Материал) ИЛИ ЗначениеЗаполнено(Стр_.Процент) Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value",Строка(Стр_.Материал));
														Структура_добавим.Вставить("attr_value_type",Формат(Стр_.Процент,"ЧГ="));
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
													Конецесли;
													Конеццикла;
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Тип материала" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитБелье.ТипМатериала) Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитБелье.ТипМатериала);
														//Структура_добавим.Вставить("attr_value_type",Формат(Стр_.Процент,"ЧГ="));
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитБелье.ТипМатериала;
											КонецЕсли;
																																			
										Конецесли;

								ИначеЕсли Стр_1.attr_group_name="Характеристики товара в состоянии использования" Тогда
									
										Если  Стр_1.attr_name="Размер изделия" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитБелье.РазмерИзделия) Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитБелье.РазмерИзделия);
														//Структура_добавим.Вставить("attr_value_type",Формат(Стр_.Процент,"ЧГ="));
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитБелье.РазмерИзделия;
											КонецЕсли;
										КонецЕсли;
								ИначеЕсли Стр_1.attr_group_name="Эксплуатация и условия хранения" Тогда
										Если  Стр_1.attr_name="Срок службы" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитБелье.ТипСрокаСлужбы) Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитБелье.СрокСлужбы);
														Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитБелье.ТипСрокаСлужбы));
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитБелье.СрокСлужбы;
												//Стр_а.valueType=Строка(ДополнительныйРеквизитБелье.ТипСрокаСлужбы)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Гарантийный срок, от производителя" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитБелье.ТипГарантийногоСрока) Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитБелье.ГарантийныйСрокОтПроизводителя);
														Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитБелье.ТипГарантийногоСрока));
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитБелье.ГарантийныйСрокОтПроизводителя;
												//Стр_а.valueType=Строка(ДополнительныйРеквизитБелье.ТипГарантийногоСрока)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Особые условия хранения" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитБелье.ОсобыеУсловияХранения) Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитБелье.ОсобыеУсловияХранения);
														//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитБелье.ТипГарантийногоСрока);
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитБелье.ОсобыеУсловияХранения;
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Рекомендации по использованию" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитБелье.РекомендацияПоИспользованию) Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитБелье.РекомендацияПоИспользованию);
														//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитБелье.ТипГарантийногоСрока);
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитБелье.РекомендацияПоИспользованию;
											КонецЕсли;
										КонецЕсли;
									
									
								ИначеЕсли Стр_1.attr_group_name="Нормативно-сопроводительная документация" Тогда
										Если  Стр_1.attr_name="Номер Регламента/стандарта" Тогда
											
											Если ДополнительныйРеквизитБелье.НомерРегламента005=Истина Тогда
												
												
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value","ТР ТС 005/2011 ""О безопасности упаковки""");
														//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитБелье.ТипГарантийногоСрока);
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);

												
												
											КонецЕсли;
											
											
											Если ДополнительныйРеквизитБелье.НомерРегламента007=Истина Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value","ТР ТС 007/2011 ""О безопасности продукции, предназначенной для детей и подростков""");
														//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитБелье.ТипГарантийногоСрока);
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
												
											КонецЕсли;
											
											
											Если ДополнительныйРеквизитБелье.НомерРегламента017=Истина Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value","ТР ТС 017/2011 ""О безопасности продукции легкой промышленности""");
														//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитБелье.ТипГарантийногоСрока);
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
												
											КонецЕсли;
											 
											 Если ДополнительныйРеквизитБелье.БезРегламента=Истина Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value","Действие технических регламентов не распространяется");
														//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитБелье.ТипГарантийногоСрока);
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="ГОСТ / ТУ / СТО" Тогда
											
											Если ДополнительныйРеквизитБелье.ГОСТЫИТУ.Количество()>0 Тогда
												
												Для Каждого Стр_ Из ДополнительныйРеквизитБелье.ГОСТЫИТУ Цикл
													
													Если ЗначениеЗаполнено(Стр_.ТипГОСТТУ) ИЛИ ЗначениеЗаполненО(Стр_.ГОСТТУ) Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value",Стр_.ГОСТТУ);
														Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														
													Конецесли;
														
												Конеццикла;
												
											КонецЕсли;

											
											
										Конецесли;
																		
								КонецЕсли;
								
								
							Конеццикла;
							
						ИначеЕсли GTIN.Тип=ПредопределенноеЗначение("Перечисление.ТипПродукции_ХамелеонЦРПТ.Одежда") Тогда
							Для Каждого Стр_1 Из NNN Цикл
								
								
								Если Стр_1.attr_group_name="Наименование товара и идентификация" Тогда
										Если Стр_1.attr_name="Количество единиц употребления в потребительской упаковке" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитОдежда.ПотребительскаяУпаковка) Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value",Формат(ДополнительныеРеквизитОдежда.КоличествоВПотребительскойУпаковке,"ЧГ="));
														Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитОдежда.ПотребительскаяУпаковка));
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Формат(ДополнительныеРеквизитОдежда.КоличествоВПотребительскойУпаковке,"ЧГ=");
												//Стр_а.valueType=Строка(ДополнительныеРеквизитОдежда.ПотребительскаяУпаковка)
												
											КонецЕсли;
									 	//ИначеЕсли  Стр_1.attr_name="Заявленный объём / вес нетто" Тогда
											
											
										Конецесли;
									
								ИначеЕсли Стр_1.attr_group_name="Происхождение и бренды" Тогда
										
										Если  Стр_1.attr_name="СТМ" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитОдежда.СТМ) Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитОдежда.СТМ));
														Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитОдежда.ПотребительскаяУпаковка));
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитОдежда.СТМ);
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Модель / артикул производителя" Тогда
											Если ЗначениеЗаполнено(GTIN.МодельПроизводителяАртикул)
												И ДополнительныйРеквизитБелье.ДопМодельАртикулы.Количество()=0 Тогда
												
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value",GTIN.МодельПроизводителяАртикул);
														Структура_добавим.Вставить("attr_value_type",Строка("Артикул"));
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
											КонецЕсли;
											Для Каждого Стр_22 Из ДополнительныеРеквизитОдежда.ДопМодельАртикулы Цикл
												Если ЗначениеЗАполнено(Стр_22.МодельАртикул)
													ИЛИ ЗначениеЗаполнено(Стр_22.ТипМодельАртикул) Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value",Стр_22.МодельАртикул);
														Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул)  );
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
													Конецесли;
												
												
											Конеццикла;
											
										Конецесли;
									
									
								
									
									
								ИначеЕсли Стр_1.attr_group_name="Потребительские свойства" Тогда
										
										
										Если  Стр_1.attr_name="Вид товара" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитОдежда.ВидИзделия) Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитОдежда.ВидИзделия));
														//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул)  );
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитОдежда.ВидИзделия);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитОдежда.ВидИзделия);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Цвет" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитОдежда.Цвет) Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитОдежда.Цвет));
														//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул)  );
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитОдежда.Цвет);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитОдежда.Цвет);
												///Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Возраст потребителя" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитОдежда.ВозрастПотребителя) Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитОдежда.ВозрастПотребителя));
														//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул)  );
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитОдежда.ВозрастПотребителя);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитОдежда.ВозрастПотребителя);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Целевой пол" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитОдежда.ЦелевойПол) Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитОдежда.ЦелевойПол));
														//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул)  );
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитОдежда.ЦелевойПол);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитОдежда.ЦелевойПол);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Размер одежды" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитОдежда.РазмерИзделияГОСТ) Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитОдежда.РазмерИзделияГОСТДругое);
														Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитОдежда.РазмерИзделияГОСТ) );
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
//												Стр_а.value=ДополнительныеРеквизитОдежда.РазмерИзделияГОСТДругое;
//												Стр_а.valueType=Строка(ДополнительныеРеквизитОдежда.РазмерИзделияГОСТ)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Размер в иных системах измерения" Тогда
											
											Если ДополнительныеРеквизитОдежда.РазмерВИныхСистемахИзмерения.Количество()>0 Тогда
													
												Для Каждого Стр_ Из ДополнительныеРеквизитОдежда.РазмерВИныхСистемахИзмерения Цикл
													Если ЗначениеЗаполнено(Стр_.Размер) ИЛИ ЗначениеЗаполнено(Стр_.Страна) Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value",Стр_.Размер);
														Структура_добавим.Вставить("attr_value_type",Строка(Стр_.Страна));
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
													Конецесли;
														
													Конеццикла;
											КонецЕсли;
																						
										ИначеЕсли  Стр_1.attr_name="Рост" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитОдежда.Рост) Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитОдежда.Рост));
														//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.Страна);
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитОдежда.Рост);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитОдежда.Рост);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Дополнительные характеристики изделия (описание)" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитОдежда.ДополнительныеХарактеристики) Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитОдежда.ДополнительныеХарактеристики);
														//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.Страна);
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитОдежда.ДополнительныеХарактеристики;
											КонецЕсли;
										Конецесли;
									
								ИначеЕсли Стр_1.attr_group_name="Состав" Тогда
										
										
										
										Если  Стр_1.attr_name="Состав" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитОдежда.Состав) Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитОдежда.Состав);
														//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.Страна);
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитОдежда.Состав;
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Комплектация" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитОдежда.Комплектация) Тогда
														Структура_добавим=Новый Структура;
														Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
														Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитОдежда.Комплектация);
														//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.Страна);
														МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитОдежда.Комплектация;
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Тип материала, %" Тогда
											
											Если ДополнительныеРеквизитОдежда.ТипМатериалов.Количество()>0 Тогда
													
													Для Каждого Стр_ Из ДополнительныеРеквизитОдежда.ТипМатериалов Цикл
														
														Если ЗначениеЗаполнено(Стр_.Процент) И ЗначениеЗАполнено(Стр_.Материал) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_.Материал);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_.Процент));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
															
															
														Конецесли;
													Конеццикла;
												
											Конецесли;										
										ИначеЕсли  Стр_1.attr_name="Тип материала" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитОдежда.ТипМатериала) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитОдежда.ТипМатериала);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.Процент));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитОдежда.ТипМатериала;
											КонецЕсли;
																																			
										Конецесли;
										
									
									
								ИначеЕсли Стр_1.attr_group_name="Эксплуатация и условия хранения" Тогда
										Если  Стр_1.attr_name="Срок службы" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитОдежда.ТипСрокаСлужбы) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитОдежда.СрокСлужбы);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитОдежда.ТипСрокаСлужбы));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитОдежда.СрокСлужбы;
												//Стр_а.valueType=Строка(ДополнительныеРеквизитОдежда.ТипСрокаСлужбы)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Гарантийный срок, от производителя" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитОдежда.ТипГарантийногоСрока) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитОдежда.ГарантийныйСрокОтПроизводителя);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитОдежда.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитОдежда.ГарантийныйСрокОтПроизводителя;
												//Стр_а.valueType=Строка(ДополнительныеРеквизитОдежда.ТипГарантийногоСрока)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Особые условия хранения" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитОдежда.ОсобыеУсловияХранения) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитОдежда.ОсобыеУсловияХранения);
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитОдежда.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитОдежда.ОсобыеУсловияХранения;
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Рекомендации по использованию" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитОдежда.РекомендацияПоИспользованию) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитОдежда.РекомендацияПоИспользованию);
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитОдежда.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитОдежда.РекомендацияПоИспользованию;
											КонецЕсли;
										КонецЕсли;
									
								ИначеЕсли Стр_1.attr_group_name="Нормативно-сопроводительная документация" Тогда
										Если  Стр_1.attr_name="Номер Регламента/стандарта" Тогда
											
											Если ДополнительныеРеквизитОдежда.НомерРегламента005=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 005/2011 ""О безопасности упаковки""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитОдежда.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
											КонецЕсли;
											
											
											Если ДополнительныеРеквизитОдежда.НомерРегламента007=Истина Тогда
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 007/2011 ""О безопасности продукции, предназначенной для детей и подростков""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитОдежда.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
											КонецЕсли;
											
											
											Если ДополнительныеРеквизитОдежда.НомерРегламента017=Истина Тогда
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 017/2011 ""О безопасности продукции легкой промышленности""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитОдежда.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
												
											КонецЕсли;
											 
											
											Если ДополнительныеРеквизитОдежда.НомерРегламента019=Истина Тогда
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 019/2011 ""О безопасности средств индивидуальной защиты""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитОдежда.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
												
												
											КонецЕсли;
											 
											Если ДополнительныеРеквизитОдежда.БезРегламента=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","Действие технических регламентов не распространяется");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитОдежда.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="ГОСТ / ТУ / СТО" Тогда
											
											Если ДополнительныеРеквизитОдежда.ГОСТЫИТУ.Количество()>0 Тогда
												
												Для Каждого Стр_ Из ДополнительныеРеквизитОдежда.ГОСТЫИТУ Цикл
													       Если ЗначениеЗАполнено(Стр_.ГОСТТУ) ИЛИ ЗначениеЗАполненО(Стр_.ТипГОСТТУ) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_.ГОСТТУ);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														Конецесли;
													
												Конеццикла;
												
											КонецЕсли;
											
										КонецЕсли;

										
									КонецЕсли;
											
									
								
							Конеццикла;
							
							
						ИначеЕсли GTIN.Тип=ПредопределенноеЗначение("Перечисление.ТипПродукции_ХамелеонЦРПТ.Велосипеды") Тогда
							Для Каждого Стр_1 Из NNN Цикл
								
								Если Стр_1.attr_group_name="Происхождение и бренды" Тогда
										
										Если  Стр_1.attr_name="СТМ" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.СТМ) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.СТМ));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.СТМ);
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Модель / артикул производителя" Тогда
											Если ЗначениеЗаполнено(GTIN.МодельПроизводителяАртикул)
												И ДополнительныйРеквизитБелье.ДопМодельАртикулы.Количество()=0 Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",GTIN.МодельПроизводителяАртикул);
															Структура_добавим.Вставить("attr_value_type",Строка("Артикул"));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
											КонецЕсли;
											Для Каждого Стр_22 Из ДополнительныйРеквизитВелосипед.ДопМодельАртикулы Цикл
												Если ЗначениеЗаполнено(Стр_22.МодельАртикул) ИЛИ ЗначениеЗАполнено(Стр_22.ТипМодельАртикул) Тогда
																Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_22.МодельАртикул);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
															
														Конецесли;
											Конеццикла;
											
										Конецесли;
									
									
								ИначеЕсли Стр_1.attr_group_name="Потребительские свойства" Тогда
										
										
										Если  Стр_1.attr_name="Вид товара" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ТипВелосипеда) Тогда
																Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_22.МодельАртикул);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
											
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.ТипВелосипеда);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитВелосипед.ТипВелосипеда);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Класс велосипеда" Тогда
											Если Значениезаполнено(ДополнительныйРеквизитВелосипед.КлассВелосипеда) тогда
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.КлассВелосипеда));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.КлассВелосипеда);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитВелосипед.КлассВелосипеда);
												//Стр_а.valueType=Неопределено
											Конецесли;

											
										ИначеЕсли  Стр_1.attr_name="Цвет" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.Цвет) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.Цвет));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.Цвет);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитВелосипед.Цвет);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Возраст потребителя" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ВозрастПотребителя) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.ВозрастПотребителя));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.ВозрастПотребителя);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитВелосипед.ВозрастПотребителя);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Пол целевого потребителя" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ПолЦелевогоПотребителя) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.ПолЦелевогоПотребителя));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.ПолЦелевогоПотребителя);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитВелосипед.ПолЦелевогоПотребителя);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Год производства" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ГодПроизводства) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.ГодПроизводства));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.ГодПроизводства);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитВелосипед.ГодПроизводства);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Размер рамы" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ЕдиницаИзмеренияРазмераРамы) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.РазмерРамы));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.РазмерРамы);
												//Стр_а.valueType=НРег(Строка(ДополнительныйРеквизитВелосипед.ЕдиницаИзмеренияРазмераРамы))
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Материал рамы" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.МатериалРамы) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.МатериалРамы));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.МатериалРамы);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитВелосипед.МатериалРамы);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Тип тормозной системы" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ТипТормознойСистемы) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.ТипТормознойСистемы));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.ТипТормознойСистемы);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитВелосипед.ТипТормознойСистемы);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Тип конструкции рамы" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ТипКонструкцииРамы) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.ТипКонструкцииРамы));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.ТипКонструкцииРамы);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитВелосипед.ТипКонструкцииРамы);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Тип передней вилки" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ТипПереднейВилки) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.ТипПереднейВилки));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.ТипПереднейВилки);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитВелосипед.ТипПереднейВилки);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Ширина профиля шины (камеры), дюйм" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ШиринаПрофиляШины) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.ШиринаПрофиляШины));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.ШиринаПрофиляШины);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитВелосипед.ШиринаПрофиляШины);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Номинальный посадочный диаметр обода, дюйм" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ПосадочныйДиамтерОбода) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.ПосадочныйДиамтерОбода));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.ПосадочныйДиамтерОбода);
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Номинальный посадочный диаметр обода, мм" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.НоминальныйПосадочныйДиаметрОбодаВмм) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.НоминальныйПосадочныйДиаметрОбодаВмм));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.НоминальныйПосадочныйДиаметрОбодаВмм);
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Количество колес" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.КоличествоКолес) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.КоличествоКолес));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.КоличествоКолес);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитВелосипед.КоличествоКолес);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Тип колесных дисков" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ТипКолесныхДисков) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.ТипКолесныхДисков));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.ТипКолесныхДисков);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитВелосипед.ТипКолесныхДисков);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Колесная база, мм" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.КолеснаяБаза) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.КолеснаяБаза));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.КолеснаяБаза);
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Дорожный просвет, мм" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ДорожныйПросвет) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.ДорожныйПросвет));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.ДорожныйПросвет);
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Тип подвески" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ТипПодвески) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.ТипПодвески));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.ТипПодвески);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитВелосипед.ТипПодвески);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Количество скоростей" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.КоличествоСкоростей) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.КоличествоСкоростей));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.КоличествоСкоростей);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитВелосипед.КоличествоСкоростей);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Материал подкрылков" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.МатериалПодкрылок) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.КоличествоСкоростей));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.МатериалПодкрылок);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитВелосипед.МатериалПодкрылок);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Расположение фар" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.РасположениеФар) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.РасположениеФар));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.РасположениеФар);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитВелосипед.РасположениеФар);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Наличие кофра" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.НаличиеКофра) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитВелосипед.НаличиеКофра));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитВелосипед.НаличиеКофра);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитВелосипед.НаличиеКофра);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Максимальная нагрузка, кг" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.МаксимальнаяНагрузка) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитВелосипед.МаксимальнаяНагрузка);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитВелосипед.МаксимальнаяНагрузка;
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Дополнительные характеристики изделия (описание)" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ДополнительныеХарактеристики) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитВелосипед.ДополнительныеХарактеристики);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитВелосипед.ДополнительныеХарактеристики;
											КонецЕсли;
										Конецесли;
								
								ИначеЕсли Стр_1.attr_group_name="Состав" Тогда
										Если  Стр_1.attr_name="Комплектация" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.Состав) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитВелосипед.Состав);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитВелосипед.Состав;
											КонецЕсли;
											
										Конецесли;
									
								ИначеЕсли Стр_1.attr_group_name="Характеристики товара в состоянии использования" Тогда
									Если Стр_1.attr_name="Конструктивная масса, кг" Тогда
										Если ЗначениеЗаполненО(ДополнительныйРеквизитВелосипед.КонструктивнаяМасса) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитВелосипед.КонструктивнаяМасса);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														КонецЕсли;
											//Стр_2.value=ДополнительныйРеквизитВелосипед.КонструктивнаяМасса;
										ИначеЕсли  Стр_1.attr_name="Длина изделия" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ДлинаЕдиницаИзмерения) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитВелосипед.Длина);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитВелосипед.ДлинаЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитВелосипед.Длина;
												//Стр_а.valueType=Строка(ДополнительныйРеквизитВелосипед.ДлинаЕдиницаИзмерения)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Ширина изделия" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ШиринаЕдиницаИзмерения) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитВелосипед.Ширина);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитВелосипед.ШиринаЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитВелосипед.Ширина;
												//Стр_а.valueType=Строка(ДополнительныйРеквизитВелосипед.ШиринаЕдиницаИзмерения)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Высота изделия" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ВысотаЕдиницаИзмерения) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитВелосипед.Высота);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитВелосипед.ВысотаЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитВелосипед.Высота;
												//Стр_а.valueType=Строка(ДополнительныйРеквизитВелосипед.ВысотаЕдиницаИзмерения)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Длина сложенного изделия" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ДлинаСложенногоИзделияЕдиницаИзмерения) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитВелосипед.ДлинаСложенногоИзделия);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитВелосипед.ДлинаСложенногоИзделияЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитВелосипед.ДлинаСложенногоИзделия;
												//Стр_а.valueType=Строка(ДополнительныйРеквизитВелосипед.ДлинаСложенногоИзделияЕдиницаИзмерения)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Ширина сложенного изделия" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ШиринаСложенногоИзделияЕдиницаИзмерения) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитВелосипед.ШиринаСложенногоИзделия);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитВелосипед.ШиринаСложенногоИзделияЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитВелосипед.ШиринаСложенногоИзделия;
												//Стр_а.valueType=Строка(ДополнительныйРеквизитВелосипед.ШиринаСложенногоИзделияЕдиницаИзмерения)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Высота сложенного изделия" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ВысотаСложенногоИзделияЕдиницыИзмерения) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитВелосипед.ВысотаСложенногоИзделния);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитВелосипед.ВысотаСложенногоИзделияЕдиницыИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитВелосипед.ВысотаСложенногоИзделния;
												//Стр_а.valueType=Строка(ДополнительныйРеквизитВелосипед.ВысотаСложенногоИзделияЕдиницыИзмерения)
											КонецЕсли;
										Конецесли;
									
									
									
									
								ИначеЕсли Стр_1.attr_group_name="Эксплуатация и условия хранения" Тогда
										Если  Стр_1.attr_name="Срок службы" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ТипСрокаСлужбы) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитВелосипед.СрокСлужбы);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитВелосипед.ТипСрокаСлужбы));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитВелосипед.СрокСлужбы;
												//Стр_а.valueType=Строка(ДополнительныйРеквизитВелосипед.ТипСрокаСлужбы)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Гарантийный срок, от производителя" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ТипГарантийногоСрока) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитВелосипед.ГарантийныйСрокОтПроизводителя);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитВелосипед.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитВелосипед.ГарантийныйСрокОтПроизводителя;
												//Стр_а.valueType=Строка(ДополнительныйРеквизитВелосипед.ТипГарантийногоСрока)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Особые условия хранения" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.ОсобыеУсловияХранения) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитВелосипед.ОсобыеУсловияХранения);
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитВелосипед.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитВелосипед.ОсобыеУсловияХранения;
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Рекомендации по использованию" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитВелосипед.РекомендацияПоИспользованию) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитВелосипед.РекомендацияПоИспользованию);
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитВелосипед.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитВелосипед.РекомендацияПоИспользованию;
											КонецЕсли;
										КонецЕсли;
									
									
								ИначеЕсли Стр_1.attr_group_name="Нормативно-сопроводительная документация" Тогда
									МассивНормативово=Новый Массив;
									МассивНормативово.Очистить();
										Если  Стр_1.attr_name="Номер Регламента/стандарта" Тогда
											
											Если ДополнительныйРеквизитВелосипед.НомерРегламента005=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 005/2011 ""О безопасности упаковки""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитВелосипед.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);

												
											КонецЕсли;
											
											
											Если ДополнительныйРеквизитВелосипед.НомерРегламента007=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 007/2011 ""О безопасности продукции, предназначенной для детей и подростков""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитВелосипед.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
											КонецЕсли;
											
											
											Если ДополнительныйРеквизитВелосипед.НомерРегламента010=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 010/2011 ""О безопасности машин и оборудования""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитВелосипед.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
											КонецЕсли;
											 
											
											Если ДополнительныйРеквизитВелосипед.НомерРегламента012=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 012/2011 ""О безопасности оборудования для работы во взрывоопасных средах""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитВелосипед.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
											КонецЕсли;
											 
											Если ДополнительныйРеквизитВелосипед.НомерРегламента018=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 018/2011 ""О безопасности колесных транспортных средств""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитВелосипед.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
												
												
											КонецЕсли;

											
											
										;
											КонецЕсли;
										//Конецесли;
									
								КонецЕсли;
								
								
							Конеццикла;
						ИначеЕсли GTIN.Тип=ПредопределенноеЗначение("Перечисление.ТипПродукции_ХамелеонЦРПТ.Фото") Тогда
							Для Каждого Стр_1 Из NNN Цикл
								
								Если Стр_1.attr_group_name="Наименование товара и идентификация" Тогда
										Если Стр_1.attr_name="Количество единиц употребления в потребительской упаковке" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитФото.ПотребительскаяУпаковка) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Формат(ДополнительныеРеквизитФото.КоличествоВПотребительскойУпаковке,"ЧГ="));
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитФото.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												//Стр_а.value=Формат(ДополнительныеРеквизитФото.КоличествоВПотребительскойУпаковке,"ЧГ=");
												//Стр_а.valueType=Строка(ДополнительныеРеквизитФото.ПотребительскаяУпаковка)
												
											КонецЕсли;
									 	//ИначеЕсли  Стр_1.attr_name="Заявленный объём / вес нетто" Тогда
											
											
										Конецесли;
									
									
								ИначеЕсли Стр_1.attr_group_name="Происхождение и бренды" Тогда
										
										Если  Стр_1.attr_name="Модель / артикул производителя" Тогда
											
											Если ЗначениеЗаполнено(GTIN.МодельПроизводителяАртикул)
												И ДополнительныйРеквизитБелье.ДопМодельАртикулы.Количество()=0 Тогда
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",GTIN.МодельПроизводителяАртикул);
															Структура_добавим.Вставить("attr_value_type",Строка("Артикул"));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
											КонецЕсли;
											Для Каждого Стр_22 Из ДополнительныеРеквизитФото.ДопМодельАртикулы Цикл
												Если ЗначениеЗаполнено(Стр_22.МодельАртикул) ИЛИ ЗначениеЗаполнено(Стр_22.ТипМодельАртикул) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_22.МодельАртикул);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														Конецесли;
												
											Конеццикла;
											
										Конецесли;
									
									
									
								ИначеЕсли Стр_1.attr_group_name="Потребительские свойства" Тогда
										
										
										Если  Стр_1.attr_name="Вид товара" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитФото.ТипИзделия) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитФото.ТипИзделия));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
//												Стр_а.value=Строка(ДополнительныеРеквизитФото.ТипИзделия);
//												Стр_а.valueTitle=Строка(ДополнительныеРеквизитФото.ТипИзделия);
//												Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Материал изделия" Тогда
											Если Значениезаполнено(ДополнительныеРеквизитФото.МатериалИзделия) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитФото.МатериалИзделия));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												//Стр_а.value=Строка(ДополнительныеРеквизитФото.МатериалИзделия);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитФото.МатериалИзделия);
												//Стр_а.valueType=Неопределено
											Конецесли;

											
										ИначеЕсли  Стр_1.attr_name="Цвет" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитФото.Цвет) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитФото.Цвет));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитФото.Цвет);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитФото.Цвет);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										Конецесли;
								
								ИначеЕсли Стр_1.attr_group_name="Состав" Тогда
										Если  Стр_1.attr_name="Комплектация" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитФото.Состав) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитФото.Состав);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитФото.Состав;
											КонецЕсли;
											
										Конецесли;
									
								ИначеЕсли Стр_1.attr_group_name="Эксплуатация и условия хранения" Тогда
										Если  Стр_1.attr_name="Срок службы" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитФото.ТипСрокаСлужбы) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитФото.СрокСлужбы);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитФото.ТипСрокаСлужбы));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитФото.СрокСлужбы;
												//Стр_а.valueType=Строка(ДополнительныеРеквизитФото.ТипСрокаСлужбы)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Рекомендации по использованию" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитФото.РекомендацияПоИспользованию) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитФото.РекомендацияПоИспользованию);
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитФото.ТипСрокаСлужбы));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитФото.РекомендацияПоИспользованию;
											КонецЕсли;
										КонецЕсли;
									
									
								ИначеЕсли Стр_1.attr_group_name="Нормативно-сопроводительная документация" Тогда
									Если  Стр_1.attr_name="Номер Регламента/стандарта" Тогда
											Если ДополнительныеРеквизитФото.НомерРегламента004 Тогда
										
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 004/2011 ""О безопасности низковольтного оборудования""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитФото.ТипСрокаСлужбы));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
											КонецЕсли;
											
											
											Если ДополнительныеРеквизитФото.НомерРегламента005=Истина Тогда
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 005/2011 ""О безопасности упаковки""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитФото.ТипСрокаСлужбы));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
																								
											КонецЕсли;
											
											
											Если ДополнительныеРеквизитФото.НомерРегламента012=Истина Тогда
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 012/2011 ""О безопасности оборудования для работы во взрывоопасных средах""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитФото.ТипСрокаСлужбы));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
																								
												
											КонецЕсли;
											
											
											Если ДополнительныеРеквизитФото.НомерРегламента020=Истина Тогда
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 020/2011 ""Электромагнитная совместимость технических средств""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитФото.ТипСрокаСлужбы));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
											КонецЕсли;
											 
											
											Если ДополнительныеРеквизитФото.НомерРегламента037=Истина Тогда
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ЕАЭС 037/2016 ""Об ограничении применения опасных веществ в изделиях электротехники и радиоэлектроники""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитФото.ТипСрокаСлужбы));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
																								
											КонецЕсли;
											 
										Конецесли;
									
									
								КонецЕсли;
								
								
							//	Если Стр_1.attr_group_name="Состав" Тогда
							//		Стр_1.attributes[0].value="Мой состав";
							//	КонецЕсли;
								
							Конеццикла;
						
						
						ИначеЕсли GTIN.Тип=ПредопределенноеЗначение("Перечисление.ТипПродукции_ХамелеонЦРПТ.Парфюм") Тогда
														
							Для Каждого Стр_1 Из NNN Цикл
								
								Если Стр_1.attr_group_name="Наименование товара и идентификация" Тогда
										Если Стр_1.attr_name="Заявленный объём / вес нетто" Тогда
											//Стр_а.value=GTIN
											Если ЗначениеЗаполнено(ДополнительныйРеквизитПарфюм.Объем)
												И Значениезаполнено(ДополнительныйРеквизитПарфюм.ЕдиницаИзмеренияОбъема) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",формат(ДополнительныйРеквизитПарфюм.Объем,"ЧГ=ЧРД=""."""));
															Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныйРеквизитПарфюм.ЕдиницаИзмеренияОбъема)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
																								
												
												//Стр_а.value=формат(ДополнительныйРеквизитПарфюм.Объем,"ЧГ=ЧРД="".""");
												//Стр_а.valueType=НРег(Строка(ДополнительныйРеквизитПарфюм.ЕдиницаИзмеренияОбъема))
											Конецесли;
											
										ИначеЕсли Стр_1.attr_name="Количество единиц употребления в потребительской упаковке" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитПарфюм.ПотребительскаяУпаковка) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Формат(ДополнительныйРеквизитПарфюм.КоличествоВПотребительскойУпаковке,"ЧГ="));
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитПарфюм.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Формат(ДополнительныйРеквизитПарфюм.КоличествоВПотребительскойУпаковке,"ЧГ=");
												//Стр_а.valueType=Строка(ДополнительныйРеквизитПарфюм.ПотребительскаяУпаковка)
												
											КонецЕсли;
									 	//ИначеЕсли  Стр_1.attr_name="Заявленный объём / вес нетто" Тогда
											
											
										Конецесли;
										
								ИначеЕсли Стр_1.attr_group_name="Потребительские свойства" Тогда
										Если  Стр_1.attr_name="Тип парфюмерии" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитПарфюм.ТипПарфюмерии) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитПарфюм.ТипПарфюмерии));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитПарфюм.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитПарфюм.ТипПарфюмерии);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитПарфюм.ТипПарфюмерии);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Возраст потребителя" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитПарфюм.ВозрастПотребителя) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитПарфюм.ВозрастПотребителя));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитПарфюм.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитПарфюм.ВозрастПотребителя);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитПарфюм.ВозрастПотребителя);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Пол целевого потребителя" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитПарфюм.ПолЦелевогоПотребителя) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитПарфюм.ПолЦелевогоПотребителя));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитПарфюм.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитПарфюм.ПолЦелевогоПотребителя);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитПарфюм.ПолЦелевогоПотребителя);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Форма / состояние / формат" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитПарфюм.ФормаСостояниеФормат) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитПарфюм.ФормаСостояниеФормат);
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитПарфюм.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитПарфюм.ФормаСостояниеФормат);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитПарфюм.ФормаСостояниеФормат);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Тип дозатора" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитПарфюм.ТипДозатора) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитПарфюм.ТипДозатора));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитПарфюм.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитПарфюм.ТипДозатора);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитПарфюм.ТипДозатора);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Селектив" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитПарфюм.Селектив) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитПарфюм.Селектив));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитПарфюм.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитПарфюм.Селектив);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитПарфюм.Селектив);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Тип аромата" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитПарфюм.ТипАромата) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитПарфюм.ТипАромата));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитПарфюм.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитПарфюм.ТипАромата);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитПарфюм.ТипАромата);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Входящие в аромат ноты" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитПарфюм.ВходящиеВАроматНоты) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитПарфюм.ВходящиеВАроматНоты));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитПарфюм.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитПарфюм.ВходящиеВАроматНоты);;
											КонецЕсли;
											
										ИначеЕсли Стр_1.attr_name="Дополнительные характеристики изделия (описание)" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитПарфюм.ДополнительныеХарактеристики) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитПарфюм.ДополнительныеХарактеристики));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитПарфюм.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитПарфюм.ДополнительныеХарактеристики);;
											КонецЕсли;
										Конецесли;
									//Конеццикла;
									
									
								
								ИначеЕсли Стр_1.attr_group_name="Эксплуатация и условия хранения" Тогда
										Если  Стр_1.attr_name="Срок годности" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитПарфюм.ТипСрокаГодности) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитПарфюм.СрокГодности);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитПарфюм.ТипСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитПарфюм.СрокГодности;
												//Стр_а.valueType=Строка(ДополнительныйРеквизитПарфюм.ТипСрокаГодности)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Особые условия хранения" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитПарфюм.ОсобыеУсловияХранения) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитПарфюм.ОсобыеУсловияХранения);
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитПарфюм.ТипСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитПарфюм.ОсобыеУсловияХранения;
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Рекомендации по использованию" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитПарфюм.РекомендацияПоИспользованию) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитПарфюм.РекомендацияПоИспользованию);
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитПарфюм.ТипСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитПарфюм.РекомендацияПоИспользованию;
											КонецЕсли;
										
										ИначеЕсли  Стр_1.attr_name="Альтернативный срок годности" Тогда
											
											Если ДополнительныйРеквизитПарфюм.ДополнительныеСрокиГодности.Количество()>0 Тогда
												
												Для Каждого Стр_ Из ДополнительныйРеквизитПарфюм.ДополнительныеСрокиГодности Цикл
													Если ЗначениеЗаполнено(Стр_.СрокГодности) ИЛИ ЗначениеЗаполнено(Стр_.ТипДополнительногоСрокаГодности) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_.СрокГодности);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипДополнительногоСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
													Конецесли;
															
													Конеццикла;
												КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Дополнительный срок годности" Тогда
											
											Если ДополнительныйРеквизитПарфюм.ДополнительныеСрокиГодности.Количество()>0 Тогда
												
												Для Каждого Стр_ Из ДополнительныйРеквизитПарфюм.ДополнительныеСрокиГодности Цикл
													Если ЗначениеЗАполненО(Стр_.СрокГодности) ИЛИ ЗначениеЗаполнено(Стр_.ТипДополнительногоСрокаГодности) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_.СрокГодности);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипДополнительногоСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														Конецесли;
															
													Конеццикла;
												КонецЕсли;
											КонецЕсли;
										//Конецесли;
										
								ИначеЕсли Стр_1.attr_group_name="Рекомендации производителя" Тогда
										Если Стр_1.attr_name="Меры предосторожности" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитПарфюм.МерыПредосторожности) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитПарфюм.МерыПредосторожности));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипДополнительногоСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитПарфюм.МерыПредосторожности);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитПарфюм.МерыПредосторожности);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										КонецЕсли;
								ИначеЕсли Стр_1.attr_group_name="Характеристики товара в состоянии использования" Тогда
										Если  Стр_1.attr_name="Ширина изделия" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитПарфюм.ШиринаЕдиницаИзмерения) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитПарфюм.Ширина);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитПарфюм.ШиринаЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитПарфюм.Ширина;
												//Стр_а.valueType=Строка(ДополнительныйРеквизитПарфюм.ШиринаЕдиницаИзмерения)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Высота изделия" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитПарфюм.ВысотаЕдиницаИзмерения) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитПарфюм.Высота);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитПарфюм.ВысотаЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитПарфюм.Высота;
												//Стр_а.valueType=Строка(ДополнительныйРеквизитПарфюм.ВысотаЕдиницаИзмерения)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Глубина изделия" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитПарфюм.ГлубинаЕдиницаИзмерения) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитПарфюм.Глубина);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитПарфюм.ГлубинаЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитПарфюм.Глубина;
												//Стр_а.valueType=Строка(ДополнительныйРеквизитПарфюм.ГлубинаЕдиницаИзмерения)
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Тип упаковки использования" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитПарфюм.ТипУпаковкиИспользования) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитПарфюм.ТипУпаковкиИспользования));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитПарфюм.ГлубинаЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитПарфюм.ТипУпаковкиИспользования);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитПарфюм.ТипУпаковкиИспользования);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Материал упаковки использования" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитПарфюм.МатериалУпаковки) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитПарфюм.МатериалУпаковки));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитПарфюм.ГлубинаЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитПарфюм.МатериалУпаковки);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитПарфюм.МатериалУпаковки);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										Конецесли;
									
									
								ИначеЕсли Стр_1.attr_group_name="Нормативно-сопроводительная документация" Тогда
									
										Если  Стр_1.attr_name="Номер Регламента/стандарта" Тогда
											
											Если ДополнительныйРеквизитПарфюм.НомерРегламента005=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 005/2011 ""О безопасности упаковки""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитПарфюм.ГлубинаЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
											КонецЕсли;
											 
											Если ДополнительныйРеквизитПарфюм.НомерРегламента029=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 029/2012 ""Требования к безопасности пищевых добавок, ароматизаторов и технологических вспомогательных средств""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитПарфюм.ГлубинаЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
																								
											КонецЕсли;
											

											Если ДополнительныйРеквизитПарфюм.НомерРегламента009=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 009/2011 ""О безопасности парфюмерно-косметической продукции""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитПарфюм.ГлубинаЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
												
											КонецЕсли;
											

																						
											
											
										ИначеЕсли  Стр_1.attr_name="ГОСТ / ТУ / СТО" Тогда
											
											Если ДополнительныйРеквизитПарфюм.ГОСТЫИТУ.Количество()>0 Тогда
												
												Для Каждого Стр_ Из ДополнительныйРеквизитПарфюм.ГОСТЫИТУ Цикл
													Если ЗначениеЗаполнено(Стр_.ГОСТТУ) ИЛИ ЗначениеЗаполненО(Стр_.ТипГОСТТУ) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_.ГОСТТУ);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														Конецесли;
																										Конеццикла;
												КонецЕсли;
											КонецЕсли;
										//Конецесли;
									
									
									
									
								ИначеЕсли Стр_1.attr_group_name="Состав" Тогда
										Если  Стр_1.attr_name="Состав" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитПарфюм.Состав) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитПарфюм.Состав);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитПарфюм.Состав;
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Комплектация" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитПарфюм.Комплектация) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитПарфюм.Комплектация);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитПарфюм.Комплектация;
											КонецЕсли;
											
										Конецесли;
										
																	
								КонецЕсли;
								
								
								
							//	Если Стр_1.attr_group_name="Состав" Тогда
							//		Стр_1.attributes[0].value="Мой состав";
							//	КонецЕсли;
								
							Конеццикла;
							
							
						ИначеЕсли GTIN.Тип=ПредопределенноеЗначение("Перечисление.ТипПродукции_ХамелеонЦРПТ.Шины") Тогда
							Для Каждого Стр_1 Из NNN Цикл
								
								Если Стр_1.attr_group_name="Происхождение и бренды" Тогда
										Если  Стр_1.attr_name="Модель / артикул производителя" Тогда
											Если ЗначениеЗаполнено(GTIN.МодельПроизводителяАртикул)
												И ДополнительныйРеквизитБелье.ДопМодельАртикулы.Количество()=0 Тогда
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",GTIN.МодельПроизводителяАртикул);
															Структура_добавим.Вставить("attr_value_type",Строка("Артикул"));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
											КонецЕсли;
											Для Каждого Стр_22 Из ДополнительныеРеквизитыШины.ДопМодельАртикулы Цикл
												Если ЗначениеЗаполнено(Стр_22.МодельАртикул) ИЛИ ЗначениеЗаполнено(Стр_22.ТипМодельАртикул) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_22.МодельАртикул);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
															
													Конецесли;
												
											Конеццикла;
											
										Конецесли;

									
								ИначеЕсли Стр_1.attr_group_name="Потребительские свойства" Тогда
										Если  Стр_1.attr_name="Целевое использование/применение" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.ЦелевоеИспользование) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитыШины.ЦелевоеИспользование));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитыШины.ЦелевоеИспользование);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитыШины.ЦелевоеИспользование);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Ширина профиля шины (камеры), мм/дюйм" Тогда
											Если Значениезаполнено(ДополнительныеРеквизитыШины.ЕдиницаИзмерения) тогда
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитыШины.ШиринаПрофиляШины);
															Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитыШины.ЕдиницаИзмерения)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитыШины.ШиринаПрофиляШины;
												//Стр_а.valueType=НРег(Строка(ДополнительныеРеквизитыШины.ЕдиницаИзмерения))
											Конецесли;

											
										ИначеЕсли  Стр_1.attr_name="Ширина профиля шины (камеры), дюйм" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.ШиринаПрофиляШиныКамерыДюйм) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитыШины.ШиринаПрофиляШиныКамерыДюйм));
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитыШины.ЕдиницаИзмерения)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитыШины.ШиринаПрофиляШиныКамерыДюйм);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитыШины.ШиринаПрофиляШиныКамерыДюйм);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
											
										ИначеЕсли  Стр_1.attr_name="Номинальное отношение высоты профиля шины к его ширине, %" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.НоминальноеОтношениеВысотыПрофиляШиныКЕгоШирине) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитыШины.НоминальноеОтношениеВысотыПрофиляШиныКЕгоШирине));
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитыШины.ЕдиницаИзмерения)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитыШины.НоминальноеОтношениеВысотыПрофиляШиныКЕгоШирине);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитыШины.НоминальноеОтношениеВысотыПрофиляШиныКЕгоШирине);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Тип конструкции каркаса шины" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.ТипКонструкцииКаркасаШины) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитыШины.ТипКонструкцииКаркасаШины));
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитыШины.ЕдиницаИзмерения)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитыШины.ТипКонструкцииКаркасаШины);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитыШины.ТипКонструкцииКаркасаШины);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Номинальный посадочный диаметр обода, дюйм" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.ПосадочныйДиамтерОбода) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитыШины.ПосадочныйДиамтерОбода);
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитыШины.ЕдиницаИзмерения)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитыШины.ПосадочныйДиамтерОбода;
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Номинальный посадочный диаметр обода, мм" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.НоминальныйПосадочныйДиаметрОбодаВМм) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитыШины.НоминальныйПосадочныйДиаметрОбодаВМм);
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитыШины.ЕдиницаИзмерения)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитыШины.НоминальныйПосадочныйДиаметрОбодаВМм;
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Индекс нагрузки на шину" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.ИндексНагрузкиНаШину) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитыШины.ИндексНагрузкиНаШину));
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитыШины.ЕдиницаИзмерения)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитыШины.ИндексНагрузкиНаШину);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитыШины.ИндексНагрузкиНаШину);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Категория скорости" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.КатегорияСкорости) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитыШины.КатегорияСкорости));
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитыШины.ЕдиницаИзмерения)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитыШины.КатегорияСкорости);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитыШины.КатегорияСкорости);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Сезонность" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.Сезонность) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитыШины.Сезонность));
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитыШины.ЕдиницаИзмерения)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитыШины.Сезонность);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитыШины.Сезонность);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Тип шины по способу герметизации" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.ТипШиныПоСпособуГерметизации) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитыШины.ТипШиныПоСпособуГерметизации));
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитыШины.ЕдиницаИзмерения)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитыШины.ТипШиныПоСпособуГерметизации);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитыШины.ТипШиныПоСпособуГерметизации);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Наружный диаметр" Тогда
											Если Значениезаполнено(ДополнительныеРеквизитыШины.ЕдиинцаНаружногоДиаметра) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитыШины.НаружныйДиаметр);
															Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитыШины.ЕдиинцаНаружногоДиаметра)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												//Стр_а.value=ДополнительныеРеквизитыШины.НаружныйДиаметр;
												//Стр_а.valueType=НРег(Строка(ДополнительныеРеквизитыШины.ЕдиинцаНаружногоДиаметра))
											Конецесли;
										ИначеЕсли  Стр_1.attr_name="Топливная экономичность" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.ТопливнаяЭкономичность) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитыШины.ТопливнаяЭкономичность));
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитыШины.ЕдиинцаНаружногоДиаметра)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитыШины.ТопливнаяЭкономичность);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитыШины.ТопливнаяЭкономичность);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Индекс сцепления с мокрой дорогой" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.ИндексСцепленияСМокройДорогой) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитыШины.ИндексСцепленияСМокройДорогой));
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитыШины.ЕдиинцаНаружногоДиаметра)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитыШины.ИндексСцепленияСМокройДорогой);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитыШины.ИндексСцепленияСМокройДорогой);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Уровень шума, в децибелах (dB)" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.УровеньШумаВДецибелах) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитыШины.УровеньШумаВДецибелах);
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитыШины.ЕдиинцаНаружногоДиаметра)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитыШины.УровеньШумаВДецибелах;
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Рисунок протектора" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.РисунокПротектроа) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитыШины.РисунокПротектроа));
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитыШины.ЕдиинцаНаружногоДиаметра)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитыШины.РисунокПротектроа);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитыШины.РисунокПротектроа);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Технология RunFlat" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.ТехнологияRunFlat) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитыШины.ТехнологияRunFlat));
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитыШины.ЕдиинцаНаружногоДиаметра)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитыШины.ТехнологияRunFlat);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитыШины.ТехнологияRunFlat);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Усиленная шина (XL, Extra Load)" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.УсиленнаяШина) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитыШины.УсиленнаяШина));
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитыШины.ЕдиинцаНаружногоДиаметра)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитыШины.УсиленнаяШина);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитыШины.УсиленнаяШина);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Шины с цельнометаллическим кордом" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.ШинаСЦельнометаллическимКордом) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитыШины.ШинаСЦельнометаллическимКордом));
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитыШины.ЕдиинцаНаружногоДиаметра)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитыШины.ШинаСЦельнометаллическимКордом);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитыШины.ШинаСЦельнометаллическимКордом);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Дополнительные характеристики изделия (описание)" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.ДополнительныеХарактеристики) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитыШины.ДополнительныеХарактеристики);
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитыШины.ЕдиинцаНаружногоДиаметра)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитыШины.ДополнительныеХарактеристики;
											КонецЕсли;
										Конецесли;
								
								ИначеЕсли Стр_1.attr_group_name="Состав" Тогда
										Если  Стр_1.attr_name="Комплектация" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.Состав) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитыШины.Состав);
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитыШины.ЕдиинцаНаружногоДиаметра)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитыШины.Состав;
											КонецЕсли;
											
										Конецесли;
								ИначеЕсли Стр_1.attr_group_name="Эксплуатация и условия хранения" Тогда
										Если  Стр_1.attr_name="Срок службы" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.ТипСрокаСлужбы) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитыШины.СрокСлужбы);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитыШины.ТипСрокаСлужбы));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитыШины.СрокСлужбы;
												//Стр_а.valueType=Строка(ДополнительныеРеквизитыШины.ТипСрокаСлужбы)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Гарантийный срок, от производителя" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.ТипГарантийногоСрока) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитыШины.ГарантийныйСрокОтПроизводителя);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитыШины.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитыШины.ГарантийныйСрокОтПроизводителя;
												//Стр_а.valueType=Строка(ДополнительныеРеквизитыШины.ТипГарантийногоСрока)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Особые условия хранения" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.ОсобыеУсловияХранения) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитыШины.ОсобыеУсловияХранения);
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитыШины.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитыШины.ОсобыеУсловияХранения;
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Рекомендации по использованию" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.РекомендацияПоИспользованию) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитыШины.РекомендацияПоИспользованию);
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитыШины.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитыШины.РекомендацияПоИспользованию;
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Срок хранения" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитыШины.ТипСрокаХранения) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитыШины.СрокХранения);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитыШины.ТипСрокаХранения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитыШины.СрокХранения;
												//Стр_а.valueType=Строка(ДополнительныеРеквизитыШины.ТипСрокаХранения)
											КонецЕсли;
										КонецЕсли;
									
									
								ИначеЕсли Стр_1.attr_group_name="Нормативно-сопроводительная документация" Тогда
									Если  Стр_1.attr_name="Номер Регламента/стандарта" Тогда
										
										    Если ДополнительныеРеквизитыШины.НомерРегламента005=Истина тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 005/2011 ""О безопасности упаковки""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитыШины.ТипСрокаХранения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
											КонецЕсли;
											
											
											Если ДополнительныеРеквизитыШины.НомерРегламента018=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 018/2011 ""О безопасности колесных транспортных средств""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитыШины.ТипСрокаХранения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
												
											КонецЕсли;
											
											
											Если ДополнительныеРеквизитыШины.НомерРегламента031=Истина Тогда
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 031/2012 ""О безопасности сельскохозяйственных и лесохозяйственных тракторов и прицепов к ним""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитыШины.ТипСрокаХранения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
												
											КонецЕсли;
											 
											
											
											
										КонецЕсли;
										//Конецесли;
									
									
								КонецЕсли;
								
								
							//	Если Стр_1.attr_group_name="Состав" Тогда
							//		Стр_1.attributes[0].value="Мой состав";
							//	КонецЕсли;
								
							Конеццикла;
						ИначеЕсли GTIN.Тип=ПредопределенноеЗначение("Перечисление.ТипПродукции_ХамелеонЦРПТ.ПитьеваяВода") Тогда
							Для Каждого Стр_1 Из NNN Цикл
								
								Если Стр_1.attr_group_name="Наименование товара и идентификация" Тогда
										Если Стр_1.attr_name="Заявленный объём / вес нетто" Тогда
											//Стр_а.value=GTIN
											Если ЗначениеЗаполнено(ДополнительныеРеквизитВода.ЗаявленныйОбъемВесНетто)
												И Значениезаполнено(ДополнительныеРеквизитВода.ЕдиницаОбъема) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",формат(ДополнительныеРеквизитВода.ЗаявленныйОбъемВесНетто,"ЧГ=ЧРД=""."""));
															Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитВода.ЕдиницаОбъема)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
												//Стр_а.value=формат(ДополнительныеРеквизитВода.ЗаявленныйОбъемВесНетто,"ЧГ=ЧРД="".""");
												//Стр_а.valueType=НРег(Строка(ДополнительныеРеквизитВода.ЕдиницаОбъема))
											Конецесли;
											
										//ИначеЕсли  Стр_1.attr_name="Заявленный объём / вес нетто" Тогда
											
											
										Конецесли;
								ИначеЕсли Стр_1.attr_group_name="Происхождение и бренды" Тогда
										Если  Стр_1.attr_name="СТМ" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитВода.СТМ) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитВода.СТМ));
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитВода.ЕдиницаОбъема)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитВода.СТМ);
											КонецЕсли;
											
										Конецесли;
								ИначеЕсли Стр_1.attr_group_name="Потребительские свойства" Тогда
										Если  Стр_1.attr_name="Общая минерализация" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитВода.ОбщаяМинерализация)
												И Значениезаполнено(ДополнительныеРеквизитВода.ЕдиницаИзмеренияМинерализации) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",формат(ДополнительныеРеквизитВода.ОбщаяМинерализация,"ЧГ=ЧРД=""."""));
															Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитВода.ЕдиницаИзмеренияМинерализации)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												//Стр_а.value=формат(ДополнительныеРеквизитВода.ОбщаяМинерализация,"ЧГ=ЧРД="".""");
												//Стр_а.valueType=НРег(Строка(ДополнительныеРеквизитВода.ЕдиницаИзмеренияМинерализации))
											Конецесли;
										ИначеЕсли  Стр_1.attr_name="Специализированная пищевая продукция" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.СпециализированнаяПищеваяПродкция) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.СпециализированнаяПищеваяПродкция));
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитВода.ЕдиницаИзмеренияМинерализации)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
											КонецЕсли;
										иначеЕсли  Стр_1.attr_name="Метод газирования" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитВода.МетодГазирования) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитВода.МетодГазирования));
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитВода.ЕдиницаИзмеренияМинерализации)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитВода.МетодГазирования);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитВода.МетодГазирования);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Тип продукта" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитВода.ТипПродукта) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитВода.ТипПродукта));
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитВода.ЕдиницаИзмеренияМинерализации)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитВода.ТипПродукта);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитВода.ТипПродукта);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Продукция для детского питания" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитВода.ПродукцияДляДетскогоПитания) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитВода.ПродукцияДляДетскогоПитания));
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитВода.ЕдиницаИзмеренияМинерализации)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитВода.ПродукцияДляДетскогоПитания);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитВода.ПродукцияДляДетскогоПитания);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
											
										ИначеЕсли  Стр_1.attr_name="Содержит ГМО" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитВода.СодержитГМО) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныеРеквизитВода.СодержитГМО));
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитВода.ЕдиницаИзмеренияМинерализации)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныеРеквизитВода.СодержитГМО);
												//Стр_а.valueTitle=Строка(ДополнительныеРеквизитВода.СодержитГМО);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
											
										Конецесли;
								
								ИначеЕсли Стр_1.attr_group_name="Состав" Тогда
										Если  Стр_1.attr_name="Состав" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитВода.Состав) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитВода.Состав);
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнительныеРеквизитВода.ЕдиницаИзмеренияМинерализации)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитВода.Состав;
											КонецЕсли;
											
										Конецесли;
								ИначеЕсли Стр_1.attr_group_name="Эксплуатация и условия хранения" Тогда
										Если  Стр_1.attr_name="Срок годности" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитВода.ТипСрокаГодности) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитВода.СрокГодности);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитВода.ТипСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитВода.СрокГодности;
												//Стр_а.valueType=Строка(ДополнительныеРеквизитВода.ТипСрокаГодности)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Срок хранения до 40 суток (включительно)" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.СрокХраненияДо40СутокВключительно) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнителныеРеквизитМолоко.СрокХраненияДо40СутокВключительно);
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитВода.ТипСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Рекомендации по употреблению" Тогда
											Если ЗначениеЗаполнено(ДополнительныеРеквизитВода.РекомендацияПоУпотреблению) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныеРеквизитВода.РекомендацияПоУпотреблению);
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныеРеквизитВода.ТипСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныеРеквизитВода.РекомендацияПоУпотреблению;
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Альтернативный срок годности" Тогда
											
											Если ДополнительныеРеквизитВода.ДополнительныеСрокиГодности.Количество()>0 Тогда
												
												Для Каждого Стр_ Из ДополнительныеРеквизитВода.ДополнительныеСрокиГодности Цикл
													Если ЗначениеЗаполнено(Стр_.СрокГодности) ИЛИ ЗначениеЗАполнено(Стр_.ТипДополнительногоСрокаГодности) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_.СрокГодности);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипДополнительногоСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														Конецесли;
													Конеццикла;
												КонецЕсли;
												
										ИначеЕсли  Стр_1.attr_name="Дополнительный срок годности" Тогда
											
											Если ДополнительныеРеквизитВода.ДополнительныеСрокиГодности.Количество()>0 Тогда
												
												Для Каждого Стр_ Из ДополнительныеРеквизитВода.ДополнительныеСрокиГодности Цикл
													Если ЗначениеЗаполнено(Стр_.СрокГодности) ИЛИ ЗначениеЗАполнено(Стр_.ТипДополнительногоСрокаГодности) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_.СрокГодности);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипДополнительногоСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														Конецесли;
													Конеццикла;
												КонецЕсли;
											КонецЕсли;
										//Конецесли;
								ИначеЕсли Стр_1.attr_group_name="Нормативно-сопроводительная документация" Тогда
										Если  Стр_1.attr_name="Номер Регламента/стандарта" Тогда
											
											Если ДополнительныеРеквизитВода.НомерРегламента005=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 005/2011 ""О безопасности упаковки""");
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипДополнительногоСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
															
														КонецЕсли;
											
											Если ДополнительныеРеквизитВода.НомерРегламента021=Истина Тогда
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 021/2011 ""О безопасности пищевой продукции""");
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипДополнительногоСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
																								
												
											КонецЕсли;
											
											
											Если ДополнительныеРеквизитВода.НомерРегламента027=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 027/2012 ""О безопасности отдельных видов специализированной пищевой продукции, в том числе диетического лечебного и диетического профилактического питания""");
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипДополнительногоСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
																								
												
												
											КонецЕсли;
											

											Если ДополнительныеРеквизитВода.НомерРегламента029=Истина Тогда
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 029/2012 ""Требования к безопасности пищевых добавок, ароматизаторов и технологических вспомогательных средств""");
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипДополнительногоСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
																								
											КонецЕсли;
											

											
											
											
										ИначеЕсли  Стр_1.attr_name="ГОСТ / ТУ / СТО" Тогда
											
											Если ДополнительныеРеквизитВода.ГОСТЫИТУ.Количество()>0 Тогда
												
												Первая=ложь;
												Для Каждого Стр_ Из ДополнительныеРеквизитВода.ГОСТЫИТУ Цикл
													Если ЗначениеЗаполнено(Стр_.ГОСТТУ)
														ИЛИ значениеЗаполнено(Стр_.ТипГОСТТУ) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_.ГОСТТУ);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
													Конецесли;
												Конеццикла;
												КонецЕсли;
											КонецЕсли;
										//Конецесли;
								КонецЕсли;
								
								
							//	Если Стр_1.attr_group_name="Состав" Тогда
							//		Стр_1.attributes[0].value="Мой состав";
							//	КонецЕсли;
								
							Конеццикла;
							
						ИначеЕсли GTIN.Тип=ПредопределенноеЗначение("Перечисление.ТипПродукции_ХамелеонЦРПТ.Молоко") Тогда
														
							Для Каждого Стр_1 Из NNN Цикл
								
								Если Стр_1.attr_group_name="Наименование товара и идентификация" Тогда
										Если Стр_1.attr_name="Заявленный объём / вес нетто" Тогда
											//Стр_а.value=GTIN
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ЗаявленныйОбъемВесНетто)
												И Значениезаполнено(ДополнителныеРеквизитМолоко.ЕдиницаОбъема) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",формат(ДополнителныеРеквизитМолоко.ЗаявленныйОбъемВесНетто,"ЧГ=ЧРД=""."""));
															Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнителныеРеквизитМолоко.ЕдиницаОбъема)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												//Стр_а.value=формат(ДополнителныеРеквизитМолоко.ЗаявленныйОбъемВесНетто,"ЧГ=ЧРД="".""");
												//Стр_а.valueType=НРег(Строка(ДополнителныеРеквизитМолоко.ЕдиницаОбъема))
											Конецесли;
											
										ИначеЕсли Стр_1.attr_name="Базовая единица измерения" Тогда
											Если ДополнителныеРеквизитМолоко.ТоварВесовой Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","КГ");
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнителныеРеквизитМолоко.ЕдиницаОбъема)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value="КГ";
											Иначе
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ШТ");
															//Структура_добавим.Вставить("attr_value_type",НРег(Строка(ДополнителныеРеквизитМолоко.ЕдиницаОбъема)));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value="ШТ";
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Количество единиц употребления в потребительской упаковке" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ПотребительскаяУпаковка) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Формат(ДополнителныеРеквизитМолоко.КоличествоВПотребительскойУпаковке,"ЧГ="));
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Формат(ДополнителныеРеквизитМолоко.КоличествоВПотребительскойУпаковке,"ЧГ=");
												//Стр_а.valueType=Строка(ДополнителныеРеквизитМолоко.ПотребительскаяУпаковка)
												
											КонецЕсли;
									 	//ИначеЕсли  Стр_1.attr_name="Заявленный объём / вес нетто" Тогда
											
											
										Конецесли;
								
								ИначеЕсли Стр_1.attr_group_name="Происхождение и бренды" Тогда
										Если  Стр_1.attr_name="СТМ" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.СТМ) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.СТМ));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.СТМ);
											КонецЕсли;
											
										Конецесли;
																
								ИначеЕсли Стр_1.attr_group_name="Потребительские свойства" Тогда
										Если  Стр_1.attr_name="Тип продукта" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ТипПродукта) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.ТипПродукта));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.ТипПродукта);
												//Стр_а.valueTitle=Строка(ДополнителныеРеквизитМолоко.ТипПродукта);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли Стр_1.attr_name="Наличие витаминов и минеральных веществ" Тогда
												Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.НаличиеВитаминовИМинеральныхВеществ) Тогда
																Структура_добавим=Новый Структура;
																Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
																Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.НаличиеВитаминовИМинеральныхВеществ));
																//Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ПотребительскаяУпаковка));
																МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
													//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.ТипПродукта);
													//Стр_а.valueTitle=Строка(ДополнителныеРеквизитМолоко.ТипПродукта);
													//Стр_а.valueType=Неопределено
												КонецЕсли;
												
										ИначеЕсли  Стр_1.attr_name="Происхождение сырья" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ПроисхождениеСырья) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.ПроисхождениеСырья));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.ПроисхождениеСырья);
												//Стр_а.valueTitle=Строка(ДополнителныеРеквизитМолоко.ПроисхождениеСырья);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Жирность, %" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.Жирность) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",формат(ДополнителныеРеквизитМолоко.Жирность,"ЧГ=ЧРД=""."""));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=формат(ДополнителныеРеквизитМолоко.Жирность,"ЧГ=ЧРД="".""");;
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Продукция для детского питания" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ПродукцияДляДетскогоПитания) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.ПродукцияДляДетскогоПитания));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.ПродукцияДляДетскогоПитания);
												//Стр_а.valueTitle=Строка(ДополнителныеРеквизитМолоко.ПродукцияДляДетскогоПитания);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Содержит ГМО" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.СодержитГМО) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.СодержитГМО));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.СодержитГМО);
												//Стр_а.valueTitle=Строка(ДополнителныеРеквизитМолоко.СодержитГМО);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Наименование пищевой добавки" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ПищевыеДобавкиАроматизаторы) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.ПищевыеДобавкиАроматизаторы));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.ПищевыеДобавкиАроматизаторы);;
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Номер Е-добавки" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.НомерEДобавки) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.НомерEДобавки));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.ПищевыеДобавкиАроматизаторы);;
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Вкус" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.Вкус) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.Вкус));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.Вкус);;
											КонецЕсли;
											
										ИначеЕсли Стр_1.attr_name="Заменитель молочного жира" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ЗаменительМолочногоЖира) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.ЗаменительМолочногоЖира));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.ЗаменительМолочногоЖира);
												//Стр_а.valueTitle=Строка(ДополнителныеРеквизитМолоко.ЗаменительМолочногоЖира);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Тип сырья / обработки" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ТипОбработкиМолока) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.ТипОбработкиМолока));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.ТипОбработкиМолока);
												//Стр_а.valueTitle=Строка(ДополнителныеРеквизитМолоко.ТипОбработкиМолока);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Целевой возраст" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ЦелевойВозраст) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.ЦелевойВозраст));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.ЦелевойВозраст);
												//Стр_а.valueTitle=Строка(ДополнителныеРеквизитМолоко.ЦелевойВозраст);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Тип хранения" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ТипХранения) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.ТипХранения));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.ТипХранения);
												//Стр_а.valueTitle=Строка(ДополнителныеРеквизитМолоко.ТипХранения);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Органический продукт" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ОрганическийПродукт) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.ОрганическийПродукт));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.ОрганическийПродукт);
												//Стр_а.valueTitle=Строка(ДополнителныеРеквизитМолоко.ОрганическийПродукт);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Содержит пальмовое масло" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.СодержитПальмовоеМасло) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.СодержитПальмовоеМасло));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.СодержитПальмовоеМасло);
												//Стр_а.valueTitle=Строка(ДополнителныеРеквизитМолоко.СодержитПальмовоеМасло);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли Стр_1.attr_name="Витаминизация" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.Витаминизация) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.Витаминизация));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.Витаминизация);
												//Стр_а.valueTitle=Строка(ДополнителныеРеквизитМолоко.Витаминизация);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Аллергены" Тогда
											
											 Если ДополнителныеРеквизитМолоко.Аллергены.Количество()>0 Тогда
												
												 Для Каждого Стр_ Из ДополнителныеРеквизитМолоко.Аллергены Цикл
													 Если ЗначениеЗаполнено(Стр_.Аллерген) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(Стр_.Аллерген));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ПотребительскаяУпаковка));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														Конецесли;
													
													Конеццикла;
												КонецЕсли;
											

											
										Конецесли;
									
								ИначеЕсли Стр_1.attr_group_name="Пищевая и энергетическая ценности" Тогда
									
										Если Стр_1.attr_name="Белки" Тогда
											Если ЗначениеЗАполнено(ДополнителныеРеквизитМолоко.БелкиЕдиницаИзмерения) тогда
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнителныеРеквизитМолоко.Белки);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.БелкиЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнителныеРеквизитМолоко.Белки;
												//Стр_а.valueType=Строка(ДополнителныеРеквизитМолоко.БелкиЕдиницаИзмерения)

											КонецЕсли;
											
										ИначеЕсли Стр_1.attr_name="Жиры" Тогда
											Если ЗначениеЗАполнено(ДополнителныеРеквизитМолоко.ЖирыЕдиницаИзмерения) тогда
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнителныеРеквизитМолоко.Жиры);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ЖирыЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнителныеРеквизитМолоко.Жиры;
												//Стр_а.valueType=Строка(ДополнителныеРеквизитМолоко.ЖирыЕдиницаИзмерения)

											КонецЕсли;
											
										ИначеЕсли Стр_1.attr_name="Углеводы" Тогда
											Если ЗначениеЗАполнено(ДополнителныеРеквизитМолоко.УглеводыЕдиницаИзмерения) тогда
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнителныеРеквизитМолоко.Углеводы);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.УглеводыЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнителныеРеквизитМолоко.Углеводы;
												//Стр_а.valueType=Строка(ДополнителныеРеквизитМолоко.УглеводыЕдиницаИзмерения)

											КонецЕсли;
											
										ИначеЕсли Стр_1.attr_name="Энергетическая ценность" Тогда
											
											Если ДополнителныеРеквизитМолоко.ЭнергетическаяЦенность.Количество()>0 Тогда
												
												Для Каждого Стр_ Из ДополнителныеРеквизитМолоко.ЭнергетическаяЦенность Цикл
													Если ЗначениеЗаполнено(Стр_.ЭнергетическаяЦенность) И ЗначениеЗаполненО(Стр_.ЕдиницаИзмерения) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(Стр_.ЭнергетическаяЦенность));
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														Конецесли;
													Конеццикла;
												КонецЕсли;
											

											

											
										КонецЕсли;

								ИначеЕсли Стр_1.attr_group_name="Эксплуатация и условия хранения" Тогда
										Если  Стр_1.attr_name="Срок годности" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ТипСрокаГодности) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнителныеРеквизитМолоко.СрокГодности);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ТипСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнителныеРеквизитМолоко.СрокГодности;
												//Стр_а.valueType=Строка(ДополнителныеРеквизитМолоко.ТипСрокаГодности)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Особые условия хранения" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ОсобыеУсловияХранения) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнителныеРеквизитМолоко.ОсобыеУсловияХранения);
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ТипСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнителныеРеквизитМолоко.ОсобыеУсловияХранения;
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Рекомендации по употреблению" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.РекомендацияПоУпотреблению) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнителныеРеквизитМолоко.РекомендацияПоУпотреблению);
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ТипСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнителныеРеквизитМолоко.РекомендацияПоУпотреблению;
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Альтернативный срок годности" Тогда
											
											Если ДополнителныеРеквизитМолоко.ДополнительныеСрокиГодности.Количество()>0 Тогда
												
												Для Каждого Стр_ Из ДополнителныеРеквизитМолоко.ДополнительныеСрокиГодности Цикл
													Если ЗначениеЗаполнено(Стр_.СрокГодности) ИЛИ ЗначениеЗаполнено(Стр_.ТипДополнительногоСрокаГодности) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_.СрокГодности);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипДополнительногоСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
													Конецесли;
													Конеццикла;
												КонецЕсли;
												
										ИначеЕсли  Стр_1.attr_name="Дополнительный срок годности" Тогда
											
											Если ДополнителныеРеквизитМолоко.ДополнительныеСрокиГодности.Количество()>0 Тогда
												
												Для Каждого Стр_ Из ДополнителныеРеквизитМолоко.ДополнительныеСрокиГодности Цикл
													Если ЗначениеЗАполнено(Стр_.СрокГодности) ИЛИ ЗначениеЗаполнено(Стр_.ТипДополнительногоСрокаГодности) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_.СрокГодности);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипДополнительногоСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														Конецесли;
													Конеццикла;
												КонецЕсли;
											КонецЕсли;
										//Конецесли;
									
									
									
									
								ИначеЕсли Стр_1.attr_group_name="Нормативно-сопроводительная документация" Тогда
									
										Если  Стр_1.attr_name="Номер Регламента/стандарта" Тогда
											
											Если ДополнителныеРеквизитМолоко.НомерРегламента005=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 005/2011 ""О безопасности упаковки""");
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипДополнительногоСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
												
											КонецЕсли;
											
											Если ДополнителныеРеквизитМолоко.НомерРегламента021=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 021/2011 ""О безопасности пищевой продукции""");
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипДополнительногоСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
											КонецЕсли;
											
											
											Если ДополнителныеРеквизитМолоко.НомерРегламента027=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 027/2012 ""О безопасности отдельных видов специализированной пищевой продукции, в том числе диетического лечебного и диетического профилактического питания""");
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипДополнительногоСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
											КонецЕсли;
											

											Если ДополнителныеРеквизитМолоко.НомерРегламента029=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 029/2012 ""Требования к безопасности пищевых добавок, ароматизаторов и технологических вспомогательных средств""");
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипДополнительногоСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
												
											КонецЕсли;
											

											Если ДополнителныеРеквизитМолоко.НомерРегламента033=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 033/2013 ""О безопасности молока и молочной продукции""");
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипДополнительногоСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
											КонецЕсли;
											

											Если ДополнителныеРеквизитМолоко.НомерРегламента022=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 022/2011 ""Пищевая продукция в части ее маркировки""");
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипДополнительногоСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
																								
											КонецЕсли;
											
											Если ДополнителныеРеквизитМолоко.НомерРегламента024=Истина Тогда
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 024/2011 ""Технический регламент на масложировую продукцию""");
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипДополнительногоСрокаГодности));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
											КонецЕсли;
											
											
											
										ИначеЕсли  Стр_1.attr_name="ГОСТ / ТУ / СТО" Тогда
											
											Если ДополнителныеРеквизитМолоко.ГОСТЫИТУ.Количество()>0 Тогда
												
												Для Каждого Стр_ Из ДополнителныеРеквизитМолоко.ГОСТЫИТУ Цикл
													Если ЗначениеЗАполненО(Стр_.ГОСТТУ) ИЛИ ЗначениеЗаполненО(Стр_.ТипГОСТТУ) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_.ГОСТТУ);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														Конецесли;
													Конеццикла;
												КонецЕсли;
											КонецЕсли;
									
									
									
									
									
									
									
									
									
									
								ИначеЕсли Стр_1.attr_group_name="Состав" Тогда
										Если  Стр_1.attr_name="Состав" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.Состав) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнителныеРеквизитМолоко.Состав);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнителныеРеквизитМолоко.Состав;
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Вариант состава" Тогда
											
											Для Каждого Стр_ Из ДополнителныеРеквизитМолоко.ВариантыСостава Цикл
												Если ЗначениеЗаполнено(Стр_.ВариантСостава) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_.ВариантСостава);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														Конецесли;	
												Конеццикла;
													
											
											
										Конецесли;
								ИначеЕсли Стр_1.attr_group_name="Данные для ФГИС ВетИС" Тогда
									
									
										Если  Стр_1.attr_name="Подлежит ветеринарному контролю (надзору)" Тогда
											//Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ИдентификаторТовараВФГИСМеркурий) Тогда
											
											Если ДополнителныеРеквизитМолоко.ПодлежитВетеринарномуКонтролю ТОгда
												ЗапишемПодл="ДА"
											Иначе
												ЗапишемПодл="НЕТ"
												
											Конецесли;
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ЗапишемПодл));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
											//Стр_а.value=Строка(ЗапишемПодл);
											//Стр_а.valueTitle=Строка(ЗапишемПодл);
											//Стр_а.valueType=Неопределено ;
											
											
											
										ИначеЕсли Стр_1.attr_name="Тип продукции" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ТипПродукции) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.ТипПродукции));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.ТипПродукции);
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Продукция" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.Продукция) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.Продукция));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.Продукция);
											КонецЕсли;
											
										ИначеЕсли Стр_1.attr_name="Вид продукции" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ВидПродукции) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.ВидПродукции));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.ВидПродукции);
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Категория продукции" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.КатегорияПродукции) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.КатегорияПродукции));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.КатегорияПродукции);
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="ГОСТ" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ТипГОСТ) ИЛИ
												ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ГОСТ)
												Тогда
											
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
												//МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
											
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ТипГОСТ) Тогда
												Структура_добавим.Вставить("attr_value_type",Строка(ДополнителныеРеквизитМолоко.ТипГОСТ));
												//Стр_а.valueType=Строка(ДополнителныеРеквизитМолоко.ТипГОСТ)
											Конецесли;
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ГОСТ) Тогда
												Структура_добавим.Вставить("attr_value",ДополнителныеРеквизитМолоко.ГОСТ);
												//Стр_а.value=ДополнителныеРеквизитМолоко.ГОСТ
											Конецесли;
											МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
											Конецесли;
											
																					
										Конецесли;
												
									
								ИначеЕсли Стр_1.attr_group_name="ФГИС ВетИС" Тогда
									
									МассивИДГУИДВ=Новый Массив;
									//ДополнителныеРеквизитМолоко.ИдентификаторыТовараВФГИСМеркурий.Очистить();
										Если  Стр_1.attr_name="Идентификатор товара в ФГИС ВетИС (GUID ProductItem)" Тогда
											
											Для Каждого Стр_222 Из ДополнителныеРеквизитМолоко.ИдентификаторыТовараВФГИСМеркурий Цикл
												Если Не ЗначениеЗАполнено(Стр_222.ИдентификаторТовараВФГИСМеркурий) 
													ТОгда
													Продолжить;
												Конецесли;
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_222.ИдентификаторТовараВФГИСМеркурий);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_222.Вид));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												

												
											Конеццикла;
										ИначеЕсли Стр_1.attr_name="ХС-производитель" Тогда
											
											Если ЗначениеЗаполненО(ДополнителныеРеквизитМолоко.ХСПроизводитель) Тогда
												СтруктурК=ПолучитьИнфуПоХСИПл(ДополнителныеРеквизитМолоко.ХСПроизводитель);
												
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",СтруктурК.ГУИД);
															Структура_добавим.Вставить("attr_value_type",СтруктурК.Наименование);
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												//Стр_а.value=СтруктурК.ГУИД;
												//Стр_а.valueTitle=СтруктурК.Наименование;
												
												
											Конецесли;
											
											
										ИначеЕсли Стр_1.attr_name="Предприятие-производитель" Тогда
											Для Каждого Стр_222 Из ДополнителныеРеквизитМолоко.ПредприятияПроизводители Цикл
												Если Не ЗначениеЗАполнено(Стр_222.ПредприятиеПроизводитель) ТОгда
													Продолжить;
												Конецесли;
												СтруктурК=ПолучитьИнфуПоХСИПл(Стр_222.ПредприятиеПроизводитель);
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",СтруктурК.ГУИД);
															Структура_добавим.Вставить("attr_value_type",СтруктурК.Наименование);
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
											Конеццикла;
											
										ИначеЕсли Стр_1.attr_name="Массовая доля белка, %" Тогда
											Для Каждого Стр_222 Из ДополнителныеРеквизитМолоко.МассоваяДоляБелка Цикл
												Если Не ЗначениеЗАполнено(Стр_222.Вид) 
													И Не ЗначениеЗАполнено(Стр_222.МассоваяДоляБелка)
													
													ТОгда
													Продолжить;
												Конецесли;
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Формат(Стр_222.МассоваяДоляБелка,"ЧГ="));
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_222.Вид));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);

												
											Конеццикла;
											
											
																				//	
										ИначеЕсли Стр_1.attr_name="Массовая доля жира, %" Тогда
											
											Для Каждого Стр_222 Из ДополнителныеРеквизитМолоко.МассоваяДоляЖира Цикл
												Если Не ЗначениеЗАполнено(Стр_222.Вид) 
													И Не ЗначениеЗАполнено(Стр_222.МассоваяДоляЖира)
													
													ТОгда
													Продолжить;
												Конецесли;

															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Формат(Стр_222.МассоваяДоляЖира,"ЧГ="));
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_222.Вид));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
											Конеццикла;

											//Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ИдентификаторТовараВФГИСМеркурий) Тогда
											//	Стр_а.value=ДополнителныеРеквизитМолоко.ИдентификаторТовараВФГИСМеркурий;
											//КонецЕсли;
											
										Конецесли;
									
										
								ИначеЕсли Стр_1.attr_group_name="Дополнительная информация" Тогда
										Если  Стр_1.attr_name="Заявление о жирности продукта" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ЗаявленияОЖирностиМолока) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.ЗаявленияОЖирностиМолока));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_222.Вид));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.ЗаявленияОЖирностиМолока);
												//Стр_а.valueTitle=Строка(ДополнителныеРеквизитМолоко.ЗаявленияОЖирностиМолока);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Обогащающие компоненты" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ОбогащающиеКомпоненты) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.ОбогащающиеКомпоненты));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_222.Вид));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.ОбогащающиеКомпоненты);
												//Стр_а.valueTitle=Строка(ДополнителныеРеквизитМолоко.ОбогащающиеКомпоненты);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Социально значимый товар" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.СоциальноЗначимыйТовар) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.СоциальноЗначимыйТовар));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_222.Вид));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.СоциальноЗначимыйТовар);
												//Стр_а.valueTitle=Строка(ДополнителныеРеквизитМолоко.СоциальноЗначимыйТовар);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Заявление о пригодности для диетического питания" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ЗаявлениеОПригодностиДляДиетическогоПитания) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.ЗаявлениеОПригодностиДляДиетическогоПитания));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_222.Вид));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.ЗаявлениеОПригодностиДляДиетическогоПитания);
												//Стр_а.valueTitle=Строка(ДополнителныеРеквизитМолоко.ЗаявлениеОПригодностиДляДиетическогоПитания);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Особенности питания" Тогда
											Если ЗначениеЗаполнено(ДополнителныеРеквизитМолоко.ОсобенностиПитания) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнителныеРеквизитМолоко.ОсобенностиПитания));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_222.Вид));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнителныеРеквизитМолоко.ОсобенностиПитания);
												//Стр_а.valueTitle=Строка(ДополнителныеРеквизитМолоко.ОсобенностиПитания);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										Конецесли;
									
									
								КонецЕсли;
								
								
								
							//	Если Стр_1.attr_group_name="Состав" Тогда
							//		Стр_1.attributes[0].value="Мой состав";
							//	КонецЕсли;
								
							Конеццикла;
							
							
						ИначеЕсли GTIN.Тип=ПредопределенноеЗначение("Перечисление.ТипПродукции_ХамелеонЦРПТ.Обувь") Тогда
							Для Каждого Стр_1 Из NNN Цикл
								
								Если Стр_1.attr_group_name="Происхождение и бренды" Тогда        
										Если  Стр_1.attr_name="СТМ" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.СТМ) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитОбувь.СТМ));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_222.Вид));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитОбувь.СТМ);
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Модель / артикул производителя" Тогда
											Если ЗначениеЗаполнено(GTIN.МодельПроизводителяАртикул)
												И ДополнительныйРеквизитБелье.ДопМодельАртикулы.Количество()=0 Тогда
												
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",GTIN.МодельПроизводителяАртикул);
															Структура_добавим.Вставить("attr_value_type",Строка("Артикул"));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
											КонецЕсли;
											Для Каждого Стр_22 Из ДополнительныйРеквизитОбувь.ДопМодельАртикулы Цикл
												Если ЗначениеЗаполнено(Стр_22.МодельАртикул) ИЛИ ЗначениеЗаполнено(Стр_22.ТипМодельАртикул) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_22.МодельАртикул);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														Конецесли;
												
															
												Конеццикла;
											
										Конецесли;
																
								ИначеЕсли Стр_1.attr_group_name="Потребительские свойства" Тогда 
										Если  Стр_1.attr_name="Вид обуви" Тогда
											Если ЗначениеЗаполнено(GTIN.ВидОбуви) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Врег(Строка(GTIN.ВидОбуви)));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Врег(Строка(GTIN.ВидОбуви));
												//Стр_а.valueTitle=Врег(Строка(GTIN.ВидОбуви));
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Цвет" Тогда
											Если ЗначениеЗаполнено(GTIN.Цвет) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Врег(Строка(GTIN.Цвет)));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Врег(Строка(GTIN.Цвет));
												//Стр_а.valueTitle=Врег(Строка(GTIN.Цвет));
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Целевой возраст" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.ЦелевойВозраст) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Врег(Строка(ДополнительныйРеквизитОбувь.ЦелевойВозраст)));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Врег(Строка(ДополнительныйРеквизитОбувь.ЦелевойВозраст));
												//Стр_а.valueTitle=Врег(Строка(ДополнительныйРеквизитОбувь.ЦелевойВозраст));
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Пол целевого потребителя" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.ПолЦелевогоПотребителя) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Врег(Строка(ДополнительныйРеквизитОбувь.ПолЦелевогоПотребителя)));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Врег(Строка(ДополнительныйРеквизитОбувь.ПолЦелевогоПотребителя));
												//Стр_а.valueTitle=Врег(Строка(ДополнительныйРеквизитОбувь.ПолЦелевогоПотребителя));
												//Стр_а.valueType=Неопределено
												
											ИначеЕсли ЗначениеЗаполнено(GTIN.Пол) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Врег(Строка(GTIN.Пол)));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Врег(Строка(GTIN.Пол));
												//Стр_а.valueTitle=Врег(Строка(GTIN.Пол));
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Размер в штихмассовой системе" Тогда
											Если ЗначениеЗаполнено(GTIN.Размер) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Врег(Строка(GTIN.Размер)));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Врег(Строка(GTIN.Размер));
												//Стр_а.valueTitle=Врег(Строка(GTIN.Размер));
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Размер в метрической системе, мм" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.РазмерВМетрическойСистемемм) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Врег(Строка(ДополнительныйРеквизитОбувь.РазмерВМетрическойСистемемм)));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Врег(Строка(GTIN.РазмерВМетрическойСистемемм));
												//Стр_а.valueTitle=Врег(Строка(GTIN.РазмерВМетрическойСистемемм));
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
											
										ИначеЕсли  Стр_1.attr_name="Размер в иных системах измерения" Тогда
											
											Если ДополнительныйРеквизитОбувь.РазмерВИныхСистемахИзмерения.Количество()>0 Тогда
													
												Для Каждого Стр_ Из ДополнительныйРеквизитОбувь.РазмерВИныхСистемахИзмерения Цикл
													Если ЗначениеЗаполнено(Стр_.Размер) ИЛИ ЗначениеЗаполнено(Стр_.Страна) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_.Размер);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_.Страна));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														Конецесли;
													Конеццикла;
											КонецЕсли;
																									
										ИначеЕсли  Стр_1.attr_name="Длина стельки, см" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.ДлинаСтелькисм) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбувь.ДлинаСтелькисм);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.Страна));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитОбувь.ДлинаСтелькисм;
											Конецесли;
											
																									
										ИначеЕсли  Стр_1.attr_name="Размер полноты обуви" Тогда
											
											Если ЗначениеЗАполнено(ДополнительныйРеквизитОбувь.РазмерПолнотыОбувиСистема) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбувь.РазмерПолнотыОбуви);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.РазмерПолнотыОбувиСистема));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
													//Стр_а.value=ДополнительныйРеквизитОбувь.РазмерПолнотыОбуви;
													//Стр_а.valueType=Строка(ДополнительныйРеквизитОбувь.РазмерПолнотыОбувиСистема)
											Конецесли;
										ИначеЕсли  Стр_1.attr_name="Наличие каблука" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.НаличиеКаблука) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Врег(Строка(ДополнительныйРеквизитОбувь.НаличиеКаблука)));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.РазмерПолнотыОбувиСистема));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Врег(Строка(ДополнительныйРеквизитОбувь.НаличиеКаблука));
												//Стр_а.valueTitle=Врег(Строка(ДополнительныйРеквизитОбувь.НаличиеКаблука));
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Высота каблука" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.ВысотаКаблука) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Врег(Строка(ДополнительныйРеквизитОбувь.ВысотаКаблука)));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.РазмерПолнотыОбувиСистема));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Врег(Строка(ДополнительныйРеквизитОбувь.ВысотаКаблука));
												//Стр_а.valueTitle=Врег(Строка(ДополнительныйРеквизитОбувь.ВысотаКаблука));
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Цвет фурнитуры" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.ЦветФурнитуры) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Врег(Строка(ДополнительныйРеквизитОбувь.ЦветФурнитуры)));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.РазмерПолнотыОбувиСистема));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Врег(Строка(ДополнительныйРеквизитОбувь.ЦветФурнитуры));
												//Стр_а.valueTitle=Врег(Строка(ДополнительныйРеквизитОбувь.ЦветФурнитуры));
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Цвет фурнитуры" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.ЦветФурнитуры) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Врег(Строка(ДополнительныйРеквизитОбувь.ЦветФурнитуры)));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.РазмерПолнотыОбувиСистема));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Врег(Строка(ДополнительныйРеквизитОбувь.ЦветФурнитуры));
												//Стр_а.valueTitle=Врег(Строка(ДополнительныйРеквизитОбувь.ЦветФурнитуры));
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Водонепроницаемая/Водостойкая" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.ВодонепроницаемаяВодостойкая) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Врег(Строка(ДополнительныйРеквизитОбувь.ВодонепроницаемаяВодостойкая)));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.РазмерПолнотыОбувиСистема));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Врег(Строка(ДополнительныйРеквизитОбувь.ВодонепроницаемаяВодостойкая));
												//Стр_а.valueTitle=Врег(Строка(ДополнительныйРеквизитОбувь.ВодонепроницаемаяВодостойкая));
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Имеет ли гладкую подошву" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.ИмеетЛиГладкуюПодошву) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Врег(Строка(ДополнительныйРеквизитОбувь.ИмеетЛиГладкуюПодошву)));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.РазмерПолнотыОбувиСистема));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Врег(Строка(ДополнительныйРеквизитОбувь.ИмеетЛиГладкуюПодошву));
												//Стр_а.valueTitle=Врег(Строка(ДополнительныйРеквизитОбувь.ИмеетЛиГладкуюПодошву));
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Тип частично закрытого верха" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.ТипЧастичноЗакрытогоВерха) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Врег(Строка(ДополнительныйРеквизитОбувь.ТипЧастичноЗакрытогоВерха)));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.РазмерПолнотыОбувиСистема));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Врег(Строка(ДополнительныйРеквизитОбувь.ТипЧастичноЗакрытогоВерха));
												//Стр_а.valueTitle=Врег(Строка(ДополнительныйРеквизитОбувь.ТипЧастичноЗакрытогоВерха));
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Тип застежки" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.ТипЗастежки) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Врег(Строка(ДополнительныйРеквизитОбувь.ТипЗастежки)));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.РазмерПолнотыОбувиСистема));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Врег(Строка(ДополнительныйРеквизитОбувь.ТипЗастежки));
												//Стр_а.valueTitle=Врег(Строка(ДополнительныйРеквизитОбувь.ТипЗастежки));
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Сезонность" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.Сезонность) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Врег(Строка(ДополнительныйРеквизитОбувь.Сезонность)));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.РазмерПолнотыОбувиСистема));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Врег(Строка(ДополнительныйРеквизитОбувь.Сезонность));
												//Стр_а.valueTitle=Врег(Строка(ДополнительныйРеквизитОбувь.Сезонность));
												//Стр_а.valueType=Неопределено
											ИначеЕсли ЗначениеЗаполнено(GTIN.Сезон) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Врег(Строка(GTIN.Сезон)));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.РазмерПолнотыОбувиСистема));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Врег(Строка(GTIN.Сезон));
												//Стр_а.valueTitle=Врег(Строка(GTIN.Сезон));
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										Конецесли;
									

								ИначеЕсли Стр_1.attr_group_name="Состав" Тогда
										Если  Стр_1.attr_name="Материал верха" Тогда
											Если ЗначениеЗаполнено(GTIN.МатериалВерха) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Врег(Строка(GTIN.МатериалВерха)));
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.РазмерПолнотыОбувиСистема));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Врег(Строка(GTIN.МатериалВерха));
												//Стр_а.valueTitle=Врег(Строка(GTIN.МатериалВерха));
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Материал верха, %" Тогда
											
											Если ДополнительныйРеквизитОбувь.МатериалВерха.Количество()>0 Тогда
													
												Для Каждого Стр_ Из ДополнительныйРеквизитОбувь.МатериалВерха Цикл
													Если ЗначениеЗаполнено(Стр_.МатериалВверха) ИЛИ ЗначениеЗаполнено(Стр_.Процент) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_.МатериалВверха);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_.Процент));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														Конецесли;
														
													Конеццикла;
												КонецЕсли;	
										ИначеЕсли  Стр_1.attr_name="Материал подкладки" Тогда
											Если ЗначениеЗаполнено(GTIN.МатериалПодкладки) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Врег(Строка(GTIN.МатериалПодкладки)));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.Процент));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Врег(Строка(GTIN.МатериалПодкладки));
												//Стр_а.valueTitle=Врег(Строка(GTIN.МатериалПодкладки));
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Материал подкладки, %" Тогда
											Если ДополнительныйРеквизитОбувь.МатериалПодкладки.Количество()>0 Тогда
													
												Для Каждого Стр_ Из ДополнительныйРеквизитОбувь.МатериалПодкладки Цикл
													Если ЗначениеЗаполнено(Стр_.МатериалПодкладки) ИЛИ ЗначениеЗаполнено(Стр_.Процент) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_.МатериалПодкладки);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_.Процент));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														Конецесли;
													Конеццикла;
												КонецЕсли;	
										ИначеЕсли  Стр_1.attr_name="Материал стельки" Тогда
											Если ЗначениеЗаполнено(GTIN.Стелька) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Врег(Строка(GTIN.Стелька)));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.Процент));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Врег(Строка(GTIN.Стелька));
												//Стр_а.valueTitle=Врег(Строка(GTIN.Стелька));
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Материал стельки, %" Тогда
											Если ДополнительныйРеквизитОбувь.МатериалСтельки.Количество()>0 Тогда
													
												Для Каждого Стр_ Из ДополнительныйРеквизитОбувь.МатериалСтельки Цикл
													Если ЗначениеЗаполнено(Стр_.МатериалСтельки) ИЛИ ЗначениеЗАполнено(Стр_.Процент) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_.МатериалСтельки);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_.Процент));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														Конецесли;
														
													Конеццикла;
												КонецЕсли;	
											
										ИначеЕсли  Стр_1.attr_name="Материал низа / подошвы" Тогда
											Если ЗначениеЗаполнено(GTIN.МатериалНиза) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Врег(Строка(GTIN.МатериалНиза)));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.Процент));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Врег(Строка(GTIN.МатериалНиза));
												//Стр_а.valueTitle=Врег(Строка(GTIN.МатериалНиза));
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Материал низа / подошвы, %" Тогда
											Если ДополнительныйРеквизитОбувь.МатериалНизаПодошвы.Количество()>0 Тогда
													
												Для Каждого Стр_ Из ДополнительныйРеквизитОбувь.МатериалНизаПодошвы Цикл
													Если ЗначениеЗаполнено(Стр_.МатериалНизаПодошвы) ИЛИ Значениезаполнено(Стр_.Процент) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_.МатериалНизаПодошвы);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_.Процент));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														Конецесли;
													Конеццикла;
												КонецЕсли;	

											
											
										КонецЕсли;
										
										
								ИначеЕсли Стр_1.attr_group_name="Характеристики товара в состоянии использования" Тогда
										Если  Стр_1.attr_name="Ширина изделия" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.ШиринаЕдиницаИзмерения) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбувь.Ширина);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.ШиринаЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитОбувь.Ширина;
												//Стр_а.valueType=Строка(ДополнительныйРеквизитОбувь.ШиринаЕдиницаИзмерения)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Высота изделия" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.ВысотаЕдиницаИзмерения) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбувь.Высота);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.ВысотаЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитОбувь.Высота;
												//Стр_а.valueType=Строка(ДополнительныйРеквизитОбувь.ВысотаЕдиницаИзмерения)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Глубина изделия" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.ГлубинаЕдиницаИзмерения) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбувь.Глубина);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.ГлубинаЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитОбувь.Глубина;
												//Стр_а.valueType=Строка(ДополнительныйРеквизитОбувь.Глубина)
											КонецЕсли;
										Конецесли;
									
							ИначеЕсли Стр_1.attr_group_name="Эксплуатация и условия хранения" Тогда
							     		Если Стр_1.attr_name="Мин. температура, С" Тогда
											Если Значениезаполнено(ДополнительныйРеквизитОбщиеНК.МинимальнаяТемпература
										) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбщиеНК.МинимальнаяТемпература);
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.ГлубинаЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
											//Стр_а.value=ДополнительныйРеквизитОбщиеНК.МинимальнаяТемпература
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Макс. температура, С" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбщиеНК.МаксимальнаяТемпература) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбщиеНК.МаксимальнаяТемпература);
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.ГлубинаЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитОбщиеНК.МаксимальнаяТемпература
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Мин. относительная влажность, %" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбщиеНК.МинимальнаяОтносительнаяВлажность) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбщиеНК.МинимальнаяОтносительнаяВлажность);
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.ГлубинаЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитОбщиеНК.МинимальнаяОтносительнаяВлажность
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Макс. относительная влажность, %" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбщиеНК.МаксимальнаяОтносительнаяВлажность) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбщиеНК.МаксимальнаяОтносительнаяВлажность);
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.ГлубинаЕдиницаИзмерения));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитОбщиеНК.МаксимальнаяОтносительнаяВлажность
												
											КонецЕсли;
										//ИначеЕсли  Стр_1.attr_name="Заявленный объём / вес нетто" Тогда
											
										ИначеЕсли  Стр_1.attr_name="Срок службы" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.ТипСрокаСлужбы) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбувь.СрокСлужбы);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.ТипСрокаСлужбы));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитОбувь.СрокСлужбы;
												//Стр_а.valueType=Строка(ДополнительныйРеквизитОбувь.ТипСрокаСлужбы)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Гарантийный срок, от производителя" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.ТипГарантийногоСрока) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбувь.ГарантийныйСрокОтПроизводителя);
															Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитОбувь.ГарантийныйСрокОтПроизводителя;
												//Стр_а.valueType=Строка(ДополнительныйРеквизитОбувь.ТипГарантийногоСрока)
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Особые условия хранения" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.ОсобыеУсловияХранения) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбувь.ОсобыеУсловияХранения);
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитОбувь.ОсобыеУсловияХранения;
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Рекомендации по использованию" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.РекомендацияПоИспользованию) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбувь.РекомендацияПоИспользованию);
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитОбувь.РекомендацияПоИспользованию;
											КонецЕсли;											
										Конецесли;
						ИначеЕсли Стр_1.attr_group_name="Нормативно-сопроводительная документация" Тогда
										Если  Стр_1.attr_name="BRICK GPC" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.BRICKGPC) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбувь.BRICKGPC);
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитОбувь.BRICKGPC
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Номер Регламента/стандарта" Тогда
											
											Если ДополнительныйРеквизитОбувь.НомерРегламента005=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 005/2011 ""О безопасности упаковки""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
											КонецЕсли;
											
											
											Если ДополнительныйРеквизитОбувь.НомерРегламента007=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 007/2011 ""О безопасности продукции, предназначенной для детей и подростков""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
												
											КонецЕсли;
											
											
											Если ДополнительныйРеквизитОбувь.НомерРегламента017=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 017/2011 ""О безопасности продукции легкой промышленности""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
												
											КонецЕсли;
											
											Если ДополнительныйРеквизитОбувь.НомерРегламента019=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ТР ТС 019/2011 ""О безопасности средств индивидуальной защиты""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
												
											КонецЕсли;
											
											
											Если ДополнительныйРеквизитОбувь.ФЗ123=Истина Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","ФЗ от 22.07.2008 N 123-ФЗ ""Технический регламент о требованиях пожарной безопасности""");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
												
											КонецЕсли;
											
											
											 Если ДополнительныйРеквизитОбувь.БезРегламента=Истина Тогда
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value","Действие технических регламентов не распространяется");
															//Структура_добавим.Вставить("attr_value_type",Строка(ДополнительныйРеквизитОбувь.ТипГарантийногоСрока));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="ГОСТ / ТУ / СТО" Тогда
											
											Если ДополнительныйРеквизитОбувь.ГОСТЫИТУ.Количество()>0 Тогда
												
												Для Каждого Стр_ Из ДополнительныйРеквизитОбувь.ГОСТЫИТУ Цикл
													Если ЗначениеЗаполнено(Стр_.ГОСТТУ) ИЛИ ЗначениеЗаполнено(Стр_.ТипГОСТТУ) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_.ГОСТТУ);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														Конецесли;
												
												Конеццикла;
												
											КонецЕсли;
										КонецЕсли
											
											
									

								ИначеЕсли Стр_1.attr_group_name="Сведения о свидетельствах о гос. регистрации" Тогда
										Если  Стр_1.attr_name="Номер экспертного заключения (ЭЗ)" Тогда
											Если	 ДополнительныйРеквизитОбувь.СведенияОСвидетельствахОГосРегистрации.Количество()>0 Тогда
													
												Для Каждого Стр_ Из ДополнительныйРеквизитОбувь.СведенияОСвидетельствахОГосРегистрации Цикл
													Если ЗначениеЗаполнено(Стр_.НомерЭкспертногоЗаключенияЭЗ) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_.НомерЭкспертногоЗаключенияЭЗ);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_.ТипГОСТТУ));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														Конецесли;
													
													
												Конеццикла;
													 

													 
												КонецЕсли;	

											
												
											КонецЕсли;
									
									
								ИначеЕсли Стр_1.attr_group_name="Происхождение и бренды" Тогда
										Если  Стр_1.attr_name="Модель / артикул производителя" Тогда
											Если ЗначениеЗаполнено(GTIN.МодельПроизводителяАртикул)
												И ДополнительныйРеквизитБелье.ДопМодельАртикулы.Количество()=0 Тогда
												
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",GTIN.МодельПроизводителяАртикул);
															Структура_добавим.Вставить("attr_value_type",Строка("Артикул"));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												
												
												
												КонецЕсли;
											Для Каждого Стр_22 Из ДополнительныйРеквизитБелье.ДопМодельАртикулы Цикл
												Если ЗначениеЗаполнено(Стр_22.МодельАртикул) 
													ИЛИ ЗначениеЗаполнено(Стр_22.ТипМодельАртикул) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_22.МодельАртикул);
															Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												Конецесли;
												
												
											Конеццикла;
											
										Конецесли;

									
					ИначеЕсли Стр_1.attr_group_name="Дополнительная информация" Тогда
										Если  Стр_1.attr_name="Описание товара" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.ОписаниеТовара) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитОбувь.ОписаниеТовара));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитОбувь.ОписаниеТовара);
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Наименование товара на этикетке" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.НаименованиеТовараНаЭтикетке) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитОбувь.НаименованиеТовараНаЭтикетке));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитОбувь.НаименованиеТовараНаЭтикетке);
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Социально значимый товар" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.СоциальноЗначимыйТовар) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитОбувь.СоциальноЗначимыйТовар));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитОбувь.СоциальноЗначимыйТовар);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитОбувь.СоциальноЗначимыйТовар);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										ИначеЕсли  Стр_1.attr_name="Формат продажи" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.ФорматПродажи) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитОбувь.ФорматПродажи));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитОбувь.ФорматПродажи);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитОбувь.ФорматПродажи);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										ИначеЕсли  Стр_1.attr_name="Способ ввода товара в оборот" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбувь.СпособВводаТовараВОборот) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитОбувь.СпособВводаТовараВОборот));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитОбувь.СпособВводаТовараВОборот);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитОбувь.СпособВводаТовараВОборот);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
										Конецесли;
									
									
									
								КонецЕсли;
								
																
								
							//	Если Стр_1.attr_group_name="Состав" Тогда
							//		Стр_1.attributes[0].value="Мой состав";
							//	КонецЕсли;
								
							Конеццикла;
							
							
						Конецесли;
						
						
						
						МассивСтранДобавить=Новый Массив;
						УжеБылаСтрана=ложь;
						
						
						
						Для Каждого Стр_1 Из NNN Цикл
							
							Если Объект.Аттрибуты.НайтиСтроки(Новый Структура("Код",Стр_1.attr_id)).Количество()=0 ТОгда
								Добав=Объект.Аттрибуты.Добавить();
								Добав.Код=Стр_1.attr_id;
								Добав.НаименованиеГруппы=Стр_1.attr_group_name;
								Добав.Наименование=Стр_1.attr_name
							Конецесли;
							
							
							
							Если Стр_1.attr_group_name="Дополнительная информация" Тогда
										Если Стр_1.attr_name="Код товара в учетной системе поставщика" Тогда
											Если ЗначениеЗаполнено(GTIN.КодВУчетнойСистеме) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",GTIN.КодВУчетнойСистеме);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=GTIN.КодВУчетнойСистеме
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Наименование товара в учетной системе поставщика" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбщиеНК.НаименованиеТовараВУчетнойСистемеПоставщика) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбщиеНК.НаименованиеТовараВУчетнойСистемеПоставщика);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитОбщиеНК.НаименованиеТовараВУчетнойСистемеПоставщика
											КонецЕсли;
											
										ИначеЕсли Стр_1.attr_name="Ставка НДС" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбщиеНК.СтавкаНДС) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Строка(ДополнительныйРеквизитОбщиеНК.СтавкаНДС));
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=Строка(ДополнительныйРеквизитОбщиеНК.СтавкаНДС);
												//Стр_а.valueTitle=Строка(ДополнительныйРеквизитОбщиеНК.СтавкаНДС);
												//Стр_а.valueType=Неопределено
											КонецЕсли;
											
										Конецесли;
							ИначеЕсли Стр_1.attr_group_name="Наименование товара и идентификация" Тогда
										Если Стр_1.attr_name="Полное наименование товара" Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",GTIN.НаименованиеТовара);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
											//Стр_а.value=GTIN.НаименованиеТовара
											
										//ИначеЕсли  Стр_1.attr_name="Заявленный объём / вес нетто" Тогда
											
											
										Конецесли;
																
							ИначеЕсли Стр_1.attr_group_name="Происхождение и бренды" Тогда
										Если Стр_1.attr_name="Страна производства" Тогда
												Альфа=GTIN.СтранаПроизводства.Альфа2;
												Если ЗначениеЗаполнено(Альфа) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Альфа);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												КонецеслИ;	
													//Стр_а.value=Альфа;
													//Стр_а.valueTitle="("+Альфа+") "+Строка(GTIN.СтранаПроизводства);
													
													Для Каждого Стр_ДопСтр Из ДополнительныйРеквизитОбщиеНК.ДополнительныеСтраныПроизводств Цикл
														Альфа=Альфа2(Стр_ДопСтр.СтранаПроизводства);
														
														Если ЗначениеЗаполнено(Альфа) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Альфа);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														
															Конецесли;
													Конеццикла;
										ИначеЕсли Стр_1.attr_name="Суббренд" Тогда
		                                           Если ЗначениеЗаполнено(ДополнительныйРеквизитОбщиеНК.Суббренд) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбщиеНК.Суббренд);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														//Стр_а.value=ДополнительныйРеквизитОбщиеНК.Суббренд;
													КонецЕсли;
	
																								
										КонецЕсли;
																							
						ИначеЕсли Стр_1.attr_group_name="Эксплуатация и условия хранения" Тогда
										Если Стр_1.attr_name="Мин. температура, С" Тогда
											Если Значениезаполнено(ДополнительныйРеквизитОбщиеНК.МинимальнаяТемпература
										) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбщиеНК.МинимальнаяТемпература);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
											//Стр_а.value=ДополнительныйРеквизитОбщиеНК.МинимальнаяТемпература
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Макс. температура, С" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбщиеНК.МаксимальнаяТемпература) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбщиеНК.МаксимальнаяТемпература);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитОбщиеНК.МаксимальнаяТемпература
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Мин. относительная влажность, %" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбщиеНК.МинимальнаяОтносительнаяВлажность) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбщиеНК.МинимальнаяОтносительнаяВлажность);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитОбщиеНК.МинимальнаяОтносительнаяВлажность
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Макс. относительная влажность, %" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбщиеНК.МаксимальнаяОтносительнаяВлажность) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбщиеНК.МаксимальнаяОтносительнаяВлажность);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитОбщиеНК.МаксимальнаяОтносительнаяВлажность
												
											КонецЕсли;
										//ИначеЕсли  Стр_1.attr_name="Заявленный объём / вес нетто" Тогда
											
											
										Конецесли;
								
								ИначеЕсли Стр_1.attr_group_name="Идентификация Участников Оборота Товаров" Тогда
									
										Если Стр_1.attr_name="Производитель" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбщиеНК.Производитель) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбщиеНК.Производитель);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитОбщиеНК.Производитель
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Импортер" Тогда
											Если ЗначениеЗаполнено(ДополнительныйРеквизитОбщиеНК.Импортер) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбщиеНК.Импортер);
															//Структура_добавим.Вставить("attr_value_type",Строка(Стр_22.ТипМодельАртикул));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
												//Стр_а.value=ДополнительныйРеквизитОбщиеНК.Импортер
											КонецЕсли;
										ИначеЕсли Стр_1.attr_name="Изготовитель / Производственная площадка" Тогда
											
											  Если ДополнительныйРеквизитОбщиеНК.Изготовители.Количество()>0 Тогда
												
												  Для Каждого Стр_ Из ДополнительныйРеквизитОбщиеНК.Изготовители Цикл
													  Если ЗначениеЗаполнено(Стр_.Изготовитель) ИЛИ ЗначениеЗаполнено(Альфа2(Стр_.СтранаПроизводства)) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",Стр_.Изготовитель);
															Структура_добавим.Вставить("attr_value_type",Альфа2(Стр_.СтранаПроизводства));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
														Конецесли;
													Конеццикла;
												КонецЕсли;

											
											//Стр_а.value=ДополнительныйРеквизитОбщиеНК.МинимальнаяОтносительнаяВлажность
											
										//ИначеЕсли  Стр_1.attr_name="Заявленный объём / вес нетто" Тогда
											
											
										Конецесли;
							
				ИначеЕсли Стр_1.attr_group_name="Маркетинговая информация" Тогда
					 		Если Стр_1.attr_name="Маркетинговое описание" Тогда
								Если ЗначениеЗаполнено( ДополнительныйРеквизитОбщиеНК.МаркетинговоеОписание) Тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбщиеНК.МаркетинговоеОписание);
															//Структура_добавим.Вставить("attr_value_type",Альфа2(Стр_.СтранаПроизводства));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
											//Стр_а.value=ДополнительныйРеквизитОбщиеНК.МаркетинговоеОписание
										КонецЕсли;
									ИначеЕсли Стр_1.attr_name="Уникальные характеристики товара" Тогда
										Если ЗначениеЗаполнено(ДополнительныйРеквизитОбщиеНК.УникальныеХарактеристикиТовара) тогда
															Структура_добавим=Новый Структура;
															Структура_добавим.Вставить("attr_id",Стр_1.attr_id);
															Структура_добавим.Вставить("attr_value",ДополнительныйРеквизитОбщиеНК.УникальныеХарактеристикиТовара);
															//Структура_добавим.Вставить("attr_value_type",Альфа2(Стр_.СтранаПроизводства));
															МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
											//Стр_а.value=ДополнительныйРеквизитОбщиеНК.УникальныеХарактеристикиТовара
										КонецЕсли;
											
											
										Конецесли;
									
								КонецЕсли;	
					Конеццикла;
								
								
							
														
						//КонецЕсли;
							
							
						//	Если Стр_1.attr_group_name="Состав" Тогда
						//		Стр_1.attributes[0].value="Мой состав";
						//	КонецЕсли;
							
					///Конеццикла;
					
					
					
	СтруктураДляОтправки=Новый Структура();
	Если ЗначениеЗаполнено(GTIN.feed_id)  Тогда
		СтруктураДляОтправки.Вставить("good_id",GTIN.feed_id);
	Иначе
		
		Попытка
			СтруктураДляОтправки.Вставить("gtin",xmlString(число(GTIN.gtin)));
		Исключение
		КонецПопытки;
		
		
	ШтучныйТовар=Истина;
		Если ЗначениеЗаполнено(GTIN.ТипУпаковки) Тогда
					
			Если Найти(ВРег(GTIN.ТипУпаковки.Наименование),"BUNDLE")>0 Тогда
				ШтучныйТовар=Ложь;
				СтруктураДляОтправки.Вставить("is_kit",true);
				
				//Чтен.ЗаписатьИмяСвойства("is_kit");
				//Чтен.ЗаписатьЗначение(true);
				
				
			Иначе
				СтруктураДляОтправки.Вставить("is_kit",false);
				
				
			Конецесли;
				
			Если Найти(ВРег(GTIN.ТипУпаковки.Наименование),"SET")>0 Тогда
				
				ШтучныйТовар=Ложь;
				СтруктураДляОтправки.Вставить("is_set",true);
				//Чтен.ЗаписатьИмяСвойства("is_set");
				//Чтен.ЗаписатьЗначение(true);
				
				
			Иначе
				СтруктураДляОтправки.Вставить("is_set",false);
				//Чтен.ЗаписатьИмяСвойства("is_set");
				//Чтен.ЗаписатьЗначение(false);
				
				
			Конецесли;
		Конецесли;		
		
		СтруктураДляОтправки.Вставить("good_name",GTIN.НаименованиеТовара);
		СтруктураДляОтправки.Вставить("brand",GTIN.БрендТорговаяМарка);
		
		
		
	Конецесли;
	СтруктураДляОтправки.Вставить("tnved",GTIN.КодТНВЭД.Код);
	
	
	
	ШтучныйТовар=Истина;
		Если ЗначениеЗаполнено(GTIN.ТипУпаковки) Тогда
					
			Если Найти(ВРег(GTIN.ТипУпаковки.Наименование),"BUNDLE")>0 Тогда
				ШтучныйТовар=Ложь;
				
				//Чтен.ЗаписатьИмяСвойства("is_kit");
				//Чтен.ЗаписатьЗначение(true);
				
				
			Конецесли;
				
			Если Найти(ВРег(GTIN.ТипУпаковки.Наименование),"SET")>0 Тогда
				
				ШтучныйТовар=Ложь;
				
			Конецесли;
		Конецесли;		
		
	Если Объект.ТипОтправки=Перечисления.ТипОтправкиКарточекВНКПоAPI_ХамелеонЦРПТ.Модерация Тогда
		СтруктураДляОтправки.Вставить("moderation",1);
	КонецЕсли;
	
	Если GTIN.СоставНабора.Количество()>0 Тогда
		МассивНаборов=Новый Массив;
		Для Каждого Стр ИЗ GTIN.СоставНабора Цикл
			СтруктНабор=Новый Структура();
			СтруктНабор.Вставить("gtin",xmlString(Стр.Продукция.gtin));
			СтруктНабор.Вставить("quantity",xmlString(Стр.КоличествоВНаборе));
			МассивНаборов.Добавить(СтруктНабор);
		Конеццикла;
		СтруктураДляОтправки.Вставить("set_gtins",МассивНаборов);
		
		
	Конецесли;
	
	МассивУпаковок=Новый Массив;
	Если ШтучныйТовар=Истина Тогда
		
		СтруктураУпаковок=Новый Структура;
		СтруктураУпаковок.Вставить("type","gtin");
		СтруктураУпаковок.Вставить("value",xmlString(GTIN.gtin));
		СтруктураУпаковок.Вставить("level","trade-unit");
		СтруктураУпаковок.Вставить("multiplier",1);
		СтруктураУпаковок.Вставить("unit","шт");
		
		МассивУпаковок.Добавить(СтруктураУпаковок);
	Конецесли;
		
	Для Каждого Стр_123123 Из ДополнительныйРеквизитОбщиеНК.ДополнительныеУпаковки Цикл
		
		СтруктураУпаковок=Новый Структура;
		СтруктураУпаковок.Вставить("type","gtin");
		СтруктураУпаковок.Вставить("value",xmlString(Стр_123123.КодТовараУпаковки));
		Если Стр_123123.УровеньУпаковки=ПредопределенноеЗначение("Перечисление.УровниУпаковок_ХамелеонЦРПТ.ГрупповаяПотребительскаяУпаковка") тогда
			СтруктураУпаковок.Вставить("level","inner-pack");
									ИначеЕсли Стр_123123.УровеньУпаковки=ПредопределенноеЗначение("Перечисление.УровниУпаковок_ХамелеонЦРПТ.ТранспортнаяУпаковка") тогда
			СтруктураУпаковок.Вставить("level","box");
									Иначе
			СтруктураУпаковок.Вставить("level","");
										//Стр_Н.level="";
									Конецесли;
			Структура_добавим=Новый Структура;
			Структура_добавим.Вставить("attr_id",13763);
			Структура_добавим.Вставить("attr_value",Стр_123123.КодТовараВложенияВУпаковку);
			Структура_добавим.Вставить("attr_value_type","gtin");
			МассивАтрибутовДляДобавления.Добавить(Структура_добавим);
															
			СтруктураУпаковок.Вставить("multiplier",Стр_123123.КоличествоВложенийВУпаковку);
			СтруктураУпаковок.Вставить("unit","шт");
			МассивУпаковок.Добавить(СтруктураУпаковок);
	КонецЦикла;							
											//СтруктураУпаковок.Вставить("level","trade-unit");
		
		СтруктураДляОтправки.Вставить("identified_by",МассивУпаковок);
		СтруктураДляОтправки.Вставить("good_attrs",МассивАтрибутовДляДобавления);
		
		
		Если GTIN.Рисунки.Количество()>0 Тогда
			МассивРисунков=Новый Массив;
			Для Каждого Стр_1 Из GTIN.Рисунки Цикл
				
				СтруктураИзображения=Новый Структура;
				СтруктураИзображения.Вставить("photo_type",Стр_1.ТипРисунка.Код);
				СтруктураИзображения.Вставить("photo_url",Стр_1.АдресРисункаURL);
				
				
				Если ЗначениеЗаполнено(Стр_1.gtin) Тогда
					СтруктураИзображения.Вставить("identifier",Стр_1.gtin);
				Иначе
					СтруктураИзображения.Вставить("identifier",Формат(GTIN.GTIN,"ЧГ="));
					
				КонецЕсли;
				СтруктураИзображения.Вставить("identifier_type","gtin");
				МассивРисунков.Добавить(СтруктураИзображения);
			Конеццикла;
			СтруктураДляОтправки.Вставить("good_images",МассивРисунков);
			
		Конецесли;

		
	//Конеццикла;
		МассивПродукцийДляОтправкиВНК.Добавить(СтруктураДляОтправки);
	
	Конеццикла;
	
	
	Тело=ИзСтруктурыВДжсон(МассивПродукцийДляОтправкиВНК);
						
								
	Возврат тело;
	
	
			
		
	    //Продолжить;
		//СтруктураДляОтправки.Вставить("gtin",GTIN.GTIN);
		
		//ШтучныйТовар=Истина;
		//Если ЗначениеЗаполнено(GTIN.ТипУпаковки) Тогда
		//			
		//	Если Найти(ВРег(GTIN.ТипУпаковки.Наименование),"BUNDLE")>0 Тогда
		//		ШтучныйТовар=Ложь;
		//		
		//		Чтен.ЗаписатьИмяСвойства("is_kit");
		//		Чтен.ЗаписатьЗначение(true);
		//		
		//		
		//	Иначе
		//		Чтен.ЗаписатьИмяСвойства("is_kit");
		//		Чтен.ЗаписатьЗначение(false);
		//		
		//		
		//	Конецесли;
		//		
		//	Если Найти(ВРег(GTIN.ТипУпаковки.Наименование),"SET")>0 Тогда
		//		
		//		ШтучныйТовар=Ложь;
		//		Чтен.ЗаписатьИмяСвойства("is_set");
		//		Чтен.ЗаписатьЗначение(true);
		//		
		//		
		//	Иначе
		//		Чтен.ЗаписатьИмяСвойства("is_set");
		//		Чтен.ЗаписатьЗначение(false);
		//		
		//		
		//	Конецесли;
		//Конецесли;	
		//
		//
		//Чтен.ЗаписатьИмяСвойства("good_name");
		//Чтен.ЗаписатьЗначение(GTIN.НаименованиеТовара);
		//Чтен.ЗаписатьИмяСвойства("tnved");
		//Чтен.ЗаписатьЗначение(GTIN.КодТНВЭД.Код);
		//Чтен.ЗаписатьИмяСвойства("brand");
		//Чтен.ЗаписатьЗначение(GTIN.БрендТорговаяМарка);
		//
		//Если ШтучныйТовар=Истина Тогда
		//	
		//	Чтен.ЗаписатьИмяСвойства("identified_by");
		//	Чтен.ЗаписатьНачалоМассива();
		//	
		//	Чтен.ЗаписатьНачалоGTINа();;
		//	
		//	Чтен.ЗаписатьИмяСвойства("type");
		//	Чтен.ЗаписатьЗначение("gtin");
		//	
		//	Чтен.ЗаписатьИмяСвойства("value");
		//	Чтен.ЗаписатьЗначение(xmlString(GTIN.GTIN));
		//	
		//	Чтен.ЗаписатьИмяСвойства("level");
		//	Чтен.ЗаписатьЗначение("trade-unit");
		//	
		//	
		//	Чтен.ЗаписатьКонецGTINа();
		//	Чтен.ЗаписатьКонецМассива();
		//	
		//Конецесли;
		
		//Чтен.ЗаписатьКонецGTINа();
		//КоличествоОтправленных=КоличествоОтправленных+1;
	//Конеццикла;
	//Чтен.ЗаписатьКонецМассива();;
	
	//Возврат чтен.Закрыть()
КонецФункции

Функция ИзСтруктурыВДжсон(NNN)
						Джсон=Новый ЗаписьJSON;
						Джсон.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет,,,ЭкранированиеСимволовJSON.СимволыВнеASCII));
						ЗаписатьJSON(Джсон,NNN);
						
						Тело=Джсон.Закрыть();
						Возврат тело
конецфункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	Если не ЗначениеЗаполнено(Объект.ТекущийПользователь) тогда
		Форм=ПолучитьФорму("Обработка._Запуск_ХамелеонЦРПТ.Форма.Форма");
		Если Не Форм.Открыта() Тогда
			ФОрм.Окрыть();
			ЭтаФОрма.Активизировать();
			
		Конецесли;
		Объект.ТекущийПользователь=Форм.Пользователь;
		
		
	Конецесли;
КонецПроцедуры


&НаСервере
Процедура ЛогЗапросаНаСервере()
	// Вставить содержимое обработчика.
//				ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ЗапишемВРЕГИСТР_ОтправленныеПолученные_ХамелеонЦРПТ(Объект.Ссылка,ТекстСохранить,"Отправка в НК по API");
//			ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ЗапишемВРЕГИСТР_ОтправленныеПолученные_ХамелеонЦРПТ(Объект.Ссылка,Ответ.ПолучитьТелоКакСтроку(),"Ответ на отправку в НК по API");

	Хр=РегистрыСведений.ОтправленныеПолученные_ХамелеонЦРПТ.Получить(Новый Структура("Документ,Вид",Объект.Ссылка,"Отправка в НК по API")).Файл;
	Если Хр<>Неопределено тогда
		Запрос=Хр.Получить();
	Конецесли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЛогЗапроса(Команда)
	ЛогЗапросаНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЛогОтветаНаСервере()
	// Вставить содержимое обработчика.
	Хр=РегистрыСведений.ОтправленныеПолученные_ХамелеонЦРПТ.Получить(Новый Структура("Документ,Вид",Объект.Ссылка,"Ответ на отправку в НК по API")).Файл;
	Если Хр<>Неопределено тогда
		ОтветНаЗапрос=Хр.Получить();
	Конецесли;
КонецПроцедуры


&НаКлиенте
Процедура ЛогОтвета(Команда)
	ЛогОтветаНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаписыватьДанныеПриОтправкеЗаказа=РегистрыСведений.НастройкиПрограммы_ХамелеонЦРПТ.Получить().ЗаписыватьДанныеПриОтправкеЗаказа
КонецПроцедуры

