Функция ПолучитьИмяПользователя() Экспорт 
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Имя;	
КонецФункции

Функция ПолучитьФалыКМ_ОКТО()

	

КонецФункции // ПолучитьФалыКМ_ОКТО()

Процедура ВводВОборот_ПриЗаписи(Объект, Отказ)

//	Если Объект.ДополнительныеСвойства.Свойство("НеЗаполнятьСоответствие") Тогда
//		Возврат;	
//	КонецЕсли;
//	
//	СсылкаНаОбъект = Объект.Ссылка;	
//			
//	НаборЗаписей = РегистрыСведений.СопоставлениеСправочниковДокументов_ХамелеонЦРПТ.СоздатьНаборЗаписей();
//	НаборЗаписей.Отбор.Справочник_Документ.Установить(СсылкаНаОбъект);
//	
//	Если Объект.ПометкаУдаления Тогда
//		
//		НаборЗаписей.Записать();
//		Возврат;
//		
//	КонецЕсли;
//	
//	НоваяЗапись = НаборЗаписей.Добавить();
//	НоваяЗапись.Справочник_Документ = СсылкаНаОбъект;	
//	НоваяЗапись.СправочникДокумент_Меркурия = Объект.ФТО_НомерОтгрузкиДляМеркурия;	
//	НоваяЗапись.Дата 	 = Объект.Дата;
//	Попытка
//		НаборЗаписей.Записать();
//	Исключение
//		Инфо = ИнформацияОбОшибке();
//	КонецПопытки;
//	
//	
//			РегДв=РегистрыСведений.СопоставлениеСправочниковДокументов_ХамелеонЦРПТ.СоздатьНаборЗаписей();
//				РегДв.Отбор.Справочник_Документ.Установить(Стр_1);
//				Добав=РегДв.Добавить();
//				Добав.Справочник_Документ=Стр_1;
//				Добав.СправочникДокумент_Меркурия=НовыйДокумент.Ссылка;
//				РегДв.Записать(Истина);

	
КонецПроцедуры 
