
&НаСервере
Процедура ГУИДЗаписиЖурналаПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
	
	Если Не ЗначениеЗаполнено(ГУИДЗаписиЖурнала) Тогда
		Возврат;
	КонецЕсли;
	
	HTTPСервисЗапрос=New COMObject("WinHttp.WinHttpRequest.5.1");
	Если НЕ ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПодключитьсяКМеркурию_ПОСТОЯННО(HTTPСервисЗапрос,Пользователь.Инициатор,Пользователь.ПарольМеркурий,Пользователь) Тогда
		Возврат;
	Конецесли;
	
	
	
	ИнформацияОВСД.Очистить();
	Тело="recipient.commonEnterpriseNumber="+Пользователь.ИД_ВЭБ_Меркурий+"&number=&guidWithoutCheck="+ГУИДЗаписиЖурнала+"&inputProduction=null&productType=null&cargoVU.product.guid=null&cargoVU.subProduct.guid=null&qualityType=1&perishable=&originCountry=null&inputVetDocument=&_language=ru&_action=showRealTrafficVUForm&preview=true&listAction=listAllRealTrafficVU";
	
	Сайт=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПолучитьСайт();
	HTTPСервисЗапрос.Open("POST", Сайт+"/operatorui", 0);
//	Обработки._Запуск_ХамелеонМеркурий.УстановитьПрокси(HTTPСервисЗапрос);
	HTTPСервисЗапрос.SetRequestHeader("Content-Type","application/x-www-form-urlencoded");
	HTTPСервисЗапрос.Send(Тело);

	Чтение=Новый ЧтениеHTML;
	Чтение.УстановитьСтроку(HTTPСервисЗапрос.ResponseText);
	ПостроительDOM = Новый ПостроительDOM;
	ДокументHTML = ПостроительDOM.Прочитать(Чтение);

	Для Каждого Стр_1 Из ДокументHTML.ПолучитьЭлементыПоИмени("a") Цикл
		Если найти(СокрЛП(Стр_1.ТекстовоеСодержимое),"№")=1 Тогда
 			СтруктураПВСД = Новый Структура;				
			//Гиперссылка=Стр_1.Гиперссылка;
			
			
			HTTPСервисЗапрос.Open("GET", Сайт+"/"+Стр_1.Гиперссылка, 0);
		//	Обработки._Запуск_ХамелеонМеркурий.УстановитьПрокси(HTTPСервисЗапрос);
			HTTPСервисЗапрос.SetRequestHeader("Content-Type","application/x-www-form-urlencoded");
			HTTPСервисЗапрос.Send();

			ПолучСтр_1=HTTPСервисЗапрос.ResponseText;
			
			Чтение=Новый ЧтениеHTML;
			Чтение.УстановитьСтроку(ПолучСтр_1);
			ПостроительDOM = Новый ПостроительDOM;
			ДокументHTML_1 = ПостроительDOM.Прочитать(Чтение);
			//
			//
			ПараметрВСД="";
			Значение="";
			
			НомерВСД="";
			Для Каждого Стр_П Из ДокументHTML_1.ПолучитьЭлементыПоИмени("input") Цикл
				//Если Стр_П.Имякласса="profile-info-value" И ЗначениеЗаполнено(ПараметрВСД) Тогда
					Попытка
						//СтруктураПВСД.Вставить(СтрЗаменить(ПараметрВСД," ","_"),СокрЛП(Стр_П.ТекстовоеСодержимое));
						
						Добав=ИнформацияОВСД.Добавить();
						Добав.Параметр=СтрЗаменить(Стр_П.Имя," ","_");
						Добав.Значение=СокрЛП(Стр_П.Значение);
						Если Добав.Параметр="printPk" Тогда
							НомерВСД= Добав.Значение;
							
						КонецЕсли;
					Исключение
					КонецПопытки;

			//		ПараметрВСД="";
			//		Продолжить;
			//	КонецЕсли;
			//	ПараметрВСД="";
				
				
		Конеццикла;
		
		УИД="";
		    Для Каждого Стр_П Из ДокументHTML_1.ПолучитьЭлементыПоИмени("td") Цикл
				Если Стр_П.Имякласса="label" Тогда
					ПараметрВСД=СокрЛП(Стр_П.ТекстовоеСодержимое);
					Продолжить;
				КонецЕсли;
				Если Стр_П.Имякласса="value" И ЗначениеЗаполнено(ПараметрВСД) Тогда
					Попытка
						//СтруктураПВСД.Вставить(СтрЗаменить(ПараметрВСД," ","_"),СокрЛП(Стр_П.ТекстовоеСодержимое));
						
						Добав=ИнформацияОВСД.Добавить();
						Добав.Параметр=СтрЗаменить(ПараметрВСД," ","_");
						Добав.Значение=СокрЛП(Стр_П.ТекстовоеСодержимое);
						Если Добав.Параметр="Уникальный_идентификатор_ВСД:" Тогда
							УИД=Добав.Значение;
							УИД=НРег(СтрЗаменить(УИД,"-",""));
							
							УИД=Сред(УИД,1,8)+"-"+Сред(УИД,9,4)+"-"+Сред(УИД,13,4)+"-"+Сред(УИД,17,4)+"-"+Сред(УИД,21);
							
						КонецЕсли;
					Исключение
					КонецПопытки;

					ПараметрВСД="";
					Продолжить;
				КонецЕсли;
				ПараметрВСД="";
				
				
			Конеццикла;
			
			
			Элементы.ИнформацияОВСД.Заголовок="Информация о ВСД № "+НомерВСД+", UUID "+УИД
			
		
//			Если Найти(СтруктураПВСД.Наименование_и_форма_ВСД,"Производственный сертификат")>1 Тогда
//				Возврат СтруктураПВСД;
//			КонецЕсли;
			
			
		КонецЕсли;
		
	Конеццикла;
				
	
	
КонецПроцедуры

&НаКлиенте
Процедура ГУИДЗаписиЖурналаПриИзменении(Элемент)
	ГУИДЗаписиЖурналаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	Форм=ПолучитьФорму("Обработка._Запуск_ХамелеонЦРПТ.Форма.Форма");
	Если Не Форм.Открыта() Тогда
		Форм.Открыть();
		ЭтаФорма.Активизировать();
	КонецЕсли;
	
	Пользователь=Форм.Пользователь;
КонецПроцедуры
