
&НаКлиенте
Процедура ПрименитьОтбор(МассивКМ) Экспорт
	
	ОтборДелаемНаСервере(МассивКМ);
	
КонецПроцедуры


Процедура ОтборДелаемНаСервере(МассивКМ)
	ООО="";
	Попытка
	Если ЗначениеЗаполнено(МассивКМ) Тогда
		Для Каждого Стр Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если Строка(Стр.ЛевоеЗначение)="Продукция.GTIN" Тогда
				Стр.Использование=Ложь;
			Конецесли;
			Если Строка(Стр.ЛевоеЗначение)="Продукция" Тогда
				//НашлиНоменклатуру=Истина;
				//Стр.ПравоеЗначение=НоменклатураВОтбор;
				//Стр.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
				//Стр.Использование=Истина;
				
				Для каждого СтрП Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
					Если СтрП.ИдентификаторПользовательскойНастройки=Стр.ИдентификаторПользовательскойНастройки Тогда
						
						СтрП.Использование=Истина;
						СтрП.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке;
						СтрП.ПравоеЗначение=МассивКМ;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				Прервать;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
Исключение
	КонецПопытки;
	
КонецПроцедуры



&НаКлиенте
Процедура ПрименитьОтбор_ГТИН(МассивКМ) Экспорт
	
	ОтборДелаемНаСервере_ГТИН(МассивКМ);
	
КонецПроцедуры


Процедура ОтборДелаемНаСервере_ГТИН(МассивКМ)
	ООО="";
	Попытка
	Если ЗначениеЗаполнено(МассивКМ) Тогда
		Подобрали=Ложь;
		Для Каждого Стр Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если Строка(Стр.ЛевоеЗначение)="Продукция" Тогда
				Для каждого СтрП Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
					Если СтрП.ИдентификаторПользовательскойНастройки=Стр.ИдентификаторПользовательскойНастройки Тогда
						
						СтрП.Использование=Ложь;
						//СтрП.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке;
						//СтрП.ПравоеЗначение=МассивКМ;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
			Конецесли;
			Если Строка(Стр.ЛевоеЗначение)="Продукция.GTIN" 
				И Подобрали=Ложь
				Тогда
				//НашлиНоменклатуру=Истина;
				//Стр.ПравоеЗначение=НоменклатураВОтбор;
				//Стр.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
				//Стр.Использование=Истина;
				
				Для каждого СтрП Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
					Если СтрП.ИдентификаторПользовательскойНастройки=Стр.ИдентификаторПользовательскойНастройки Тогда
						Подобрали=Истина;
						СтрП.Использование=Истина;
						СтрП.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке;
						СтрП.ПравоеЗначение=МассивКМ;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				//Прервать;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
Исключение
	КонецПопытки;
	
КонецПроцедуры

