
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Вставить содержимое обработчика.
	Форм=ПолучитьФорму("Обработка._Запуск_ХамелеонЦРПТ.Форма.Форма");
	Если Форм.Организации.Количество()=0 Тогда
		Форм.ПодключитьсяКЦРПТ(Элемент,ЛОжь);
	КонецЕсли;
	Если Форм.Организации.Количество()>0 Тогда
		Если  Копирование Тогда
			Отказ = Истина;
			Парам = Новый Структура;
			Парам.Вставить("Организация", Форм.Организации[0].Организация);
			Парам.Вставить("Пользовтаель", Форм.Пользователь);
			Парам.Вставить("ЗначениеКопирования",Элемент.ТекущиеДанные.Ссылка);
			ОткрытьФорму("Документ.АвтоКорректировкаОстатковСправочник_ХамелеонЦРПТ.ФормаОбъекта", Парам,ЭтаФорма);
		Иначе
			Отказ = Истина;
			Парам = Новый Структура;
			Парам.Вставить("Организация", Форм.Организации[0].Организация);
			Парам.Вставить("Пользовтаель", Форм.Пользователь);
			ОткрытьФорму("Документ.АвтоКорректировкаОстатковСправочник_ХамелеонЦРПТ.ФормаОбъекта", Парам,ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
