
&НаКлиенте
Процедура Поле1ПриИзменении(Элемент)
	Если Сред(МаркировкаПачкиСигарет,1,6)="000000" Тогда
		Элементы.Поле3.Заголовок="EAN 8:";
		EAN13=Сред(МаркировкаПачкиСигарет,7,8);
	Иначе
		Элементы.Поле3.Заголовок="EAN 13:";
		EAN13=Сред(МаркировкаПачкиСигарет,2,13);
	КонецЕсли;
	МаксимальнаяЦенаПачкиСигарет=0;
	СерияПачки=Сред(МаркировкаПачкиСигарет,15,7);
	//Значение=Прав(МаркировкаПачкиСигарет,8);
	Значение=Сред(МаркировкаПачкиСигарет,22,4);
	
	Для Х=1 По 4 Цикл

		М=1;
		Для У=1 По 4 -Х Цикл

			М=М*80

		КонецЦикла;

		МаксимальнаяЦенаПачкиСигарет=МаксимальнаяЦенаПачкиСигарет+(Найти("ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789!""%&'*+-./_,:;=<>?",Сред(Значение,Х,1))-1)*М;

	КонецЦикла;
	МаксимальнаяЦенаПачкиСигарет=МаксимальнаяЦенаПачкиСигарет/100;

КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	// Вставить содержимое обработчика.
	Поле1ПриИзменении(Команда)
КонецПроцедуры
