
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	МММ=Новый Массив;
	Параметры.Свойство("МассивУпаковок",МММ);
	Для Каждого Стр Из МММ Цикл
		Стт=Упаковки.Добавить();
		ЗаполнитьЗначенияСвойств(Стт,Стр);
	КонецЦикла;
	Параметры.Свойство("ЕдиницаИзмерения",ЕдиницаИзмерения);
	//Параметры.Свойство("ОсновнаяУпаковка",ОсновнаяУпаковка);
	Параметры.Свойство("Продукция",Продукция);
	//Параметры.Свойство("Объем",Объем);
	Параметры.Свойство("КолВУп",КолУп);
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура Команда1(Команда)
	
	Мм=Новый Массив;
	Для Каждого Стр Из Упаковки Цикл
		
		Мм.Добавить(Новый Структура("ИмяПараметра,ЗначениеПараметра",Стр.ИмяПараметра,Стр.ЗначениеПараметра));
		
	Конеццикла;
	
	ЭтаФорма.Закрыть(Мм);
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии()
	// Вставить содержимое обработчика.
	
КонецПроцедуры

