
&НаКлиенте
Процедура Команда1(Команда)
	// Вставить содержимое обработчика.
	Если ЭтаФорма.Открыта() Тогда	
		ЭтаФорма.Закрыть();
	Конецесли;
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	// Вставить содержимое обработчика.
	ЭтаФорма.Закрыть(Строка);
КонецПроцедуры

&НаКлиенте
Процедура Поле1ПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Если ЭтаФорма.Открыта() Тогда
		ЭтаФорма.Закрыть(Строка);
	КонецеслИ;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	ЭтаФорма.Активизировать();
КонецПроцедуры
